[{"name": "李信明", "email": "richardlovebear@hotmail.com", "latestUpdate": "2012-02-24 13:03:03", "objective": "本課程以提升學生英文能力，至全民英檢中級以上的程度為目標。教學內容以加強學生日常生活中，如：購物、旅遊、定餐等用語之溝通、運用、表達及閱讀寫作等能力為主。\r\n1. 94學年度起之大學部入學新生擬修習「英文實務」課程說明：學生修習「英文實務」課程，必須參加全民英檢中級初試， 其中「聽力 測驗」及「閱讀測驗」兩項成績合計達80分以上，始得修習此課程，修課學生請持「全民英檢中級初試成績單正本及影本至」教務處註冊組登錄。）\r\n2. 為考量同學因個人生涯規劃，若參加「全民英檢」以外的英語檢定考試，例如適用於全球職場英文能力統一標準之TOEIC測驗及教育部所規定採計之其他英檢考試等。其考試成績如對應符合CEF B1級（全民英檢中級）以上者，免修英文實務。", "schedule": "Week One: Orientation& Introduction of the Textbook\r\nWeek Two: Unit One: Are First Impressions Accurate?\r\nIntroduction: Vocabulary and Phrases (tenses included)\r\nQuestion1: What is Called first impression?\r\nQuestion2: Does the first impression have an effect upon the way you\r\ntreat the person you encounter? (explain why?)\r\nQuestion 3. How to make a good first impression upon others?\r\nQuestion4: Can you detect something special about a person when you\r\nmeet?\r\nQuestion 5: How important do you think first impressions are? (explain\r\nwhy?)\r\nAssignment: Group Discussion and Performance (Centered on the learned\r\nvocabulary and phrases of “first impression” in Unit One)\r\nWeek Three:\r\nStudents’ group sharing concerning the offered question in the\r\nprevious weeks:\r\n(a)\tWe often think that the way a person behaves when we first meet him is the way he behaves all the time. Share your personal experience and explain your answers. Examples are also important ways to support.\r\n(b)\tHave you ever formed a first impression of someone that was later proved “wrong”? Please explain.\r\n(c)\tThen, have the first impressions ever become the main obstacle to the development of your human relationship or interaction? Please explain.\r\n(d)\tHave you ever been hurt by the first impression someone else has of you? Please explain.\r\n(e)\tFrom Unit One and group discussion, what do you learn?\r\nWeek Four: Unit Two—What’s more important: Taste or Nutrition?\r\nIntroduction: Nowadays, people are easily lost their health or intake of nutrition at the mercy of “taste”? But, does “taste” really mean so much to you? You agree or not?\r\nRelated Vocabulary:\r\nQuestion 1: Food is a crucial element of human life. Can you explain its\r\nimportance to you (including your daily life)?\r\nQuestion 2: Do you think that when something tastes great, it’s probably no\r\ngood for your health? (My question is that is “refined” food must be\r\nnecessarily bad?)\r\nQuestion 3: Can you list things that taste delicious, but may do something bad\r\nto your health?\r\nQuestion4: Are Fast-foods really junk foods? If the answer is positive, why do\r\npeople still prefer to eat them? (Please explain).\r\nQuestion 5: You are what you eat? (Agree or disagree? Also explain it)\r\nAssignment: Group Discussion and Performance (Centered on the learned\r\nvocabulary and phrases of “taste or nutrition” in Unit Two)\r\nWeek Five:\r\n1.\tGroup presentation based on their viewpoints concerning “nutrition or taste”\r\n2.\tInteractions and discussions: Questions from the Audience\r\n3.\tSummation(s):\r\nWeek Six: Connect what’s been learned in class with the latest occurrence(s) in the\r\nworld\r\nTopic: What’s “In”/”Hot” in the world? (Jeremy Lin is now phenomenal. Can you say something about Lin? Explain why he can become so famous in so short a while?) At a deeper level, what may Lin stand for? (Try to explain your idea(s))\r\nWeek Seven:\r\n1.\tA speech contest among groups (based on related topics discussed previously)\r\nWeek Eight:\r\nUnit Three: What can we learn from success or failure?\r\n1.\tDefinitions of what success or failure is?\r\n2.\tShould one be ashamed of failure? (Explain why?)\r\n3.\tFailure is the mother of success. Is that always true?\r\n4.\tAny “successful” person flashes through your mind? (Give us your concrete example and talk more about this person)\r\n5.\tIf a person who fails to make his dream come true, is he or she a failure?\r\n6.\tIf a person who succeeds at making his/her dream coming true, is he or she really so successful?\r\nAssignment: Research a person and express his or her influence(s)?\r\nWeek Nine:\r\n1.\tGroup presentations based on the research\r\n2.\tQuestions for the audience?\r\n3.\tSummation(s)\r\nWeek Ten: Cinema Appreciation(s) and Discussion\r\nWeek Eleven:\r\nUnit Four: Is Change Good or Bad\r\n1.\tDoes change really have an effect on the way you live?\r\n2.\tTalk about", "scorePolicy": "Mid-term:30%\r\nFinal: 40%\r\nAttendance and Class performance: 30%", "materials": "Textbook: Q: Skills for Success—Listening and Speaking (Oxford 2011)\r\nISBN: 978-0-19-475602-0", "foreignLanguageTextbooks": false}]