[{"name": "柯萊恩", "email": "kcline@ntut.edu.tw", "latestUpdate": "2012-03-06 14:13:05", "objective": "In this course we will continue to develop skills and techniques necessary for the preparation of a full-length research paper.  You will select a research topic and compose two short (2-5 page) papers and one full length (8-10 page) research essay based on both primary and secondary sources and containing a clear distinction between the two.  You will begin your research, in all likelihood, by looking at secondary sources; by the middle of the semester, however, you must have located—and physically shown to me—at least two primary textual sources.  Today, the first day of class, you will select a general topic for further research.  \r\nGive some care to selecting a workable topic.  It will work best if you have a genuine desire to learn more about your chosen area.  It is necessary for this class that your research-idea lend itself to form of theoretical speculation.  That is to say the best topics will be open-ended, qualitative r4ather than quantitative, allowing for something more than just a general recitation of facts.  To find a topic that will work for you, begin by selecting a broad area of interest.  Some general areas that I would recommend for your consideration include literature, art, film, philosophy, psychology, music and cultural studies.  But you may select any broad area that you are willing to devote your scholarly efforts to over the next four months.  During that time, you will progressively narrow your more overarching topic down so that finally you will be focusing on specific key works (that is, primary sources) to develop an original, complex thesis idea that sheds new light on your topic and the scholarship available upon it.  All of the shorter papers and informal journal writing assignments should be looked at as possible versions of portions of your final paper; and indeed your final paper may, if appropriate, be looked at as a possible precursor to your senior project.", "schedule": "All assignments are due next class session unless otherwise indicated.  For complete details of formal writing assignments and informal writing tasks (journal entries), please see appropriate writing assignment or journal entry schedule.\r\n----------------------\r\nFebruary 23\tIntroduction/ ASSIGNMENT ( Journal Entry #1): Selecting an Area of Interest\r\n\r\nMarch 1\t\tMLA Format/ JE#1 Due/ ASSIGNMENT: Compose WA#1: Research Proposal\r\n\r\nMarch 8\t\tDRAFT WA#1 DUE (with three extra copies)\r\n\r\nMarch 15\tFINAL DRAFT WA#1 DUE/ ASSIGNMENT (JE#2): Research Question and Statement of Methodology\r\n\r\nMarch 22\tJE#2 Due.  ASSIGNMENT:Compose WA#2:  Review of the Secondary Literature\r\n\r\nMarch 29\tDraft WA#2 (with three extra copies) Due: Peer Eval\r\n\r\nApril 12\t\tFINAL DRAFT WA#2 DUE/ASSIGNMENT (JE#3): Locating a Primary Source\r\n\r\nApril 19\t\tJE#3 Due/  Discussion.  ASSIGNMENT: Compose WA#3: Comparing Two Sources\r\n\r\nApril 26\tWA#3 (Draft + copies) Due/Peer Eval  \r\n\r\nMay 3\tPeer Eval WA#3, Cont’d.  Prepare group presentations\r\n\r\nMay 10\tWA#3 DUE.  Prepare group presentations.  ASSIGNMENT (JE#4):What Have You Learned So Far?\r\n\r\nMay 17\t\tJE#4 Due.  Prepare for Group Presentations\r\n\r\nMay 24\t\tGroup Presentations \r\n\r\nMay 31\t\tGroup Presentations.  ASSIGNMENT:  Compose WA#4: Research Report\r\n\r\nJune 7\t\tWA#4 DRAFT (WITH THREE EXTRA COPIES) DUE/ Peer Evaluation\r\n\r\nJune 14\t\tWA#4 Peer Evaluation\r\n\r\nFINAL PAPER DUE NOON JUNE 27\r\n----------------------------\r\nSCHEDULE OF FORMAL (GRADED) WRITING ASSIGNMENTS\r\nWRITING ASSIGNMENT #1: Research Proposal\r\nWhat topic do you propose to research over the course of the upcoming semester in this class and why?  What kinds of sources will you study (try to think of at least three different kinds of source material?  What do you know about the general biographical and historical background of your topic.  When and under what context(s) was the topic fist discussed?  Is the dominant thought on your topic tracable to a single individual or group of individuals?  Who?  Is the idea a reification of an already existing idea or is it a reaction against a prevailing current of thought?  Name and briefly review all of the sources you have emploed thus far.\r\n\r\nIMPORTANT:  YOU MUST ATTRIBUTE AND DOCUMENT EVERY SOURCE YOU USE IN THE PROPER MLA FORMAT AND INCLUDE A “WORKS CITED” PAGE AT THE END.\r\nDraft (+ 3 extra copies) Due:  MARCH 8\r\nFinal Draft Due: MARCH 15\r\n\r\nWRITING ASSIGNMENT #2:  Review of the Literature\r\nExamine, compare and evaluate all the primary and secondary sources secondary sources you have thus far uncovered and carefully distinguish one type of source from the other.  What are the relative strengths and weaknesses in the arguments presented in your source texts?  How might some sources be better suited to certain approaches than others?  Which of the sources have you personally read in their entirety, and which have been summarized for you by other scholars or thinkers?  This paper must include at least two primary sources and six secondary sources, at least three of which should be textual, and the reasons for their inclusion.  \r\nBe sure to establish, sustain and develop a strong thesis idea—that is, an original, compelling idea that helps the reader to make sense of the sources you are employing.\r\n\r\nIMPORTANT:  YOU MUST ATTRIBUTE AND DOCUMENT EVERY SOURCE YOU USE IN THE PROPER MLA FORMAT AND INCLUDE A “WORKS CITED” PAGE AT THE END.\r\nDraft (+ 3 extra copies) Due:  March 29\r\nFinal Draft Due: APRIL 12\r\n\r\nWRITING ASSIGNMENT #3: Comparing Two Primary Sources\r\nCompare and contrast two related primary sources.  Why and how have you chosen your two primary source?  In what sense are these sources “primary”?  How do the two explicate or contrast with one another?  What is the relationship between your primary sources and the scholarship existing on your topic as has been reflected in the secondary sources you wrote about in WA#2?  Which of the secondary sources you have employed are the most (or the least) reliable or helpfu", "scorePolicy": "STUDENT RESPONSIBILITIES\r\n\r\n1)\tPeer Evaluation.  A significant portion of the class will be given over to peer evaluation of essays.  The purpose of this is at least threefold:  1) to offer student writers criticism from peers, so that they may improve their work; 2) to cause each class member to articulate his or her critical concerns; and 3) to encourage the formation of a community of writers.  For peer evaluation you must be prepared to make multiple copies of your written work for other students in the class, AND YOU MUST BRING YOUR WORK AND THREE COPIES IN TO CLASS ON THE DAY THEY ARE DUE.  All peer evaluation activities—not only your having your paper evaluated, but also your active, cheerful participation in the critique of essays by your fellow classmates—are absolutely mandatory and count towards participation points in the class that cannot be made up.\r\n2)\tJournals.  Students must keep a journal on an ongoing basis containing responses to the works they are examining and share these writings with the rest of the class.  The essays that you write will be drawn from these journal entries.  To receive full credit, you must bring your journal entry to class and read it aloud on the day that it is due.  I will not accept late or e-mailed journal entries or writing assignments.\r\n3)\tPresentations.  Students will give two oral presentations in concert with two or three classmates.  Preparation of these presentations will lead to development and refinement of your final essay topic, and will provide a meaningful context for discussion in the class.\r\n\r\n4)    Attendance.  Frequent attendance is mandatory.  After your first two absences, each subsequent unexcused absence will cause your final grade to be reduced by one grade point.  If you are absent, it is your responsibility to find out the substance of class discussions and to make up homework.\r\n\r\n5)    Anyone caught plagiarizing will receive a failing grade in the course.  All outside sources that you use in the production of your papers must be properly attributed using the MLA format.\r\n\r\n\r\nGRADING\r\n\r\n25%\tPapers 1-3\t\t\t\t\r\n25%\tJournal Entries \r\n25%\tFinal Paper\t\r\n25%\tParticipation and Presentation", "materials": "　", "foreignLanguageTextbooks": false}]