[{"name": "楊韻華", "email": "yhyang@ntut.edu.tw", "latestUpdate": "2012-02-21 10:01:49", "objective": "本課程以語言教學目標為橫軸，以分析公司會議及簡報的技術層面為縱軸。課程內容包括會議程序及演練，同意、結束會議，反對、請求說明，提出方案等技巧。簡報則著重了解目的，分析聽眾與場合，確定具體目標，調查研究，構思取材，搭配視聽器材以演練方式實施。\r\nDepartment of English, National Taipei University of Technology\r\nCourse Syllabus 2012\r\nCourse Title:\t\tMeetings and Presentations in English\r\nCredit Hours:\t\t2\r\nInstructor’s Name:\tDr. Yun-Hua Yang\r\nContact E-Mail:\tyhyang@ntut.edu.tw\r\nOffice: \t        General Education Building Rm.805 / Extension: 3941, 3901\r\nTerm Offered:\t\tSpring, 2012\r\nCourse Description: \tThis course aims to enhance English-major students’ communicative competence with special emphasis on business presentations and meetings. The concentration of this course is two-fold: business presentations and business meetings.  By developing effective skills, strategies and tactful language use, students with high-intermediate proficiency level of English will be able to prepare as well as present verbal reports to achieve business goal. Students will also be expected to participate and conduct meetings productively. All student meeting/briefing/presentation sessions must be videotaped.(*1)\r\nCourse Requirements: \tStudents’ responsibilities in this class include:\r\n(1)\tAttending class regularly and to arrive on time: a sign-in sheet to record attendance / a grade reduction of 10% of the semester grade for each session absence\r\n(2)\tSubmitting to the instructor a presenter’s dossier with inclusion of the outlined briefing/presentation. Students who fail to submit the dossier as scheduled forfeit the right to deliver the speech and hence receive zero points.\r\n(3)\tEvaluating one’s own presentations: all briefings/presentations have to be videotaped by the student presenter. Student presenters are required to watch their own videotaped performance, observe their own presentations, and compile all evaluation for submission. Students are strongly advised to use their own videotaping devices. A complete electronic portfolio (on compact disc) needs to be established and submitted at the semester end.", "schedule": "Scheduled Sessions (Tentative)\r\nA.\tPresentations/Briefings\r\n(1)\tTWO Internal project presentations (Week 2—Week 4)\r\n(i)\tWeekly briefing of work-in-progress: 3 mins (individual)\r\n(ii)\tBiweekly briefing of work-in-progress: 3 mins (team)\r\n(2)\tTWO Presentations to Clients (Week 5—Week 6)\r\n(i)\tProject Presentation (1) 8-10 mins\r\n(ii)\tProject Presentation (2) 8-10 mins\r\nB.\tMeetings\r\n(1)\tBrainstorming (Week 7—Week8)\r\n(i)\tStarting and Controlling a Meeting\r\n(ii)\tAgreeing & Disagreeing\r\n(iii)\tAsking for Explanations\r\n(2)\tWinner Take All (Week9-10)\r\n(i)\tTaking a Stance\r\n(ii)\tAsking & Answering\r\n(3)\tSeeking Consensus (Week 11)\r\n(i)\tProposing Solutions\r\n(ii)\tComparing Proposals\r\n(4)\tIncorporating Contrary Views (Week 12-13)\r\n(i)\tFacing a Critical Issue\r\n(ii)\tCounterarguing\r\n(iii)\tConcluding a Meeting (Week 14-16)\r\n(5) Simulation and Final (Week 17-18)", "scorePolicy": "Grading Policy: \t(1) Academic honesty is prioritized in this class. Students should learn that plagiarism will not be tolerated. Students will fail the course without contention once an incident of plagiarism is identified in their submitted writing or presented speech.\r\n(2) The grading components are as follows:\r\nAttendance 30%   \t\tBriefings/ Presentations  30%\r\nMeeting Simulations 20%\tFinal Exam (impromptu) 20%", "materials": "Compiled Handouts by course instructor", "foreignLanguageTextbooks": false}]