[{"name": "柯萊恩", "email": "kcline@ntut.edu.tw", "latestUpdate": "2012-03-06 14:14:10", "objective": "Leaving aside the question of modernity for a moment, I would like to emphasize that this class concerns western literature, in its most literal sense.  For, at the westernmost coast of the Western world is that land of dreams and illusions, California.  The poems and stories we will be reading, the films we will be viewing and the music we will be listening to all bear on California.  Since California was originally part of a much vaster territory belonging to Mexico we will feel free to widen our scope to that portion of the West which was last settled by European immigrants.  We will consider California’s multiple origins and its many ethnicities—white, black, Chinese, Hispanic and Native American.  We will find in Hollywood the font of America’s mythology.  The cowboy, the private-eye, the movie star, all emerge in their most vivid renderings from the made-up world of the motion-picture studios.  In San Francisco, further north, other sorts of dreams, utopian, mystical, find their furthest development.  Here was the center of the beatnik movement of the 1950’s and the counter-cultural revolution of the 1960’s, each with its own music, poetry and tales to tell.  In Mexico to this day one finds a curious blend of Spanish (with its own curious combination of European and Moorish roots), and aboriginal customs and beliefs, and we will also examine these, linking ancient mythologies with the most modern the West has to offer:  the California Dream.", "schedule": "February 22\tIntroduction:  Woody Guthrie’s dust bowl ballads and John Steinbeck’s The Grapes of Wrath.  ASSIGNMENT:  Read stories by Mark Twain and Jack London\r\n\r\nFebruary 29\t“California is a Garden of Eden”: The Grapes of Wrath (film).  ASSIGNMENT:  Read Steinbeck’s “The Chrysanthemums” and “The Murder.”\r\n\r\nMarch 7\t“A Paradise to Live in or See”:  ASSIGNMENT:  Read Steinbeck’s The Red Pony.\r\n\r\nMarch 14\tHammet and San Francisco: ASSIGNMENT:  Read Dashiell Hammet’s Sam Spade stories.\r\n\r\nMarch 21\tFILM:  The Maltese Falcon.  ASSIGNMENT:  Read Hammet’s Continental Op stories.\r\n\r\nMarch 28\tJoan Didion on Los Angeles.  ASSIGNMENT:  Read essay from Slouching Towards Bethlehem.\r\n\r\nApril 11\tThe Curious Case of Howard Hughes.  ASSIGNMENT:  Read essay from Slouching Towards Bethlehem.\r\n\r\nApril 18\t. Hard Boiled to the Core:  ASSIGNMENT:  Read Raymond Chandler’s “Trouble is My Business” and “Red Wind.\r\n\r\nApril 25\tShakespeare Never Did This:  ASSIGNMENT:  Read stories from Bukowski’s Tales of Ordinary Madness.\r\n\r\nMay 2\tThe San Francisco Beat Poetry Movement\r\n\r\nMay 9\tThe Summer of Love:  Haight-Ashbury in the 1960’s\r\n \r\nMay 16\t Mexican Soul-Woman:  Maria Sabina\r\n\r\nMay 23\tHispanic-American Poetry:  ASSIGNMENT:  Read Victor Hernandez Cruz and Diana Saenz\r\n\r\nMay 30\tPhilip K. Dick novel\r\n\r\nJune 6\tPhilip K. Dick novel\r\n\r\nJune 13\tFilm based on Philip K. Dick novel", "scorePolicy": "STUDENT RESPONSIBILITIES\r\n\r\n1)  Journals.  Students must keep a journal on an ongoing basis containing responses to the works they are examining and share these writings with the rest of the class.  To receive full credit, you must bring your journal entry to class and read it aloud on the day that it is due.  I will not accept late or e-mailed journal entries or writing assignments.\r\n\r\n2) Presentations.  Students will give an oral presentation in concert with two or three classmates.  Preparation of these presentations will lead to development and refinement of your understanding of literature, and will provide a meaningful context for discussion in the class.\r\n\r\n3)  Attendance.  Frequent attendance is mandatory.  After your first two absences, each subsequent unexcused absence will cause your final grade to be reduced by one grade point.  If you are absent, it is your responsibility to find out the substance of class discussions and to make up homework.  \r\n\r\n4)  Anyone caught plagiarizing will receive a failing grade in the course.  All outside sources that you use in the production of your papers must be properly attributed using the MLA format.\r\n\r\n\r\nGRADING\r\n\r\n25%\tMidterm Exam\t\t\t\t\r\n25%\tParticipation\r\n25%\tHomework Assignments\t\t\t\r\n25%\tFinal Exam", "materials": "　", "foreignLanguageTextbooks": false}]