[{"name": "楊韻華", "email": "yhyang@ntut.edu.tw", "latestUpdate": "2012-02-21 12:06:07", "objective": "本科目旨在探討現實世界裡語言和溝通的種種現象，如：社會中之語言變化、大眾媒體的語言使用等，並介紹應用語言學門之緣起和現況。學生將需要分享自己對於本地或國際有關語言應用議題的觀察，例如：職場溝通模式、辨識性言詞分析、語言教學/測試趨勢、口筆翻譯項目、語言在新型媒體中之應用等。\r\nDepartment of English, National Taipei University of Technology\r\nCourse Syllabus\r\nCourse Title:\t\tApplied Linguistics\r\nCredit Hours:\t\t3\r\nInstructor’s Name:\tDr. Yun-Hua Yang\r\nContact E-Mail:\tyhyang@ntut.edu.tw\r\nTerm Offered:\t\tSpring, 2012\r\nScheduled Class Hours: Friday 1:10-4:00 P.M.\r\nOffice Hours:      By appointment\r\nRequired Texts:  1) Issues in Applied Linguistics by Michael McCarthy, Cambridge University Press 2001\r\n2) An Introduction to Applied Linguistics by Norbert Schmitt, Hodder Education 2010\r\n3) Introducing Applied Linguistics: Concepts and Skills by Susan Hunston and David Oakey, Routledge 2010\r\nCourse Description: This course will look at several prominent issues of applied linguistics studies, ranging from language description to essential areas of enquiry in applied linguistics. Applied linguistics addresses the need to understand how the role of language is played in many aspects of human activities in order to inform language-related policy making.\r\nCourse Objectives:  This course aims to help the students\r\n(1) to understand the principles governing applied linguistics studies\r\n(2) to examine studies and theories in major applied linguistics issues\r\n(3) to encourage students to engage in more applied linguistics studies\r\nCourse Requirements:\r\n(1)\tAll students are required to use a copyrighted textbook. No photocopied edition will be accepted for use in class. It is important for students to be aware that legal action will potentially be sought by the publisher in the case of using an unauthorized duplicated text.\r\n(2)\tSubmit a summary of the chapter section assigned to students and give a brief presentation. (sample provided) Students are divided into four groups. Each group will be responsible for providing a précis of one chapter assigned respectively. Each summary needs to be submitted to the instructor and distributed to the class prior to / on the date when the content chapter content is scheduled to be introduced.\r\n(3)\tQuizzes (2-3), midterm and final exams will be implemented. Students must follow all instructed testing requirements.\r\n(4)\tEach student will be given abundant opportunities to provide his/ her response toward the assigned reading content as the lectures proceed. Students must complete all readings assigned prior to the class session.\r\n(5)\tAdditional readings will be assigned if necessary. As applied linguistics is multi-disciplinary in nature and comprises a broad array of theories and studies, students who are highly interested in this field are strongly encouraged to consult the professor for further suggested readings. In order to earn extra credits, students are obligated to submit a short critique of the recommended reading text.\r\n(6)\tAttendance: Students are required to attend the class as scheduled.\r\ni.\tEach unexcused absence will result in 10% semester grade deduction.\r\nii.\tAt the sole discretion of the instructor, some absence penalties may be waived with valid proof and just cause. No Penalty waiver request will only be accepted in two weeks of the date of absence. Students forfeit the right of contention after that. It is important to know that only ONE- time penalty waiver will be granted to any student.\r\niii.\tLateness to class: Any arrival to class after the instructor finishes the second-round roll call is considered lateness. Two times of lateness will, in effect, incur a grade penalty of 5% semester grade deduction.", "schedule": "Weekly Syllabus \r\nWeek \tText Chapter \r\n1\tOrientation / Applying Linguistics: disciplines, theories, models and descriptions (McCarthy)\r\n2\tApplying Linguistics: disciplines, theories, models and descriptions (McCarthy)\r\n3\tGrammar_1 (Schmitt) \r\n4\tGrammar_2 (Schmitt) / Vocabulary_1 (Schmitt)\r\n5\tVocabulary_2 (Schmitt) / Discourse Analysis_1 (Schmitt)\r\n6\tDiscourse Analysis_2 (Schmitt) \r\n7\tNo Class (University Day-Off)\r\n8\tReview \r\n9\tMidterm \r\n10\tPragmatics_ 1 (Schmitt)\r\n11\tPragmatics_2 (Schmitt)\r\n12\tSecond Language Acquisition (Schmitt) \r\n13\tPsycholinguistics (Schmitt) \r\n14\tSociolinguistics (Schmitt) \r\n15\tWorld Englishes: Learning English in a global context (Houston & Oakey) \r\n16\tThe Translator’s Choice (Houston & Oakey)\r\n17\tReview \r\n18\tFinal Exam \r\n*Class schedule is subject to necessary modifications at the professor’s discretion.", "scorePolicy": "Evaluation Procedures & Grading System:\r\nFinal grades will be determined by a point system (X out of 100 total points). Students will be evaluated by the following components.\r\n(1)\tSummary & Presentation 10%\r\n(2)\tQuizzes 10%\r\n(3)\tMidterm 30%\r\n(4)\tFinal 30%\r\n(5)\tAttendance 20%\r\n** Keep the syllabus for future reference.**", "materials": "Required Texts:  1) Issues in Applied Linguistics by Michael McCarthy, Cambridge University Press 2001\r\n2) An Introduction to Applied Linguistics by Norbert Schmitt, Hodder Education 2010\r\n3) Introducing Applied Linguistics: Concepts and Skills by Susan Hunston and David Oakey, Routledge 2010", "foreignLanguageTextbooks": false}]