[{"name": "施欣文", "email": "sharinschroeder@ntut.edu.tw", "latestUpdate": "2012-03-01 11:45:07", "objective": "COURSE OVERVIEW\r\nBritish and American Fiction is a fascinating and inexhaustible subject. In this course, I hope to guide you through a general history of fiction in British and American writing. The books we are reading (Jane Eyre [1847], Alice’s Adventures in Wonderland [1865], Huckleberry Finn [1884], and 1984 [1949]), are books that people in Britain or the U.S. would be nearly as likely to pick up for fun as they would be to read them in class. They’re also books that almost everyone knows something about—even if individuals haven’t read the book. Knowing these books and the context they came out of will give you the ability to understand many ideas that are central to British and American identity and culture.\r\nIn addition to the main texts we read, in class we will do a general study of prose fiction from one of the first printed works in English, Malory’s Morte d’Arthur (printed by William Caxton in 1485) onward. Through informal investigations and in-class activities, you will learn the literary and historical context of novel the in each era. How has fiction changed from 1485 to the present? How did the purpose of writing change? How have tastes changed? And why are these changes important?", "schedule": "COURSE CALENDAR\r\n(SUBJECT TO CHANGE)\r\n-----------------------------------\r\nDate and Topics:\r\nWeek 1\r\n2/23\r\nWhat is fiction? The Rise of the Novel\r\nTopic/In-class Activities:\r\nChaucer’s Pardoner’s Tale (Canterbury Tales, 1387–1400, Printed by Caxton in 1476, 1483)\r\nMalory’s Morte d’Arthur, 1450s to 1470, printed by Caxton in 1485)\r\nBunyan’s Pilgrim’s Progress (1678)\r\nBehn’s Oroonoko (1688)\r\n-----------------------------------\r\nDate and Topics:\r\nWeek 2\r\n3/1\r\nEarly novels, continued.\r\nTopic/In-class Activities:\r\nJohnson’s “On Fiction”\r\nRasselas (1750)\r\nPreface to The Castle of Otranto (1764)\r\nPreface to Caleb Williams (1794)\r\nPreface to Frankenstein (1818)\r\nAssignments (listed on their due date):\r\nSwift’s Gulliver’s Travels (1726) and Austen’s Pride and Prejudice, Ch. 1 (1818).\r\n-----------------------------------\r\nDate and Topics:\r\nWeek 3\r\n3/8\r\nTopic/In-class Activities:\r\nAlice aloud (Bring your copy of the text to class. You do not need to read it beforehand.)  Ch. 1–2\r\nAssignments (listed on their due date):\r\nJane Eyre\r\nCh. 1–4\r\n-----------------------------------\r\nDate and Topics:\r\nWeek 4\r\n3/15\r\nTopic/In-class Activities:\r\nAlice aloud: Ch. 3–4)\r\nAssignments (listed on their due date):\r\nJane Eyre\r\nCh. 5–9\r\n-----------------------------------\r\nDate and Topics:\r\nWeek 5\r\n3/22\r\nTopic/In-class Activities:\r\nAlice aloud: (Ch. 5–6)\r\nAssignments (listed on their due date):\r\nJane Eyre\r\nCh. 10–16\r\n-----------------------------------\r\nDate and Topics:\r\nWeek 6\r\n3/29\r\nTopic/In-class Activities:\r\nAlice aloud: (Ch. 7–8)\r\nAssignments (listed on their due date):\r\nJane Eyre\r\nCh. 17-20\r\n-----------------------------------\r\nWeek 7\r\n4/5\r\nNo class\r\n-----------------------------------\r\nDate and Topics:\r\nWeek 8\r\n4/12\r\nTopic/In-class Activities:\r\nAlice aloud: (Ch. 9–12)\r\nAssignments (listed on their due date):\r\nJane Eyre\r\nCh. 21-30 (Optional Reading: ch. 31–32)\r\n-----------------------------------\r\nDate and Topics:\r\nWeek 9\r\n4/19\r\nTopic/In-class Activities:\r\nHuckleberry Finn aloud\r\nAssignments (listed on their due date):\r\nJane Eyre\r\n33–38\r\n-----------------------------------\r\nDate and Topics:\r\nWeek 10\r\n4/26\r\nTopic/In-class Activities:\r\nAlice and other Nonsense: Huckleberry Finn aloud\r\nAssignments (listed on their due date):\r\nRead Through the Looking-Glass, ch. 1 and ch. 6–7\r\nBegin reading Huckleberry Finn\r\n-----------------------------------\r\nDate and Topics:\r\nWeek 11\r\n5/3\r\nTopic/In-class Activities:\r\nAmerican Literature\r\nAssignments (listed on their due date):\r\nHuckleberry Finn reading TBA\r\n-----------------------------------\r\nDate and Topics:\r\nWeek 12\r\n5/10\r\nTopic/In-class Activities:\r\nAmerican Literature\r\nAssignments (listed on their due date):\r\nHuckleberry Finn reading TBA\r\n-----------------------------------\r\nDate and Topics:\r\nWeek 13\r\n5/17\r\nTopic/In-class Activities:\r\nAmerican Literature\r\nIn-class peer review\r\nAssignments (listed on their due date):\r\nHuckleberry Finn (finish through chapter 16)\r\nPaper Draft\r\n-----------------------------------\r\nDate and Topics:\r\nWeek 14\r\n5/24\r\nAssignments (listed on their due date):\r\nGeorge Orwell\r\n1984: Part One, Ch. 1–4\r\n-----------------------------------\r\nDate and Topics:\r\nWeek 15\r\n5/31\r\nAssignments (listed on their due date):\r\n1984: Part One, Ch. 5–8\r\nFinal Paper\r\n-----------------------------------\r\nDate and Topics:\r\nWeek 16\r\n6/7\r\nAssignments (listed on their due date):\r\n1984: Part Two\r\n-----------------------------------\r\nDate and Topics:\r\nWeek 17\r\n6/14\r\nTopic/In-class Activities:\r\nDiscuss 1984. Review for Final Exam\r\nAssignmen", "scorePolicy": "PARTICIPATION\r\nYour participation is key to the success of this course. Please try to make productive statements or ask interesting questions in class each week, and be sure to stay on task during group work. Someone with a high grade in participation shows a thorough engagement with the course readings and visual media, speaks only English in class and takes notes almost exclusively in English, jots down questions in a notebook while reading in order to bring these questions up in class discussion, writes original and creative presentations, responds to the presentations of others, frequently makes thoughtful contributions that raise the level of our class discussion, takes notes in class, is trustworthy, takes academic honesty seriously, stays focused and on-task during class periods, is helpful and engaged during in-class workshops, interacts positively and tactfully with other class members, and reads with expression and enthusiasm.\r\nIf you are worried about your level of participation, please see me. Shy people can do as well in their participation grade as outgoing people, but both shy and outgoing people have to put in effort. Participation is not how much you say or how smart you can show me you are: contribute in ways that help you and the people around you learn. Know that thoughtful questions are quite as valuable as other kinds of participation.\r\n-----------------------------------\r\nGRADING AND OTHER POLICIES\r\nGrade Percentages:\r\nI may modify these grade weights at my discretion. If I do so, I will let you know.\r\nIn-class Writing and Reading Quizzes: 30%\r\nPaper: 30%\r\nFinal: 25%\r\nIn-class Activities and Participation: 15%\r\nGrading Criteria:\r\nA\tSuperior work. Achievement that is outstanding relative to the level necessary to meet course requirements.\r\nB\tAchievement that is significantly above the level necessary to meet course requirements.\r\nC \tAchievement that meets the course requirements in every respect.\r\nD \tAchievement that fails to meet fully the course requirements.\r\nF \tAchievement that is not worthy of credit. The only way to outright fail this course is through lack of effort and/or plagiarism. The student may not participate in classroom work. Assignments are either (a) completed but not completed at a level of achievement that is not worthy of credit; (b) frequently late, thereby lowering the grade too significantly to give the student a chance to pass; or (c) never completed at all.\r\nReactions to Grades:\r\nHopefully this won’t happen, but if you are surprised by a low grade and want to discuss it, I request that you take twenty-four hours to think about your grade and my comments before approaching me. I am happy to talk with you during office hours about how to improve your writing.\r\n-----------------------------------\r\nATTENDANCE AND TARDINESS POLICIES\r\nAbsences:\r\nI will record attendance from each class meeting. If you have perfect attendance, I will add 1% to your final grade. If you have three unexcused absences, on the other hand, you cannot pass the class. Please e-mail me if you will be absent, preferably before class and no later than 24 hours after class. I will not explain what you missed or send you class notes over e-mail; however, students who keep me informed about their absences consistently do better in the class than those who do not. You are always responsible for knowing exactly what happens during all class meetings. If you miss a class session, telephone or email a member of the class, and ask him/her what you missed and what you need to be ready for at the meeting to come.\r\nAttendance requires your presence in both body and mind. If you are not prepared to participate, you may be counted absent.\r\nPunctuality: Please also remember to be on time. If you are more than five minutes late, I count that as half an absence. (Please talk with me if there is a consistent problem, e.g. another professor who goes ten minutes over ever week.) We will usually", "materials": "TEXTS\r\nJane Eyre (Charlotte Brontë)\r\nAlice’s Adventures in Wonderland and Through the Looking Glass (Lewis Carroll)\r\nHuckleberry Finn (Mark Twain)\r\n1984 (George Orwell)\r\nAdditional Readings will be provided in the Course Packet and or e-mailed to you (Please print these.)\r\n-----------------------------------\r\nUSE OF TECHNOLOGY\r\nI ask that students do not use laptops, cell phones, mp3 players, or other electronic devices in my class. If you do have a cell phone in your bag, make sure it’s turned off and don’t have it out. Never respond to an electronic device during class. If you are using your laptop or any other electronic device inappropriately in class, you will be marked absent. Please print out any e-mailed readings so that you can follow along and make eye contact with your classmates.\r\nOutside of class, please check your e-mail regularly. I frequently send students e-mails that will help them in the class. Also, in the unlikely event that class is cancelled, I will communicate this to you via email.\r\n-----------------------------------\r\nOFFICE HOURS\r\nI prefer not to answer writing questions by e-mail. Students tend either (a) to procrastinate while waiting to hear from me (wasting their own time), or (b) to move on, so that they no longer need my answer by the time I am able to respond to their question (wasting my time). If you would like to discuss a writing issue with me, set up a time to meet with me in person. If you do set up a time to meet with me, feel free to include your writing question in the e-mail. I will not answer it over e-mail, but I will think about it, and we can discuss it when you come to my office. I can be most helpful if you bring in an introduction and/or draft and several specific questions about the draft.\r\n-----------------------------------\r\nETHICS\r\nPlease show yourself to be trustworthy in all areas. All of your work should be original and well documented. Below is a description of academic dishonesty:\r\nScholastic dishonesty means plagiarizing; cheating on assignments or examinations; engaging in unauthorized collaboration on academic work; asking a friend for a summary rather than doing the reading yourself; having a friend rewrite sections of your essay; taking, acquiring, or using test materials without faculty permission; submitting false or incomplete records of academic achievement; acting alone or in cooperation with another to falsify records or obtain dishonestly grades, honors, awards, or professional endorsement; altering, forging, or misusing a University academic record; or fabricating or falsifying data, research procedures, or data analysis.\r\nPlagiarism can include\r\n．submitting a paper written by means of inappropriate collaboration;\r\n．submitting a paper written by you for another course, submitted without the permission of both instructors;\r\n．submitting a paper purchased, downloaded, or cut and pasted from the Internet;\r\n．failing to properly acknowledge its sources through standard citations.\r\nAs you work to express your ideas, particularly avoid these pitfalls:\r\n1)\tLooking at many websites (or books) without taking scrupulous notes. Be a careful researcher. I have known good students who unintentionally plagiarized because phrasing they had read from web pages stuck in their head, and they didn’t cite it.\r\n2)\tRepeating, paraphrasing, or expanding on a source’s argument without adequate citation (Instead, clearly explain and cite the source’s argument, and then show how your own ideas diverge from the source. Even if you paraphrase ideas in your own words, you still need to cite them.)\r\n3)\tLifting any portions from another article without using quotation marks and citation.\r\nIf scholastic dishonesty is suspected, you will receive a zero on the assignment. You may also fail the course and/or face other disciplinary action.", "foreignLanguageTextbooks": false}]