[{"name": "黃恩宇", "email": "kant1202@ms16.hinet.net", "latestUpdate": "2012-02-19 23:49:46", "objective": "This course explores the history of the ‘modern architecture movement’ taking place primarily in Europe and in the United States from the 19th century to the post-World War II era. During this time, the idea of how architecture and architects should be underwent a radical change, due largely to the massive industrialization, the rapid urbanization and the destructive wars. Most of the architects involved in the modern architecture movement were of the opinion that ‘modern architecture’ should play a role in improving the lives of modern people and in solving the problems caused by the modern society. A number of groups, schools, architects and their works which highlighted and contributed to the modern architecture movement will be introduced in this course", "schedule": "Week 1:  An Introduction to the History of Modern Architecture\r\nWeek 2:  Architecture in the industrialization and the urbanization of the\r\n19th-century Europe\r\nWeek 3:  Structural Rationalism (Henri Labrouste, August Pugin, Eugène\r\nViollet-le-Duc, Auguste Perret and Hendrik Petrus Berlage)\r\nWeek 4:  New Architecture in the United States (Chicago School and Frank\r\nLloyd Wright)\r\nWeek 5:  Art Nouveau in France and Belgium (Hector Guimard, Victor Horta\r\nand Henry van de Velde)\r\nWeek 6:  Arts and Crafts Movement in the UK (John Ruskin William Morris,\r\nAugustus Pugin and Charles Rennie Mackintosh)\r\nWeek 7:  Day Off\r\nWeek 8:  Art Nouveau in Spain (Antoni Gaudí)\r\nWeek 9:  Midterm Exam\r\nWeek 10: Vienna Secession (Otto Wagner, Joseph Maria Olbrich and Adolf\r\nLoos)\r\nWeek 11: Jugendstil and Werkbund in Germany (Henry Van de Velde,\r\nRichard Riemerschmid, August Endell, Josef Hoffmann and Peter\r\nBehrens)\r\nWeek 12: De Sijl in the Netherlands (Theo van Doesburg, Piet Mondrian, J. J.\r\nP. Oud and Gerrit Rietveld)\r\nWeek 13: Expressionist Architecture (Erich Mendelsohn, Johann Friedrich\r\nHöger, Pieter Kramer, Michel de Klerk, Rudolf Steiner and Josef\r\nFranke)\r\nWeek 14: Walter Gropius, Ludwig Mies van der Rohe, Le Corbusier and Alvar\r\nAalto\r\nWeek 15: CIAM (Congrès internationaux d'architecture moderne) between\r\nWWI and WWII\r\nWeek 16: TEAM 10 and Structuralism after the WWII\r\nWeek 17: Other Important Trends of Architecture after the WWII\r\nWeek 18: Final Exam", "scorePolicy": "Midterm Exam: 30%\r\nFinal Exam: 30%\r\nPaper: 40%", "materials": "List of Readings:\r\n\r\n1. Joedicke, Jürgen (1959). A History of Modern Architecture. New York:\r\nFrederick A. Praeger.\r\n2. Frampton, Kenneth (1992). Modern Architecture: A Critical History.\r\nLondon: Thames & Hudson.\r\n3. Giedion, Sigfried (2009). Space, Time and Architecture: The Growth of a\r\nNew Tradition. Cambridge: Harvard University Press.\r\n4. Ibelings, Hans (2011). European Architecture since 1890. Amsterdam:\r\nSun Publisher.\r\n5. Pevsner, Nikolaus (1986). The Sources of Modern Architecture and\r\nDesign. London: Thames & Hudson.\r\n6. Wolfe, Tom (1999). From Bauhaus to Our House. New York: Bantam.\r\n7. Watkin, David (2011). A History of Western Architecture. London:\r\nLaurence King Publishers.\r\n8. Heynen, Hilde (1999). Architecture and Modernity: A Critique. Cambridge: The MIT Press.", "foreignLanguageTextbooks": false}]