[{"name": "施欣文", "email": "sharinschroeder@ntut.edu.tw", "latestUpdate": "2012-03-01 12:45:03", "objective": "SUPPLIES\r\n．Course Packet and/or e-mailed readings and handouts. Please always print these and bring them to class. Do not use electronic devices in class.\r\n．A journal, pens, and loose-leaf paper for in-class writing and quizzes\r\n．A dry-erase marker and a cleaning cloth\r\n．A pocket folder in which to submit papers and drafts\r\n．A binder in which to keep all your class readings (highly recommended)", "schedule": "COURSE CALENDAR\r\n(SUBJECT TO CHANGE)\r\n-----------------------------------\r\n\r\nWeek 1, 2/21\r\n\r\nTopic/Reading:\r\nLogic Fallacies/Review\r\n\t\r\n-----------------------------------\r\n\r\nWeek 2, 2/28\r\n\r\nTopic/Reading:\r\nPeace Memorial Day—No Class\r\n\r\n-----------------------------------\r\n\r\nWeek 3, 3/6\r\n\r\nTopic/Reading:\r\nfrom Plato’s The Meno\r\nTips from Peter Elbow’s Writing with Power\r\n\r\n-----------------------------------\r\n\r\nWeek 4, 3/13\r\n\r\nTopic/Reading:\r\nFrom Surprised by Joy, “The Great Knock”\r\nConducting Research: Popular and Scholarly Sources\r\n\r\n\r\nOther Assignment:\r\nDialog Due\r\n\r\n-----------------------------------\r\n\r\nWeek 5, 3/20\r\n\r\nTopic/Reading:\r\n“Writing for Teachers”\r\n\r\nOther Assignment:\r\nBring in a J-Stor, Project Muse, or other scholarly article. Attach a short paragraph explaining what the thesis is and how the article answered the “So what?” question. \r\n\r\n\r\n-----------------------------------\r\n\r\nWeek 6, 3/27\r\n\r\nTopic/Reading:\r\n“Politics and the English Language” George Orwell\r\n\r\nOther Assignment:\r\nArgument Paper: Introduction\r\n\r\n\r\n-----------------------------------\r\n\r\nWeek 7, 4/3\r\n\r\nTopic/Reading:\r\n“Why Worry About Words?”\r\nPeer Review\r\n\r\n\r\nOther Assignment:\r\nArgument Paper, Draft 1\r\n\r\n-----------------------------------\r\n\r\nWeek 8, 4/10\r\n\r\nTopic/Reading:\r\n“Thorough Revision” (Peter Elbow)\r\n\r\n-----------------------------------\r\n\r\nWeek 9, 4/17\r\n\r\nMidterm Week\r\n\r\n-----------------------------------\r\n\r\nWeek 10, 4/24\r\n\r\nTopic/Reading:\r\nReading TBA\r\n\r\nOther Assignment:\r\nArgument Paper, Final Draft\r\n\r\n-----------------------------------\r\n\r\nWeek 11, 5/1\r\n\r\nTopic/Reading:\r\nE. Nesbit’s “The Story of the Treasure-Seekers”\r\nLewis “On Three Ways of Writing for Children” \r\n\r\nOther Assignment:\r\nScholarly Literary Article Analysis Due\r\n\r\n----------------------------------\r\n\r\nWeek 12, 5/8\r\n\r\nTopic/Reading:\r\nPoems and short stories for the literary analysis: TBA\r\n\r\n-----------------------------------\r\n\r\nWeek 13, 5/15\r\n\r\nTopic/Reading:\r\nReading TBA\r\n\r\n-----------------------------------\r\n\r\nWeek 14, 5/22\r\n\r\nTopic/Reading:\r\nPeer Review\r\n\r\nOther Assignment:\r\nLiterary Analysis, Draft 1\r\n\r\n-----------------------------------\r\n\r\nWeek 15, 5/29\r\n\r\nTopic/Reading:\r\nProfessor Krug’s Tips for Revising/Grading a Literary Analysis Paper\r\n\r\nOther Assignment:\r\nDo the drafts you read fit in any of categories from the Self-revision sheet?\r\n\r\n-----------------------------------\r\n\r\nWeek 16, 6/5\r\n\r\nTopic/Reading:\r\nReading TBA\r\n\r\nOther Assignment:\r\nLiterary Analysis, Final Draft\r\n\r\n-----------------------------------\r\n\r\nWeek 17. 6/12\r\n\r\nTopic/Reading:\r\nReview for Exam\r\n\r\nOther Assignment:\r\nReflection Paper Due\r\n\r\n----------------------------------\r\n\r\nWeek 18, 6/19\r\n\r\nOther Assignment:\r\nFINAL EXAM (Grammar, formatting, MLA, logical fallacies, rhetorical figures, etc.) \r\n\r\n-------------------------------------------------\r\nAs the semester goes on, I will assign additional readings on writing and grammar as well as some grammar homework. Be prepared for these assignments. \r\n\r\n(This syllabus may be modified at my discretion)\r\n-------------------------------------------------", "scorePolicy": "ASSIGNMENTS\r\n．In order to receive credit for this course, you must complete all assignments, drafts, and revisions.\r\n．You are expected to make substantial revisions to each draft so that you can think about your issue as deeply and specifically as possible.\r\n．All assignments are due in hard copy at the beginning of class. (You will have technology problems. Make sure to print your paper early enough that you will not run into difficulties with non-functioning printers.) For formal papers I take off 5% if you are late to class on a paper due date (10% if you are fifteen or more minutes late), 10% if the paper is turned in within twenty-four hours after the due date (e.g. if the paper is due on Tuesday, before 1:00 on Wednesday), 20% if the paper is turned in within forty-eight hours of the deadline (before 1:00 on Thursday). You will not receive any credit for a paper turned in more than 48 hours late. I hope that you will turn in all papers on time, but in the event that a paper is late, bring it to my office. If I am not in my office, slip the paper under the door or put it my box. Please also immediately send me an e-mail alerting me that you have left a paper for me. If you wish to receive credit for a late paper, it is your responsibility to make sure that the paper gets to me safely.\r\n．In addition to the paper assignments, you will have informal writing exercises, grammar homework, quizzes, peer reviews, and presentations. Informal writing assignments, homework, and quizzes are not usually listed on the syllabus.\r\n．No credit is given for late homework. If you will be absent, get me the assignment ahead of time.\r\n．Please bring a notebook with removable pages to every class period. Begin freewrites on a new page. (I sometimes collect them. I sometimes don’t.)\r\n-----------------------------------\r\nGRADING AND OTHER POLICIES\r\nGrade Percentages:\r\nFormal Papers: 60%\r\nInformal Writing: 15%\r\nParticipation: 10%\r\nHomework and quizzes: 15%\r\nI may modify these grade weights at my discretion. If I do so, I will let you know.\r\nGrading Criteria:\r\nA\tSuperior work. Achievement that is outstanding relative to the level necessary to meet course requirements.\r\nB\tAchievement that is significantly above the level necessary to meet course requirements.\r\nC \tAchievement that meets the course requirements in every respect.\r\nD \tAchievement that fails to meet fully the course requirements.\r\nF \tAchievement that is not worthy of credit. The only way to outright fail this course is through lack of effort. The student may not participate in classroom work. Assignments are either (a) completed but not completed at a level of achievement that is not worthy of credit; (b) frequently late, thereby lowering the grade too significantly to give the student a chance to pass; or (c) never completed at all.\r\nReactions to Grades:\r\nHopefully this won’t happen, but if you are surprised by a low paper grade and want to discuss it, I request that you take twenty-four hours to think about your essay and my comments before approaching me. I am happy to talk with you during office hours about how to improve your writing.\r\n-----------------------------------\r\nATTENDANCE AND TARDINESS POLICIES\r\nComing to class late or leaving class early disrupts class discussion and activities. In addition, you miss important class announcements concerning future class sessions. You may also miss assignments and quizzes. (Quizzes in my class cannot be made up. Your lowest quiz score will be dropped.) Plan to arrive on time and be prepared to work during the entire class period. If you are five minutes late, that counts as half an absence. If you have three unexcused absences, you will fail the course. On the other hand, if you attend every class session and are on time, I will raise your final grade by 1%. Attendance requires your presence in both body and mind. If you are not prepared to participate and engage in class discussion and activities, you may be counted abse", "materials": "USE OF TECHNOLOGY\r\nPlease have hard copies of all readings. I ask that students do not use laptops, cell phones, iPods, or other electronic devices in my class. (I find that laptop use in discussion-based classes discourages eye contact and distracts students around you.) If you do have a cell phone in your bag, make sure it’s turned off. Never respond to an electronic device during class. If you are using your laptop or any other electronic device inappropriately in class, you will be marked absent.\r\n-----------------------------------\r\nOFFICE HOURS\r\nI prefer not to answer writing questions by e-mail. Students tend either (a) to procrastinate while waiting to hear from me (wasting their own time), or (b) to move on, so that they no longer need my answer by the time I am able to respond to their question (wasting my time). If you would like to discuss a writing issue with me, set up a time to meet with me in person. If you do set up a time to meet with me, feel free to include your writing question in the e-mail. I will not answer it over e-mail, but I will think about it, and we can discuss it when you come to my office. I can be most helpful if you bring in an introduction and/or draft and several specific questions about the draft.\r\n-----------------------------------\r\nETHICS\r\nPlease show yourself to be trustworthy in all areas. All of your work should be original and well documented. Below is the university’s policy on academic dishonesty:\r\nScholastic dishonesty means plagiarizing; cheating on assignments or examinations; engaging in unauthorized collaboration on academic work; asking a friend for a summary rather than doing the reading yourself; having a friend rewrite sections of your essay; taking, acquiring, or using test materials without faculty permission; submitting false or incomplete records of academic achievement; acting alone or in cooperation with another to falsify records or obtain dishonestly grades, honors, awards, or professional endorsement; altering, forging, or misusing a University academic record; or fabricating or falsifying data, research procedures, or data analysis.\r\nPlagiarism can include\r\n．submitting a paper written by means of inappropriate collaboration;\r\n．submitting a paper written by you for another course, submitted without the permission of both instructors;\r\n．submitting a paper purchased, downloaded, or cut and pasted from the Internet;\r\n．failing to properly acknowledge its sources through standard citations.\r\nAs you work to express your ideas, particularly avoid these pitfalls:\r\n1)\tLooking at a bunch of websites (or books) without taking scrupulous notes. Be a careful researcher. I have known good students who unintentionally plagiarized because phrasing they had read from web pages stuck in their head, and they didn’t cite it.\r\n2)\tRepeating, paraphrasing, or expanding on a source’s argument without adequate citation (Instead, clearly explain and cite the source’s argument, and then show how your own ideas diverge from the source. Even if you paraphrase ideas in your own words, you still need to cite them).\r\n3)\tLifting any portions from another article without using quotation marks and citation.\r\nIf scholastic dishonesty is suspected, you will receive a zero on the assignment. You may also fail the course and/or face other disciplinary action.", "foreignLanguageTextbooks": false}]