[{"name": "張素薰", "email": "shchang@ntut.edu.tw", "latestUpdate": "2012-02-20 10:06:10", "objective": "本課程著重於高級聽力與口說能力之培養，使學生之聽講能力訓練進階至主題式的學習. 教材提昇至多元化之主題，包括商業、貿易、法律、政治、社會、文化、觀光等層面。教法上強調生動的多媒體輔助與高效的演練，針對以上教材主題，訓練學生聽取他人語言意涵及口語表達能力。此外，希望藉由此訓練，培養學生學習的策略，進而對自我學習產生負責的態度。", "schedule": "Syllabus for 4E1 Multimedia English Listening and Speaking, 2011(2)\r\nWeek\tClassification \tEnglish News\tFriends\r\n1\tIntroduction\r\n2\tPolitics\t1. Cabinet re-shuffle brings in new blood along with a familiar mix of old faces (2012/01/31)\t1\r\n3\t\t2. Experts add to debate over allowing Paylean (2012/02/03)\t2\r\n4\tHealth\t3. Disclosure of unborn babies’ sex banned by Department of Health (2011/12/30)\t3\r\n5\t\t4. DOH sets up 23 flu clinics and calms fears about expired Tamiflu (2012/01/03)\tStage Play\r\n6\tLife\t5. Dermatologist warns against excessive use of thermal clothing (2012/01/31)\t4\r\n7\t\t6. Taipower fined NT$15 million for nuclear plant infractions (2012/01/17)\t5\r\n8\tTransportation\t7. eTag to be rolled-out across Taiwan after Lunar New Year (2012/01/18)\t6\r\n9\t\tPowerpoint Presentation: A Formal Briefing about (a man, a woman, a product, a building, an event…)\r\n10\t\t8. President Ma lists achievements while inspecting Songshan Airport (2011/12/01)\t7\r\n11\tBusiness\t9. Storefront on Zhongxiao East Rd. sells for record price per square meter (2012/01/19)\t8\r\n12\t\t10. Chemistry professor warns of potential eating hazards (2011/12/16)\t9\r\n13\tEntertainment\t11. Taipei 101 promises 3D feel for New Year’s fireworks show (2011/12/22)\tDemonstration\r\n14\t\t12. City promises more exhaust fans for troubled underground food court (2011/12/27)\t10\r\n15\tTraveling\t13. The US considers waiving visa requirements for Taiwanese travelers (2011/12/23)\t11\r\n16\t\t14. Alishan Forest Railway celebrates its 100th anniversary (2011/12/25)\t12\r\n17\t\tPowerpoint Presentation\r\n18\tFinal Report", "scorePolicy": "Evaluation:\r\n1.\tWeekly Tests and appearance, one absence being reduced two points. 80%\r\n2.\tPresentations and Reports. 20%", "materials": "　", "foreignLanguageTextbooks": false}]