[{"name": "施欣文", "email": "sharinschroeder@ntut.edu.tw", "latestUpdate": "2012-03-01 12:30:51", "objective": "COURSE OVERVIEW\r\nIn this class, we will work increasing spoken fluency and building a larger vocabulary. The more you speak, the more you will learn, and the better you will do in the class (provided that you are also attentive to those around you and allow them a place to jump into the conversation. We will do many small and large group activities to facilitate conversation.\r\nPlease speak only English from the moment you walk in the classroom door. Greet your classmates in English. Say goodbye in English. Make plans to work on your group presentations in English. Only by constantly speaking English will you find the holes in your vocabulary and reach fluency.", "schedule": "COURSE CALENDAR\r\n(SUBJECT TO CHANGE)\r\n-----------------------------------\r\nWeek 1, 2/21\r\nClass Activity:\r\nStarting a new semester\r\nRace in the News\r\n-----------------------------------\r\nWeek 2, 2/28\r\nClass Activity:\r\nNo class—Peace Memorial Holiday\r\n-----------------------------------\r\nWeek 3, 3/6\r\nClass Activity:\r\nEducation: East and West\r\nOther Assignment:\r\nVocabulary Quiz 18\r\nFind a news article about some aspect of education in Taiwan (or elsewhere in Asia) OR an article about some aspect of education in the U.S., Canada, Europe, or another part of the world. Be prepared to summarize your article to classmates and to ask them questions about it.\r\nBe prepared to ask questions about the American college system. Make sure to prepare questions about the sciences.\r\n-----------------------------------\r\nWeek 4, 3/13\r\nClass Activity:\r\nAcademic conversations\r\nOther Assignment:\r\nVocabulary Quiz 19\r\nRead Surprised by Joy (“The Great Knock”)\r\n-----------------------------------\r\nWeek 5, 3/20\r\nClass Activity:\r\nAcademic Conversations\r\nOther Assignment:\r\nVocabulary Quiz 20\r\nRead “Types of Questions.”\r\nBring in a printed copy of an academic journal article that interests you. Write the citation in MLA format. Be prepared to summarize the article and explain the academic conversation that the researcher or writer is taking part in. What is the writer’s point? Whom is s/he trying to persuade and why?\r\n-----------------------------------\r\nWeek 6, 3/27\r\nOther Assignment:\r\nVocabulary Quiz 21\r\nRead “Preparing for a Difficult Conversation.” Be prepared to discuss how the advice might apply in other contexts.\r\nConversation Game/Activity covering Education/Academic Conversations.\r\n-----------------------------------\r\nWeek 7, 4/3\r\nClass Activity:\r\nGood conversations\r\nBad Conversations\r\nOther Assignment:\r\nVocabulary Quiz 22\r\nRead Humpty Dumpty chapter, Through the Looking-Glass\r\nThink about: What was the best conversation you had in your life? What was the worst? What makes a conversation go well or go poorly?\r\nConversation Game/Activity: Difficult Conversations\r\n-----------------------------------\r\nWeek 8, 4/10\r\nClass Activity:\r\nConduct, or, How to Talk to People (and how not to)\r\nOther Assignment:\r\nVocabulary Quiz 23\r\nConversation Game/Activity: Politeness\r\n-----------------------------------\r\nWeek 9, 4/17\r\nClass Activity:\r\nWit (Film clips and play and novel sections)\r\nOther Assignment:\r\nVocabulary Quiz 24\r\n-----------------------------------\r\nWeek 10, 4/24\r\nClass Activity:\r\nJokes and Humor\r\nOther Assignment:\r\nVocabulary Quiz 25\r\nConversation Game/Activity covering Wit, speaking well\r\n-----------------------------------\r\nWeek 11, 5/1\r\nClass Activity:\r\nReading between the lines (what’s left unsaid)\r\nOther Assignment:\r\nVocabulary Quiz 26\r\n----------------------------------\r\nWeek 12, 5/8\r\nClass Activity:\r\nSerious Conversations and Controversies: Religion, Politics, etc.\r\nOther Assignment:\r\nVocabulary Quiz 27\r\n-----------------------------------\r\nWeek 13, 5/15\r\nOther Assignment:\r\nVocabulary Quiz 28\r\nConversation Game/Activity covering reading between the lines and/or serious conversations\r\n-----------------------------------\r\nWeek 14, 5/22\r\nClass Activity:\r\nConvince Me\r\nOther Assignment:\r\nVocabulary Quiz 29\r\nEach of you needs to bring in an article on a topic that fascinates you. In small groups, you will try to convince one another to choose your article as the subject of our conversation in the following week. (The winner will receive points. You cannot vote for your own article.) In your groups, you will prepare a conversation activity based on the article you eventually choose.\r\nConversation Game/Activity: Persuasion", "scorePolicy": "PARTICIPATION\r\n\r\nI do put an actual numerical grade in my gradebook based on participation. Don’t let this fact make your participation unnatural, but do try to make several productive statements and to ask an interesting questions in class every day, and be sure to stay on task during group work. The amount of English you speak directly affects your participation grade. I feel strongly that you will learn more in a class where everyone participates. Someone with a high grade in participation shows a thorough engagement with class activities, speaks exclusively (and frequently) in English, jots down questions and notes in a notebook during class, frequently makes thoughtful contributions that raise the level of class discussion, knows when to listen and when to speak, is trustworthy, takes academic honesty seriously, stays focused and on-task, interacts positively, helpfully, and tactfully with other class members, and reads with expression and enthusiasm.\r\nIf you are worried about your level of participation, please see me. Shy people can do quite well in the class, but you will need to make an effort. Remember, it’s okay to make mistakes. The goal is communication. Your questions and comments will help other students. Contribute in ways that help you and the people around you learn.\r\n-----------------------------------\r\nGRADING AND OTHER POLICIES\r\n\r\nGrade Percentages:\r\nI may modify these grade weights at my discretion. If I do so, I will let you know.\r\n20%\tPresentations (graded on criteria such as clarity, fluency, originality, and effort)\r\n15%\tSkits/Simulations\r\n20%\tParticipation (in student-led discussions, whole-class activities, etc.)\r\n30%\tQuizzes\r\n15%\tFinal Oral Exam/Improvisation\r\nGrading Criteria:\r\nA\tSuperior work. Achievement that is outstanding relative to the level necessary to meet course requirements.\r\nB\tAchievement that is significantly above the level necessary to meet course requirements.\r\nC \tAchievement that meets the course requirements in every respect.\r\nD \tAchievement that fails to meet fully the course requirements.\r\nF \tAchievement that is not worthy of credit. The student did not contribute sufficient effort. S/he may not participate in classroom work. Assignments are either (a) completed but not completed at a level of achievement that is not worthy of credit; (b) frequently late, thereby lowering the grade too significantly to give the student a chance to pass; or (c) never completed at all.\r\nReactions to Grades:\r\nHopefully this won’t happen, but if you are surprised by a low grade and want to discuss it, I request that you take twenty-four hours to think about your grade and my comments before approaching me. I am happy to talk with you during office hours about how to improve.\r\n-----------------------------------\r\nATTENDANCE AND TARDINESS POLICIES\r\n\r\nComing to class late or leaving class early disrupts class discussion and activities. In addition, you miss important class announcements concerning future class sessions. You may also miss assignments and quizzes. (Quizzes in my class cannot be made up. Your lowest quiz score will be dropped.) Plan to arrive on time and be prepared to work during the entire class period. If you are five minutes late, that counts as half an absence. If you have three unexcused absences, you will fail the course. On the other hand, if you attend every class session and are on time, I will raise your final grade by 1%. Attendance requires your presence in both body and mind. If you are not prepared to participate and engage in class discussion and activities, you may be counted absent.\r\nYou are always responsible for knowing what happens during all class meetings. If you miss a class session, telephone or email a member of the class, and ask him/her what you missed and what you need to be ready for at the meeting to come.", "materials": "TEXTS\r\nCopied Readings and Course Handouts\r\nStudent-selected texts\r\n-----------------------------------\r\nASSIGNMENTS\r\n1.\tLanguage Games\r\n2.\tVocabulary Quizzes\r\n3.\tSkits/Simulations/Interactive Activities\r\n4.\tPresentation/Discussion\r\n-----------------------------------\r\nUSE OF TECHNOLOGY\r\nPlease print out any e-mailed readings. I ask that students do not use laptops, cell phones, iPods, or other electronic devices in my class. (I find that laptop use in discussion-based classes discourages eye contact and distracts students around you.) If you do have a cell phone in your bag, make sure it’s turned off. Never respond to an electronic device during class. If you are using your laptop or any other electronic device inappropriately in class, you will be marked absent.\r\n-----------------------------------\r\nOFFICE HOURS\r\nI prefer not to answer involved questions over e-mail. Students tend either (a) to procrastinate while waiting to hear from me (wasting their own time), or (b) to move on, so that they no longer need my answer by the time I am able to respond to their question (wasting my time). If you would like to discuss a question with me, make an appointment with me during my office hours. If you do set up a time to meet with me, feel free to include your question in the e-mail. I may not answer it over e-mail, but I will think about it, and we can discuss it when you come to my office.\r\n-----------------------------------\r\nETHICS\r\nPlease show yourself to be trustworthy in all areas. All of your work should be original and well documented. Below is a description of academic dishonesty:\r\nScholastic dishonesty means plagiarizing; cheating on assignments or examinations; engaging in unauthorized collaboration on academic work; taking, acquiring, or using test materials without faculty permission; submitting false or incomplete records of academic achievement; acting alone or in cooperation with another to falsify records or obtain dishonestly grades, honors, awards, or professional endorsement; altering, forging, or misusing a University academic record; or fabricating or falsifying data, research procedures, or data analysis.\r\nPlagiarism can include\r\n．submitting a paper written by means of inappropriate collaboration;\r\n．submitting a paper written by you for another course, submitted without the permission of both instructors;\r\n．submitting a paper purchased, downloaded, or cut and pasted from the Internet;\r\n．failing to properly acknowledge its sources through standard citations.\r\nAs you work to express your ideas, particularly avoid these pitfalls:\r\n1)\tLooking at several websites (or books) without taking scrupulous notes. Be a careful researcher. I have known good students who unintentionally plagiarized because phrasing they had read from web pages stuck in their head, and they didn’t cite it.\r\n2)\tRepeating, paraphrasing, or expanding on a source’s argument without adequate citation (Instead, clearly explain and cite the source’s argument, and then show how your own ideas diverge from the source. Even if you paraphrase ideas in your own words, you still need to cite them).\r\n3)\tLifting any portions from another article without using quotation marks and citation.\r\nIf scholastic dishonesty is suspected, you will receive a zero on the assignment. You may also fail the course and/or face other disciplinary action.", "foreignLanguageTextbooks": false}]