[{"name": "葉樹開", "email": "yehshukai@gmail.com", "latestUpdate": "2011-12-15 15:04:50", "objective": "本課程介紹高分子奈米複合材料之基本原理、製備加工、結構形態與其特殊物理及化學性質，並討論其應用及發展趨勢。", "schedule": "Course Outline:\r\n1.\tIntroduction to Nanocomposites – Over View of Challenges and Opportunities\r\n2.\tHistory of Carbon Nanomaterials\r\n3.\tFundamentals of Carbon-Based Nanocomposites\r\n4.\tNanocomposites Fabrication\r\n4.1\tSurface Modification\r\n4.2\tCompounding\r\n4.3\tDispersion\r\n5.\tNanocomposite Processing\r\n5.1\tThe rheology of Polymer Nanocomposites\r\n5.2\tMagnetic or Electric Field Processing\r\n6.\tProperties and Morphology of Nanocomposites\r\n6.1\tTransmission Electron Microscopy\r\n6.2\tMechanical Properties of Polymer-clay nanocomposites\r\n6.3\tMass Transport through Polymer Nanocomposites\r\n6.4\tElectrical Properties of Nanoparticle-Filled Polymers\r\n6.5\tThermal Conductivity of Polymer Nanocomposites", "scorePolicy": "Grades:\r\nGrades will be determined from a composite score of all graded materials, consisting of: two midterm exams, homework problems, and the comprehensive final exam. Weights used to determine the final score will be:\r\n1. Homework problems, 15%\r\n2. In-Class Activities, Quizzes 10%\r\n3. Two exams, 60%\r\n4. Final Project 15%\r\nHomework Rules:\r\n1.\tHomework problems are due at the beginning of class.\r\n2.\tPlease work the homework early to avoid lateness due to computer crashes.\r\n3.\tAnswer keys will be posted on http://elearning.ntut.edu.tw\r\n4.\tYou may discuss with others how to begin working problems, but you must work the problem entirely yourself to hand in for credit. You may not share computer files for homework problems until the case study.\r\n5.\tAnyone who share computer files or copy homework from classmates will subject to a 50% off his/her homework credit.\r\nExams:\r\nUnless otherwise specified, the three exams will be open-book exams. All exams will be held in our normal classroom.\r\nFinal Exam:\r\nThe final exam will be a comprehensive, open-book final. All students must take the final exam to pass the course. Finals will not be given at any other time. There will not be a make up exam.", "materials": "References:\r\n1.\tR. K. Gupta, E. Kennel, and K. J. Kim, Polymer Nanocomposites Handbook, CRC Press, 2009\r\n2.\tP. K. Mallick, “Fiber Reinforced Composites” 3rd edition, CRC Press, 2007\r\n3.\tJ. Koo, Polymer Nanocomposites: Processing, Characterization and Applications, 1st edition, McGraw-Hill Professional, 2006\r\n4.\tT. J. Pinnavaia and G. W. Beall, Polymer-Clay Nanocomposites, Wiley. 2001\r\n5.\tR. Krishnamoothi and R. A. Vaja, Polymer Nanocomposites: Synthesis, Characterization and Modeling, American Chemical Society Publication, 2001\r\n6.\tA. B. Morgan and C. A. Wilkie, Flame Retardant Polymer Nanocomposites, Wiley, 2007\r\n7.\tS. N. Bhattacharya, Polymer Nanocomposite: Theory and Practice, Hanser Gardner Publications,2007\r\n8.\tY. W. Mai and Z. Z. Yu, Polymer Nanocomposites, CRC Press, 2006\r\n9.\tP. J. F. Harris, Carbon Nanotube Science: Synthesis, Properties and Applications, Cambridge University Press, 2009", "foreignLanguageTextbooks": false}]