[{"name": "蕭佳芸", "email": "ichsiao@ntut.edu.tw", "latestUpdate": "2012-03-09 12:29:38", "objective": "In this class, we will read and discuss Lin Yutang’s The Importance of Living (1937). We will practice close reading, critical analysis, and thoughtful conversation. Attendance, active participation, a group presentation, and an exam are required. Secondary readings not listed on the syllabus may be assigned or suggested.", "schedule": "Week 1: Introduction\r\nWeek 2: no class (2/28)\r\nWeek 3: Preface, The Awakening (v-14), Views of Mankind (15-31)\r\nWeek 4: Our Animal Heritage (32-63)\r\nWeek 5: On Being Human (64-93)\r\nWeek 6: Who Can Best Enjoy Life? (94-120)\r\nWeek 7: The Feast of Life (121-143)\r\nWeek 8: The Importance of Loafing (144-164)\r\nWeek 9: The Enjoyment of the Home (165-199)\r\nWeek 10: The Enjoyment of Living, part 1 (200-236)\r\nWeek 11: The Enjoyment of Living, part 2 (237-273)\r\nWeek 12: The Enjoyment of Nature, part 1 (274-299)\r\nWeek 13: The Enjoyment of Nature, part 2 (300-330)\r\nWeek 14: The Enjoyment of Travel (331-363)\r\nWeek 15: The Enjoyment of Culture (364-398)\r\nWeek 16: The Relationship to God (399-413)\r\nWeek 17: The Art of Thinking (413-428)\r\nWeek 18: Final Exam", "scorePolicy": "Grading Policy:\r\nYou will receive one point for attendance and two points for sincere participation each day of the course. 45 points (note that this means that you have six free points or two entire absences without penalty). \r\n\r\nOn your presentation day, you and a partner will be responsible for beginning discussion about the day’s reading. You may determine the format—possibilities include but are not limited to modeling a conversation on a theme in the text, staging a debate about some issue raised by the text, asking other students questions about the text. You will be graded on your engagement with the text and your fellow students. 30 points.\r\n\r\nA final exam will be given. 25 points.", "materials": "Lin Yutang, The Importance of Living", "foreignLanguageTextbooks": false}]