[{"name": "周素鳳", "email": "sfchou@ntut.edu.tw", "latestUpdate": "2012-02-23 14:59:01", "objective": "Course Description:\r\nPopular culture has become a global language, particularly for young people today. \r\nThis course aims to enhance students' English competence through reading, talking, and writing about gender relationships, trends, entertainment, and communication technology.  The texts are mainly selected from The New York Times.  Special emphasis will be put on content analysis, text summarization, and critical comprehension skills such as identifying the main ideas and supporting details, recognizing context clues, drawing inferences and making critical judgments. Supplementary readings, extracts from Tina Seelig’s What I Wish I Knew When I was 20 and Sophie Kinsella’s Remember Me, are assigned to be independent study projects. Selected video clips from TED*TAKS and Stanford University’s Entrepreneurship Corner will be added to improve listening comprehension.", "schedule": "Date\tMain Reading \r\n2/21\tIntroduction and Warm-up\r\n2/28\t228 Peace Memorial Day\r\n3/6\tHe’s Not That Into You   \r\n3/13\tHe’s Not That Into You\r\n3/20\tOur Barbies, Ourselves  \r\n3/27\tOur Barbies, Ourselves\r\n4/3\tMake-up Holiday\r\n4/10\tChina’s Wealthy Buy a New Look\r\n4/17\tMidterm Exam\r\n4/24\tChick Literature: Sophie Kinsella & Remember Me\r\n5/1\tRacy Shows in China Get a Chaperon\r\n5/8\tFilm is Dead?\r\n5/15\tStalker Ads Unsettle Online Shoppers\r\n5/22\tThe Cellphone as Stalker \r\n5/29\tRedefining Reading with Hybrid Books\r\n6/5\tFacebook Resisters Are Content to Sit Out\r\n6/12\tDiscussion\r\n6/19\tFinal Exam", "scorePolicy": "Grading Scale: \r\n1. Midterm Reading Portfolio (3 summary entries+6 pages Notes): 20 %\r\n2. Midterm Oral Exam: 20%\r\n3. Final Reading Portfolio (3 summary+6 pages Notes): 20%\r\n4. Final Exam: 20 %\r\n5. Attendance + In-class activities: 20%", "materials": "Requirement: \r\n1. Regular attendance is required to pass this course.  3 unexcused absences from class will result in failing this course.  Excused absences require that I be notified on or before class date, or with official documentation shortly after the absence.  One unexcused absence will result in an automatic final score reduction of 2 points.  \r\n2. Don’t be late. One late attendance means a 1 point reduction from your final score. If you are more than 10 minutes late to the class, it will be counted as an absence. \r\n3. Each student should keep a Reading Portfolio which should include 6 Summary entries and 12 pages of handwritten notes on useful words or expressions related to the selected readings.\r\n4. Midterm Exam will be an oral test designed to demonstrate your understanding and knowledge of the materials read and discussed in class.", "foreignLanguageTextbooks": false}]