[{"name": "楊士萱", "email": "shyang@ntut.edu.tw", "latestUpdate": "2011-01-12 09:27:29", "objective": "線性代數為科學與工程的基礎數學工具，本課程教授線性代數的基本概念與運算技巧。課程大綱如下：\r\n1. Linear Equations\r\n2. Matrix Algebra\r\n3. Vector Spaces\r\n4. Eigenvalues and Eigenvectors\r\n5. Orthogonality and Inner-Product Spaces\r\nThis course Linear Algebra\r\n- is a mathematics course.\r\n- is useful and fundamental to CSIE (and many other discipline) students.\r\n- emphasizes both computations and concepts.\r\n- asks you to use a popular matrix-based mathematical package called Matlab. （請使用計網中心電腦教室）\r\n- guides you to read through an English textbook.\r\n- requires hard work.", "schedule": "Syllabus: (The number in parentheses indicates the estimated teaching hours.)\r\n(12) 1. Linear Equations\r\n- To understand the basic terminologies and notations of matrices and systems of linear equations, in the forms of vector equation and matrix equation.\r\n- Solving a system of linear equations with the Gaussian elimination: reducing a matrix to its echelon form.\r\n- To interpret a system of linear equations in various ways.\r\n- First exposure to key concepts such as linear independence and linear transformation.\r\n(8) 2. Matrix Algebra\r\n- To learn basic matrix arithmetic operations: addition, subtraction, multiplication power, transpose, and inverse.\r\n- To summarize the concepts for systems of n linear equations in n unknowns.\r\n(12) 3. Vector Spaces\r\n- Introduction to vector spaces.\r\n- Fundamental subspaces of a matrix: column space, row space, and null space.\r\n- Basis and dimension of a vector space.\r\n(8) 4. Eigenvalues and Eigenvectors\r\n- To find the eigenvalues and eigenvectors of a matrix.\r\n- Diagonalization of a matrix (linear transformation).\r\n- To view eigenbases in the context of simplifying (decorrelating) linear transformations.\r\n(8) 5. Orthogonality and Inner-Product Spaces\r\n- To introduce inner product of vectors, and thus the geometric concepts of length, distance, and angle (perpendicularity).\r\n- To be familiar with the use of orthogonal bases.\r\n- Least-Squares approximation.", "scorePolicy": "1. Attendence and in-class recitations, 8% (extra).\r\n2. Written homeworks, 12%. Please do not plagiarize others’work.\r\n3. Four Matlab homeworks, 8%.\r\n4. Two 50-minute quizzes, 15% each.\r\n5. Midterm exam and final exam, 25% each.", "materials": "1. Elementary Linear Algebra by Howard Anton, Ninth Edition, John Wiley & Sons, Inc., 2005.\r\n2. Introduction to Linear Algebra by Gilbert Strang, 3rd Ed., Wellesley-Cambridge Press, 2003.", "foreignLanguageTextbooks": false}]