[{"name": "劉傳銘", "email": "cmliu@ntut.edu.tw", "latestUpdate": "2011-01-14 16:27:00", "objective": "In this course, we study the TCP/IP Internetworking, client-server paradigm, and socket API that application programs use for network communications. We first introduce the TCP/IP model and then discuss how the basic tools can be used to create servers, emphasizing practical designs and techniques that are important to programmers. Topics include OSI model, TCP/IP model, Client-Server Model and Software Design, Concurrent Processing in Client-Server Software, Socket API, Client Software Design, Server Software Design, TCP/UDP, Remote Procedure Calls, and new topics related to the Internet.", "schedule": "1 Introduction and Overview (2hrs)\r\n2 OSI Model (3hrs)\r\n3 Client Server Model and Software Design (3hrs)\r\n4 Concurrent Processing in Client-Server Software (2hr)\r\n5 Socket API (5hrs)\r\n6 Client Software Design and Example (6hrs)\r\n7 Server Software Design and Example (15hrs)\r\n8 Tunneling and Application Level Gatways (4hrs)\r\n9 XDR and RPC (8hrs)\r\n10 Presentations on Other Protocols (6hrs)", "scorePolicy": "1.\tQuizzes\t          10%\r\n2.\tLABs\t          50%\r\n3.\tPresentations\t10%\r\n4.\tFinal Exam\t30%\r\n•Each student needs to present an existing protocol about in the end of this semester.\r\n•Quiz will be given without notice.\r\n", "materials": "Textbook:\r\nInternetworking with TCP/IP, Volume 3: Client-Server Programming and Application, Linux-POSIX Sockets Version. D. E. Comer and D. L. Stevens. Prentice Hall, 2001. ISBN 0-13-032071-4\r\nReferences\r\n•TCP/IP Protocol Suite, 2nd edition, Behrouz A. Forouzan. McGraw-Hill 2003.\r\n•Internetworking with TCP/IP, Volume 3: Client-Server Programming and Application, Windows Sockets Version. D. E. Comer and D. L. Stevens. Prentice Hall, 2001. ISBN 0-13-848714-6\r\n•UNIX Networking Programming: the Socket Networking API, Volume 1, 3rd edition, W. R. Stevens, B. Fenner, A. M. Rudoff, Addison-Wesley, 2004. ISBN 0-13-123052-2.\r\n", "foreignLanguageTextbooks": false}]