[{"name": "房同經", "email": "nathan1@ms39.hinet.net", "latestUpdate": "2011-05-19 17:45:17", "objective": "目前醫學工作及健康?業學者主動提供，並傳布醫學及健康資訊的方法愈來愈多樣化，今後必得有所調整。媒體向來擁有吸引大眾目光的工具，寓教於樂、提供各類資訊的技術。而動態的影像亦可輕易吸引觀眾，使用的文字語言也更自由多樣，實在非常有利於將科學的真相與複雜錯綜的內容傳達給更多社會大眾。這是任何一位專家學者都比不上的。\n 過一些類似奈米科與新型流感、電磁波之類缺乏科學根據的偏頗解釋，曾經一再造成社會大眾惶惶不安、不得不前往購買某些特定商品，而這些資訊至今依舊多不勝數。我確信，未來還會有更多『新面孔』相繼『上市』。\n在本課堂中。列出分辨醫學資訊的十項原則。我相信，唯有接受資訊的一方開始學習不盲從，學習做出自已的判斷，專定學者與媒體工作者才會有進步的空間，才可能提供更高品質的資訊報導。\n一、\t堅持懷疑主義，多方蒐集資料，自行判斷真偽。\n二、\t剔除所有類似『吃***就會***』的簡略報導。\n三、\t對『具有危險性』、『有效』之類極端的報導文字提高警覺。\n四、\t思考報導本身是否?生「即得利益者」。\n五、\t以冷靜的態度面對個人經驗談與情緒性訴求。\n六、\t留意公布訊息的『場合』。學術論文可信度永遠最高。\n七、\t留意報導中的『劑量』，亦即『單位』與『數字』。\n八、\t思考報導中是否可能因『條件』而異、因『人』而異的可能。\n九、\t抱持與其化狀況比較的眼光。\n十、\t對所有新資訊抱以開放思考的態度。\n致命醫學問題的背後\n致命問題1/每年體檢沒必要\n篩檢和檢測事關生死，每年體檢絕非多此一舉，這是人人該做的重要事情，大家得去跟醫師商量該做哪些篩檢和檢測\n致命問題2/只有小孩才需要打預防針\n透過疫苗得來的免疫力，效用可能無法持續一生之久，我們活的歲數可能會超過它的保護年限，這也是為什麼你需要「追加」注射。尤其年過三十以後\n致命問題3/醫師不會偏心\n在關乎自己健康照護的事上，每個人都該大聲說出自己的心聲來\n致命問題4/老人才會心臟病和中風\n心臟病和中風這種病是跨越年齡界限的。年齡，其他因素也要考慮。高膽固醇、糖尿病、高血壓、壓力、缺乏運動、家族病史、肥胖。\n致命問題5/面對癌症，我們只能投降\n投癌這仗，我們己經在幾條前線打了勝仗。樂觀的原因是，我們己在預防、檢測和治療這三大領域，取得了能救命的知識\n致命問題6/天然的就「安全」\n有些草藥?品掛著植物名、包裝得野趣十足，卻有可能是強效藥物，想自己醫自己 ，卻往往忽略了可能愈醫愈嚴重\n致命問題7/沮喪或焦慮忍一下就過去了\n憂鬱或焦慮不是光靠「想正面的」、「想開一點」就能改善，也不是別人希望你不要這樣，就不這樣的。若你覺得在人生某種變局或轉折中，沒有幫你就過不了關，那你就己在這場勝負中超前了一步\n\n我不知道大家怎麼想，但我們喜歡這個世界。不生不免糾葛、難熬、不總是那麼有趣，但我們可不想太快看到那道門。任格能讓我更健康、更長壽的健康習慣，任何適合我這年齡的篩檢，任何能救我命的新療法，我都想一窺究竟，好讓自己活得久一點，九十歲還活蹦亂跳。\n但你我有個挑戰：為了健康長壽，我們需要去了解並評量『醫學迷思』，並照著迷思背後的真理而行。字典是這麼定義迷思的：錯謬的信仰，卻廣為人所接受；誤解；曲解真理；人或機構的誇大理念。迷思就像煙幕彈，會讓人看不清真相和選項，而且我們常小看它對思想與行為的影響。在這課程裡，將協助分辦什麼是真、什麼是假，看出所信以為真的迷思，究竟有什麼漏洞。\n本課程會提供必要的醫療資訊，協助你在以下幾方面做決定：\n1．\t配合健康照護進程(沒錯，有個進程)，也就是你該做什麼檢測、篩檢、該打什麼疫苗以保健康，以做出最有益健康的決定。\n2．\t向待人不盡公平的醫療體系要求尊重及合適的療法\n3．\t透過警覺、自我照護、預防和治療，免除三大主要死因-心臟病、癌症和中風\n4．\t懂得扭轉可控制的危險因子，讓自己有機會健康的多活七年\n5．\t了解心理對身體的影響，好讓自己能保持健康、活躍、將生命力發揮到極致。\n解開醫療迷思有助你明白真相，知道該做些什麼，好讓自己活得更健康、快樂、圓滿。", "schedule": "　", "scorePolicy": "　", "materials": "　", "foreignLanguageTextbooks": false}]