[{"name": "曾添文", "email": "f10403@ntut.edu.tw", "latestUpdate": "2017-09-05 16:36:41", "objective": "介紹單位換算與有效數位，元素的原子結構、化學方程式平衡與計算，反應熱，氣體與氣體定律，大氣層與環境污染，週期表，化學鍵，化合物的分子結構，熱力學，動力學，反應機構，平衡常數，氧化與還原，酸鹼反應，電化學，混合物的分離及現代科技材料，奠定良好化學基礎。", "schedule": "1~2週. Matter: its properties and measurement:  an overview, the scientific method, units of measurements, uncertainty in measurements, significant figures, learning to solve problems systematically, dimensional analysis.\r\n3~4週. Atoms and Atomic Theory: molecules, and ions: the early history of chemistry, fundamental chemical laws, Dalton’s Atomic Theory, early experiments to characterize the atom, the modern view of atomic structure, molecules and ions, an introduction to the periodic table, naming simple compounds.\r\n5~6週. Chemical Compounds: types of chemical compounds and their formulas, themole concept and chemical compounds, compositions of chemical compounds, oxidation states, names and formulas of inorganic compounds, names and formulas of organic compounds 7~8週.Chemical Reactions: chemical  rections and chemical equations, chemical quations and stoichiometry, moleculsr weight and formula weight, atomic masses, the mole, molar mass, percent composition of compounds, determining the formula of a compound, \r\n9~10週.Introduction to Reactions in Aqueous Solutions: chemical equations, balancing chemical equations, stoichiometric calculations, the concept ionic theory of solutions and solubility rules, molecular and ionic equations, precipitation reactions, acid-base reactions, oxidation-reduction equations. \r\n11~12週. The Gaseous States: gas pressure and measurement, empical gas law, the ideal gas laws , Charles, and Avogadro, ideal gas law, gas stoichiometry, Dalton’s Law of Partial pressures, the kinetic molecular theory of gases, effusion and diffusion, real gases, characteristics of several real gases.\r\n13~14週. Thermochemistry: energy and units, first law of thermodynamics, work and heat, energy, enthalpy and calorimetry, Hess’s Law, standard enthalpy of formation, present sources of energy, new energy sources.\r\n15~16週. Electrons in Atoms: the wave nature of the light, quqntum effectsand phontons, atomic structure and periodicity: electromagnetic radiation, the nature of matter, the atomic spectrum of hydrogen, the Bohr model, the quantum mechanical model of the atom, quantum numbers, orbital shapes and energies, electron configurations \r\n17~18週. The Periodic Table and Some Atomic Properties: classifying the elements, metals and nonmetals and their ions, sizes of atoms and ions, ionizartion energy, electron afffinity, magnetic properties, polarizability.", "scorePolicy": "一學期中共考6次加以平均", "materials": "General Chemistry\r\nRalph H. Petrucci, F. Geoffrey Herring, Jeffry D. Madura, Carey Bissonnette\r\nPearson Ltd., 2017.", "foreignLanguageTextbooks": true}]