[{"name": "楊韻華", "email": "yhyang@ntut.edu.tw", "latestUpdate": "2017-09-14 13:01:48", "objective": "Course Title:\t\tAdvanced English Conversation  \r\nCredit Hours:\t\t2\r\nInstructor’s Name:\tDr. Yun-Hua Yang\r\nContact E-Mail:\tyhyang@ntut.edu.tw \r\nTerm Offered:\t\tFall, 2017\r\nScheduled Class Hours: Thursday 1:10—3:00 PM\r\nOffice Hours:      By appointment \r\nRequired Texts:  N/A\r\nCourse Description: In today’s world, one of the essential skills to expand one’s social and career network is to establish relationship through effective communication, including verbal and non-verbal forms. This course will look at the process of both forms of communication, with a particular emphasis on language use, skills, strategies and relationship building. A variety of discourse types, areas of topics, fields of work and scenarios will be included in the training.  \r\nCourse Objectives:  This course aims to help learners of English to\r\n\t\t\t(1) build confidence in conversational communication in English \r\n\t\t\t(2) give organized, coherent, and focused spoken messages in English \r\n            (3) employ effective strategies (skills and techniques) to persuade and obtain committed actions", "schedule": "Wk 1: Orientation \r\nWk 2-6: Topic-based communication: individual talks \r\nWk 7-12: Situational communication: conversational tasks\r\nWk 13-18: Debates and discussions", "scorePolicy": "Course Requirements:\r\n(1)\tStudents are required to give a three-minute talk in each class session. Topics will be assigned in advance. \r\n(2)\tStudents will be randomly invited to comment on other student speakers’ talks. A brief Q & A session will be conducted.  \r\n(3)\tAll talks, including comments and Q&A discussions will be recorded. Every two weeks, students need to submit the recording of a revised talk and an analytical reflection of  what to do in order to “repair” the previous communication. Submit both the recording and written analysis. All reflective analysis will be read and discussed in class. \r\n(4)\tAttendance: Students are required to attend class as scheduled. \r\ni.\tEach unexcused absence will result in 10% semester grade deduction. \r\nii.\tAt the sole discretion of the instructor, absence penalty may be waived with valid proof and just cause. Penalty waiver request will only be accepted in two weeks of the date of absence. It is important to know that generally only ONE- time penalty waiver will be considered.  \r\niii.\tLateness to class: Any arrival to class after the instructor finishes the second-round roll call is considered lateness. Each occasions of lateness will, in effect, incur a grade penalty of 5% semester grade deduction.\r\nEvaluation Procedures & Grading System:\r\n\tFinal grades will be determined by a point system (X out of 100 total points). Students will be evaluated as follows: (1) Individual talks, comments, and reflections 50-60% (TBD) (2) Attendance 30%   (3) Simulation of situational communications10-20% (TBD)", "materials": "N/A", "foreignLanguageTextbooks": true}]