[{"name": "勞維俊", "email": "lolouis@graduate.hku.hk", "latestUpdate": "2017-06-05 18:32:24", "objective": "透過細讀虛構的作品與觀察現實中的建築與城市風景，學生將學習檢視城市的不同風貌。本課程旨在培養學生將自身對城市的感受化為文字，並加以分析批判。除了口頭報告和書面作業，課程將要求學生以英文製作一部有關城市的短片。如有機會，將安排學生實地考察台北或其他城市。", "schedule": "Course Aims:\r\n\r\nStudents will examine different features of a city including architecture and urbanscape represented in both works of fiction and in reality. This course aims to train students’ abilities to transform their experiences in the city into words and other media, and to analyze aspects of the city critically. Apart from presentations and written assignments, students are required to make a short film in English about the city. A field trip to parts of Taipei or other cities may be arranged.\r\n\r\nCourse Outline: \r\n\t\t\r\nI: Introduction: \r\nWeeks 1-3: Introduction \r\nBlake, ‘London’ (poem)\r\nThe Skywalk Is Gone (2002) (short film) (dir. Tsai Ming-liang)\r\nPoe, ‘Man of the Crowd’ (short fiction)\r\n\r\nII. Into the Nineteenth-century \r\n\r\nWeek 4-6: London\r\nLondon (1994) (dir. Patrick Keiller) \r\n\r\nWeek 7-8: St. Petersburg \r\nNikolai Gogol, ‘Nevsky Prospect’ (short fiction)\r\n\r\nWeek 9: Mid-term Examination \r\n\r\nIII: Sexuality and the City\r\n\r\nWeek 10: Conference (No class) – Wong Kai-wai’s Happy Together screening\r\n\r\nWeek 11: On Happy Together\r\n\r\nWeek 12-13: Georg Simmel, ‘The Metropolis and Mental Life’\r\n\r\nIV. Walking the City\r\n\r\n\r\nWeek 14-15: Michel de Certeau, ‘Walking in the City’ \r\n[Week 15: short film shooting plan due]\r\n\r\nWeek 16: Field trip (sites in Taipei – details to be announced)\r\n\r\nWeek 17: Presentation of shot films\r\n\r\nWeek 18: Final Examination", "scorePolicy": "Teaching Approach\r\n\r\nStudents are required to read all the assigned texts, including literary, filmic and theoretical works. They should attend field trips and lectures, participate in discussions in tutorials, write an essay, and give a presentation or make a short film.\r\n\r\nAssessment\r\n\r\nParticipation  \t\t\t\t\t\t10%\r\nPresentation / Short film production\t30%\r\nMid-term examination\t\t\t\t30%\r\nFinal essay\t\t\t\t\t\t30%    \r\n\t\t\t\t\t\t\t      100%", "materials": "Resources \t\r\n\r\nPrimary texts: Those marked with [*] are texts which the students should get a copy.\r\n\r\nBaudelaire, Charles. ‘To a Woman Passing By’ and ‘The Swan,’ The Flowers of Evil, in Charles Baudelaire Complete Poems, trans. Walter Martin. Manchester: Carcanet, 1997. \r\n\r\nDoyle, Arthur Conan. ‘The Adventure of Charles Augustus Milverton.’ The Return of Sherlock Holmes. \r\n\r\nEgg, Augustus Leopold. Past and Present. Oil on Canvas. 1858. Tate Gallery, London.\r\n\r\nEngels, Friedrich. ‘The Great Towns,’ The Condition of the Working Class in England. Ed. Victor Kiernan. Harmondsworth: Penguin, 2005.\r\n\r\nGogol, Nikolai. Nevsky Prospect. London: Bristol Classical Press, 1995. (extract provided)\r\n\r\nManet, A Bar at the Folies – Bergeres. 1881-1882. Oil on canvas. 96 x 130 cm. Courtauld Institute Galleries, London.\r\n\r\nPoe, ‘Man of the Crowd.’ \r\n\r\nReferences:\r\n\r\nAbbas, Ackbar. Hong Kong: Culture and the Politics of Disappearance. Hong Kong University Press, 1997.\r\n\r\nAuster, Paul. New York Trilogy. Harmondsworth: Penguin Books, 1990.\r\n\r\nBenjamin, Walter. Arcades Project. Trans. Howard Eiland and Kevin McLaughlin. Ed. Rolf Tiedemann. Cambridge: Belknap Press, 1999.\r\n\r\n---. Charles Baudelaire. London and New York: Verso, 1997.\r\n\r\nBerman, Marshall. All That is Solid Melts into Air: the Experience of Modernity. London: Verson, 1983.  \r\n\r\nClark, T. J. The Painting of Modern Life: Paris in the Art of Manet and his Followers. Princeton, N.J.: Princeton University Press, 1999.\r\n\r\nEngels, Friedrich. ‘The Great Town’, The Condition of the Working Class in England, ed. Victor Kiernan. Harmondsworth: Penguin, 2005.\r\n\r\nGilloch, Graeme. Myth and Metropolis: Walter Benjamin and the City. Cambridge: Polity Press, in association with Blackwell Publishers, 1996.\r\n\r\nMarcus, Steven. ‘Reading the Illegible.’ The Victorian City: Images and Realities. Ed. H.J. Dyos and Michael Wolff. London: Routledge and Kegan Paul, 1976. 257-76.\r\n\r\nTambling, Jeremy. Lost in the American City: Dickens, James, Kafka. New York: Palgrave, 2001. \r\n\r\n---. Going Astray: Dickens and London. London: Longman, 2009.\r\n\r\nWalkowitz, Judith R. Prostitution and Victorian Society: Women, Class, and the State Cambridge : Cambridge University Press, 1980.", "foreignLanguageTextbooks": true}]