[{"name": "黃雲紹", "email": "aw760212@ntut.edu.tw", "latestUpdate": "2018-01-11 15:08:24", "objective": "SAP助力實現全民大數據。世界正在改變，數位化浪潮不可逆，人工智慧來勢洶洶，您會轉型還是被淘汰？但是當今只有21%的企業「部分」實施了機器學習項目，我們常常在業界聽到：「我們企業沒有數據科學家」；「數據科學家資源太少，他們忙不過來… 」；大學／企業可能應該培養更多的數據科學家…。請問只有數據科學家才能利用機器學習嗎？您會轉型還是被淘汰？ 本課程使用工具: SAP Predictive Analytics，不寫一行程式，教導您簡單輕鬆上手，解決銷售、財務金融與製造上的問題。", "schedule": "SAP helps realize Citizen Data Science. As the world is changing, the digital wave is irreversible, and Artificial Intelligence is breaking in in full fury, will you make the transition or be eliminated? But today only 21% of companies implement \"machine learning\" projects. And we often hear in the industry that our companies has no data scientists or data scientists resources are rare causing them too busy to help. Should universities and industries train more data scientists? Are only data scientists capable of using machine learning? Will you make a transition or be eliminated? The course will use a tool called SAP Predictive Analytics, which does not require you to write a single line of code, to teach you how to get started with simple and easy-to-use solutions to solve the problems of sales, financial and manufacturing.", "scorePolicy": "出席30%\r\n作業30%\r\n期末40%", "materials": "業師授課、自製講義", "foreignLanguageTextbooks": false}]