[{"name": "李文興", "email": "f10539@ntut.edu.tw", "latestUpdate": "2007-10-04 11:04:15", "objective": "先修課程：負責教授同意。介紹產品製造的程序和各種加工方法，及使用的機械設備、製造過程材料及製程參數的影響，製程規劃及製造成本的因素、產品檢驗量測技術及品質管制的方法、製程自動化及電腦整合製造系統等。", "schedule": "第一週：準備工作請學生購買教科書，說明本課程最主要的教學目標、以及基本內容和學習的方法。講授chapter 1: an introduction, including : what is manufacturing, materials in manufacturing, manufacturing processes, production systems. orgainzation of the book. homework：review questions, and multiple choice quiz. all of the odds number.\r\n第二週：chapter 2: understanding materials,including:atomic structure and the elements, bonding between atoms and molecules, noncrystlline structures, engineering materials. homework:review questions and multiple choice quiz, all of the odds number.\r\n第三週：chapter 3: materials mechanical properties in manufacturing, including:stress-strain relationships, ahrdness, effect of temperature on preperties, fluid properties, viscoelastic behavior of polymers. Homework:review questions and multiple choice quiz, all of the odds number.\r\n第四週：chapter 4: materials physical properties and manufacturing, including:volumetric and melting properties, thermal properties, mass diffusion, electrical properties, electrochemical processes. Homework:review questions and multiple choice quiz, all of the odds numbers.\r\n第五週：chapter 5:product design dimensions, tolerances, and surfaces, including dimensions, tolerances, and related attributes, surfaces, effect of manufacturing processes. Homework:review questions and multiple choice quiz, all of the odds number.\r\n第六週：chapter 6: alloys and phase diagrams, Ferrous metals, superalloys, Guide to the processing of metals.\r\n第七週：Chapter 7:structure and Properties of ceramics, Traditional ceramics, New ceramics, Glass, Guide to processing Ceramics.\r\n第八週：Chapter 8: Fundamentals of polymer science and technology, Thermoplastic polymers, Thermosetting polymers, Elastomers, Guide to the processing of polymers\r\n第九週：Chapter 9:Composite materiasl, Technology and classification of composties materials, Metal matrix composites, Ceramic matrix composites, Polymer matrix composties, Guide to processing composties amterials.\r\n第十週：Chapter 10:Fundamentals of metal casting, overview of casting technology, Heating and pouring, solidification and cooling.\r\n第十一週：Chapter 11:Metal casting processes, Sand casting, perment mold casting processes, Foundry practice. Casting quality, Metals for casting Product Design considerations.\r\n第十二週：Chapter 12:Glassworking, Raw materials proparation and melting , Shaping processes in Glassworking Heat Treatment and Finishing, Product design considerations.\r\n第十三週：Chapter 16:powder Metallurgy, Characterization of Engineering Powder, production of metallic powders, Conventional pressing and sintering , alternative pressing and sintering technology, materials and products for PM, design considerations in powder metallurgy.\r\n第十四週：Chapter 18:Metal forming and sheet metalworking,overview of metal forming, materials behavior in metal forming, Temperature in metal forming, stain rate sensitivity, friction and lubrication in metal forming.\r\n第十五週：Chapter 19:Bulk Deformation processes in metal working, Rolling, other deformation processes related to rolling, Forging, other deformation  processes related to forging, Extrusion, wire and bar drawing.\r\n第十六週：Chapter 20: Sheet metal working, cutting operations, bending operations, drawing, other sheet-metal-forming operations, Dies and presses for sheet metal processes, sheet-metal operations not performed in presses, bending of tube stock.\r\n第十七週：Chapter 21:Theory of metal machining, overview of maching technology, Theory of chip formation in metal machining, force relationships and th emerchant equation, power and energy relationships in machining, cutting temperature.\r\n第十八週：Cahpter 22: Machining opeations and machine tools, turning and related operations, drilling and related operations, milling maching enters and turning centers, other machining operations, high speed machining.\r\nFor the time being, the developed technology of semiconductors gets more attention than ever before. It is feasible to teach some materials about", "scorePolicy": "考評標準，包括有homework習題20%，mid-term test期中考30%、final test期末考30%，以及上課情形包括有：order in class上課秩序、attendence出席率、和performance對問題的回答表現等。", "materials": "　", "foreignLanguageTextbooks": false}]