[{"name": "楊韻華", "email": "yhyang@ntut.edu.tw", "latestUpdate": "2007-10-08 10:34:48", "objective": "Course Title:\t\tPublic Speaking and Debates\r\nCredit Hours:\t\t2\r\nInstructor’s Name:\tDr. Yun-Hua Yang\r\nContact E-Mail:\tyhyang@ntut.edu.tw\r\nOffice: \t        General Education Building Rm.805-1 / Extension:3941\r\nTerm Offered:\t\tFall, 2007\r\nRequired Text:\tA required packet of photocopied readings and handouts\r\nRecommended Text:\tHow to Design and Deliver Speeches (8th edition), Fletcher, L. Pearson, 2004.\r\nCourse Description: \tThis course aims to establish the foundation for English-major students to deliver public speeches in English. Students learn to select topics, collect essential information, analyze the audience, organize materials, improve delivery skills, distinguish different types of speeches, and further to evaluate their own and others’ speeches. Each student is expected to deliver at least 3 individual speeches, and 2-3 debates. Speech topics will be assigned to students. Any modifications of the speech topics will have to be approved by the instructor. All student speech sessions must be videotaped.(*1)\r\nCourse Requirements: \tStudents’ responsibilities in this class include:\r\n(1)\tto attend class regularly and to arrive on time: a sign-in sheet to record attendance / a grade reduction of 5% of the semester grade for each class session missed absence\r\n(2)\tto present materials assigned\r\n(3)\tto deliver speeches as scheduled:\r\ni.\tStudents are required to present their speeches on the day scheduled;\r\nii.\tMake-up speech will be allowed only when the failure to perform is due to an officially excused absence at the instructor’s discretion.\r\niii.\tThe ideal time duration for each speech is 4 to 6 minutes. The minimum length of speech time is 3 minutes, and the maximum 6 minutes. Violation of the time limit (less than 3 and more than 6) will create a 10-point deduction. The time length for debates will vary due to the different formats employed.\r\n(4)\tto submit the speech script and outlining structure (see Appendix 1) to the instructor when presenting the speech. Failure to submit will generate a penalty of 20 points (out of 100) in each speech. Students who fail to comply with the outline format requirements (sampled and specified below)will forfeit the opportunity to deliver the current speech / debate.\r\n(5)\tto evaluate one’s own speech: speeches will be videotaped and given back to the speakers. Student speakers are required to watch their own videotaped performance, observe their own speeches, and later submit a self-evaluating commentary to the instructor. Facilities and technical support will be provided by the department. A portfolio needs to be established and submitted at the semester end.\r\n(6)\tto offer constructive opinions and feedbacks of the fellow students as speakers: Students are encouraged to give verbal / oral commentary of the fellow students’ speeches, and with the objectively constructed criticism, the student evaluators will earn 3% grade points to their semester grades.\r\nGrading Policy: \t(1) Academic honesty is prioritized in this class. Students should learn that plagiarism will not be tolerated. Students will fail the course without contention once an incident of plagiarism is identified in their submitted writing or presented speech.\r\n(2) The grading components are as follows:\r\nComponent\t           Grade Percentage\r\nAttendance *\t10% (full attendance) (*2)\r\nIntroductory Speech (impromptu + extemporaneous) \t10%\r\nInformative Speech (extemporaneous w/visual aids)\t10%\r\nPersuasive Speech (extemporaneous)\t10%\r\nIntroduction to Informative Speech \t10%\r\nIntroduction to Persuasive Speech \t10%\r\nDebate 1 (Lincoln-Douglas format) \t15%\r\nDebate 2 (Parliamentary format) \t15%\r\nFinal Debate Match \t10%\r\nSpeech Assessment Portfolio (Speech outlines, audios, and notes) \tRequired (*3)\r\nNotes:\r\n*1) Student speakers need to videotape their speeches each time and submit the digital recordings at the end of the semester.\r\n* 2) Students are obligated to attend all class sessions. Each absence will generate", "schedule": "English Public Speaking and Debates\r\nCourse Syllabus _ Weekly Syllabus\r\nWeek\tCourse Tasks\tIn-Class Activities\tTopic Status\r\nWk 1\tClass Orientation / Public Speaking Made Easy\r\nInstructor Session\r\n(Notes submission required_ due on 9/27 ) \t╳\r\nWk 2\tOutlining Speeches (Impromptu + Extemporaneous)¤\tStudent Speeches\t*Assigned\r\nWk 3\tIntroduction to Informative Speech\r\nW.J. Clinton (Bill Clinton): 2nd Inaugural Address (Jan.20, 1997) \tStudent Group Presentation\r\n+ Speech Video\tAssigned\r\nWk 4\tDouble Tenth Day (No class)\t\t╳\r\nWk 5\tInformative Speeches (Extemporaneous)¤\r\nStudent Speeches via PPT outlines\tAssigned\r\nWk 6\tInformative Speeches (Extemporaneous)\r\nStudent Speeches via PPT outlines\tAssigned\r\nWk 7\tIntroduction to Persuasive Speech\r\nJohn F. Kennedy: Speaking of the new frontiers and the renewed faith in the American dream\r\nRev Martin L. King Jr.: two memorable speeches\tStudent Group Presentation\r\n+ Speech Video\tAssigned\r\nWk 8\tPersuasive Speeches (Extemporaneous)\r\nStudent Speeches via PPT outlines\t©Approved\r\nWk 9\tPersuasive Speeches (Extemporaneous)\r\nStudent Speeches via PPT outlines\tApproved\r\nWk 10\tIntroduction to Debates (Formats and Rules)\tInstructor Session\t╳\r\nWk 11\tPreparing for 1st Debates (Lincoln-Douglas) \tGroup Research & Discussion\tApproved\r\nWk 12\t1st Debates: 2 Groups_ 4 Teams\tStudent Debates \tApproved\r\nWk 13\t1st Debates: 2 Groups_ 4 Teams\tStudent Debates \tApproved\r\nWk 14\tPreparing for 2nd Debates (Parliamentary) \tGroup Research & Discussion\tApproved\r\nWk 15\t2nd Debates: 2 Groups_ 4 Teams\tStudent Debates\tApproved\r\nWk 16\t2nd Debates: 2 Groups_ 4 Teams\tStudent Debates\tApproved\r\nWk 17\tFinal Debate Match (Impromptu) \tStudent Speeches\tAssigned\r\nWk 18\tFinal Debate Match (Impromptu)\tStudent Speeches\tAssigned\r\nNote: \t* Topics are assigned by the instructor to student speakers.\r\n¤ All extemporaneous speeches are delivered via the PPT outline prepared by the current student speaker.\r\n© Topics are submitted for instructor’s approval.\r\n", "scorePolicy": "Topics for Informative Speeches\r\nTopic Area 1) Media Power, Ethics & Control: what, why and how (the impact)\r\nTopic Area 2) Sustainable Development: what, why and how (the impact)\r\nTopic Area 3) Poverty Gap: what, why and how (the status quo and the impact)\r\nTopic Area 4) Euthanasia: what, why and how (the status quo and impact)\r\nTopics for Persuasive Speeches\r\nTopic Area 1) Media Power, Ethics & Control: what, why and how (the impact)\r\n(1)\tMedia censorship\r\n(2)\tMedia language and public interpretation\r\n(3)\tPublic rights to know vs. privacy\r\n(4)\tJournalistic integrity: hard news vs. infotainment\r\nTopic Area 2) Sustainable Development: what, why and how (the impact)\r\n(1)\tWhy an inconvenient truth?\r\n(2)\tScience and politics of global warming\r\nTopic Area 3) Poverty Gap: what, why and how (the status quo and the impact)\r\n(1)\tGlobalization: enlarging or shrinking the poverty gap?\r\n(2)\tThe wealthy pyramid: the building blocks from bottom to top (what and where to find?)\r\n(3)\tBeing averagely wealthy: Is it possible?\r\n(4)\tWealth concentration vs. wealth distribution\r\n(5)\tHow short the gap to create total human welfare?\r\nTopic Area 4) Euthanasia: what, why and how (the status quo and impact)\r\n(1)\tTo live or not to live: whose choice is it?\r\n(2)\tMercy killing and assisted suicide: which is which?\r\n(3)\tLegal issues vs. ethical issues\r\n(4)\tPalliative care: at what / whose cost?\r\nNote:\r\nStudents enrolled in English Public Speaking and Debates are encouraged to develop their own speech topics or modify the current topics based on the designated topic issues at least two weeks prior to the scheduled speech session. All topics need to be approved by the instructor.\r\nSpeech Topics for Week 2 Session (Choose one topic from the list below for your first speech. Minor changes to topics in wording allowed.)\r\n1.\tTV Violence: Mind Hazards to Children\r\n2.\tRecycling: Is It Worth the Trouble?\r\n3.\tHuman Cloning and the Issues Behind\r\n4.\tInternet Chat Room: Are they safe?\r\n5.\tLegalized Gambling: Do we need legalized casinos in Taiwan?\r\n6.\tAmnesty: Is it even an option to be considered?\r\n", "materials": "　", "foreignLanguageTextbooks": false}]