[{"name": "張素薰", "email": "shchang@ntut.edu.tw", "latestUpdate": "2007-10-30 17:02:07", "objective": "\r\nJournalistic English & Listening Training\r\nIntroduction:\r\nThis course is designed to fortify English listening and speaking abilities by exploring different aspects of the contemporary themes in which vocabulary build-up and its application to relevant topics are emphasized. Current events, in-depth reports as well as global issues from radio, newspapers and T.V are provided. \r\nBasic Doctrines:\r\n1.\tExpose students to cosmopolitan themes that are up-to-date, sophisticated and varied in tone, with a view to stimulating students more profoundly and to accelerating their retaining and using in the target language.\r\n2.\tThe films of contextually rich—cultural background and competent knowledge-related to the corresponding themes are provided to integrate the skills of the target language.\r\n3.\tLanguage capability and performance are equally stressed and developed.\r\n4.\tStudents’ active participation is essentially required.\r\n5.\tIndividual reflection is perceived by pair and group works, out-of-class assignments for review and research, oral reports and specific presentations.\r\n\r\n\r\n", "schedule": "The Syllabus for the first semester, 2007\r\n\r\nWeek\t        Topics\tAccessory Materials\t       Skills\r\n1\tDocumentary: The Music Garden\tClassical\tGetting to Talk\r\n2\tStory: Cinderella\tReading\tSelf-examination\r\n3\tTalk Show: The Oprah Show\tFamily TV Meeting\tVolume\r\n4\tPower Point Presentation\t\tPitch\r\n5\tInterview: Bill Gates\tCyperauction\tSpeed\r\n6\tInterview: Tiger Woods\tTiger Woods\tSelf-evaluation\r\n7\tJob Interview\tWhat to wear\tPronunciation\r\n8\tFilm: Michael Jackson\tDancing\tEnunciation\r\n9\tMid-term\t\tImpromptu delivery\r\n10\tNews Story: Soy Beans\tRecipe\tOutline delivery\r\n11\tNews Story: Magazines for Sale\tCheck-In & -Out\tManuscript delivery\r\n12\tNews Story: In a Class by Themselves\tBeauty Salon\tMemorized delivery\r\n13\tEditing a Piece of News Story\t\tWord choice\r\n14\tNews Story: The Death of Robert Horses\tPub\tEffective word choice\r\n15\tNews Story: Banned in the Back Yard\tBadminton\tWord meaning\r\n16\tNews Story: A Living Miracle\tSeeing the Doctor\tResearch\r\n17\tSpeech Delivery\t\t\r\n18\tFinal Examination\t\t\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n", "scorePolicy": "Assessment:\r\n1.\tWeekly tests. 60%\r\n2.\tOral reports and presentations. 40%\r\n\r\n", "materials": "　", "foreignLanguageTextbooks": false}]