[{"name": "楊韻華", "email": "yhyang@ntut.edu.tw", "latestUpdate": "2007-10-08 10:37:13", "objective": "Course Title:\t\tEnglish for Economics and International Business (經貿英文)\r\nCredit Hours:\t\t3\r\nTerm Offered:\t\tFall, 2007\r\nInstructor’s Name:\tDr. Yun-Hua Yang\r\nContact E-Mail:\tyhyang@ntut.edu.tw \r\nOffice \t\t\tGeneral Education Building Rm#805-1\r\nOffice Hours:\t\tBy Appointment \r\nRequired Text:    (1) Intelligent Business-Upper Intermediate (The Economist) Tonya Trappe & Graham Tullis, 2005. Pearson Education\r\n                (2) Selected economy video series (Commanding Heights: the Battle for the World Economy, PBS Frontline Series) \r\n(3) Selected business journal articles  \r\nCourse Description: The course is designed for English-major students who wish to increase their knowledge in business-related issues and expertise in future business practice.  All students enrolled in this course are expected to be equipped with an advanced level of English proficiency as well as basic knowledge of effective business communication as it continues where Business English Writing left off.  This course covers fundamental business concepts, important current business events, essential business terms, and comprehensive language used in business practice. During the semester, a series of video forums on economy and modern business management will be viewed and discussed during the class. Also, students are required to read the current issues of several prestigious business publications, including but not limited to, Fortune, The Economist, BusinessWeek, Wall Street Journal and the New York Times. The Premium content of the Economist provided by Pearson Longman is also used for class discussion.\r\nCourse Objectives:  This course centers its focus on understanding business context in English, and it aims to help the students:\r\n(1)\tlearn about business through the medium of English \r\n(2)\tpromote high level of awareness of the business climate \r\n(3)\timprove reading comprehension of articles relating to business\r\n(4)\tdevelop functional business language in English \t\r\nCourse requirements:\r\nEach student must complete the following requirements:  \r\n1)\tattendance* noted for grading details\r\n2)\tpresenting course unit as assigned * noted for panel assignment    \r\n3)\tparticipating in video forum and article discussions\r\nStudent Assignments and Class Activities:\r\n\t\t\t\t(A) Students are obligated to \r\n1)\tpresent course units as assigned with annotated handouts. (40 mins)\r\n2)\tprepare a short bilingual summary for weekly video forum and article discussion and give a verbal report (20 mins)\r\n3)\ttake online tests at www.intelligent-business.org\r\n4)\tparticipate in group discussions and business simulations and problem-solving activities.\r\n (B) During the semester, 2 guest speakers will be invited to share their expertise in their respective business practice (Schedule /Topic TBA)  \r\n\r\nGrading Policy:\t\t\r\nDiscussion Sessions (Intelligent Business: the Economist) \t20%\tAs assigned \r\nIn-Class Tests (3-5 tests) \r\n* Grades will be averaged by scores from the highest three tests. \r\n* Schedule for tests will be announced as the class proceed.\t25%\tNo test make-up will be considered w/o official approval beforehand or medical statement(issued by public hospitals) in case of illness \r\nWeekly Video Forum / Article Briefing \t15%\tAs assigned\r\nFinal Exam\t20%\tWeek 18 \r\nAttendance \t20%\t5% reduction for each unexcused absence\r\nSemester Grade \t100%\t\r\n", "schedule": "Weekly Syllabus\r\nWeek /Date\tTopic Area \tWeekly Video Forum and Article \tPresenter\r\nWk 1\tOrientation \tThe Persuaders (viewing)\t\r\nWk 2\tUnit 1 Alliances\tThe Persuaders (outlines / discussions)\t1 // 7\r\nWk 3\tUnit 2 Projects\tThe Persuaders (outlines / discussions)\t2 // 8\r\nWk 4\tNo class (Double Tenth Day)\tX\tX\r\nWk 5\tUnit 3 Teamworking\tThe Merchants of Cool (outlines / discussion)\t3 // 9\r\nWk 6\tUnit 4 Information\tThe Merchants of Cool (outlines / discussion)\t4 //10\r\nWk 7\tUnit 5 Technology\tIs Wal-Mart Good for America (outlines / discussion)\t5 // 11\r\nWk 8\tUnit 6 Advertising\tIs Wal-Mart Good for America (outlines / discussion)\t6 // 12\r\nWk 9 \tUnit 7 Law\tBusiness Article TBD\t7 // 13\r\nWk10\tUnit 8 Brands\tBusiness Article TBD\t8 // 14 \r\nWk11\tUnit 9 Investment\tBusiness Article TBD\t9 // 15\r\nWk12\tUnit 10 Energy\tBusiness Article TBD\t10 // 1\r\nWk13\tUnit 11 Going Public\tBusiness Article TBD\t11 // 2\r\nWk14\tUnit 12 Competition\tBusiness Article TBD\t12 // 3\r\nWk15\tUnit 13 Banking\tBusiness Article TBD\t13 // 4\r\nWk16\tUnit 14 Training\tCan you afford to retire?\t14 // 5\r\nWk 17\tUnit 15 Consulting\tCan you afford to retire?\t15 // 6\r\nWk 18\tFinal Examination \tX\tX\r\n", "scorePolicy": "　", "materials": "　", "foreignLanguageTextbooks": false}]