[{"name": "余盛延", "email": "syyu@ntut.edu.tw", "latestUpdate": "2007-10-03 00:40:02", "objective": "本課程引導學生熟悉變遷中之英美文學作品典律，並探討其形成之歷史文化背景及隨變遷所產生之時代意義。課程中將討論與作品相關之社會、政治、文化、心理、哲學、理論等議題，使學生能瞭解欣賞選讀作品，並銳化其思辯能力及分析技巧。學生須於課前詳讀作品，並於課堂上參與討論。\r\nThis course aims to introduce American culture from the early 20th-century up to 1960 via two texts of fictionalized history or historicized fiction: E. L. Doctorow’s The Book of Daniel (1971) and Ragtime. In the former we will investigate the phenomenon of an era, which could roughly be called McCarthyism, and its impact on American culture and the lives of a specific American family. In the latter, we will examine the state of racial issues and conflicts through Doctorow’s impressionistic presentation of the lives of two families who are counterparts in relation to other lines of the stories sketchily integrated as a whole. Given the limited amount of time we have in class, we will discuss The Book of Daniel in depth, leaving Ragtime for you to consume outside the class. In addition, you are required to read on your own Conversations with E. L. Doctorow to enrich your knowledge of Doctorow and the contemporary novel addressed in the books. We will not have a midterm, but a final examination will be given at the end of the semester. In between the opening of the class and the final, I expect you to engage in active participation in class discussion. In the last four class meeting of this semester before the final, you will be required to deliver oral presentations on Ragtime and Conversations with E. L. Doctorow. We will discuss how the oral presentations could be arranged. Grading policy: class attendance and performance: 30%; oral presentations: 30%; final examination: 40%", "schedule": "09/17  Introduction\r\n\r\n09/24  No class\r\n\r\n10/01  The Book of Daniel, pp. 3-30.\r\n\r\n10/08  The Book of Daniel, pp. 30-54.\r\n\r\n10/15  The Book of Daniel, pp. 55-82.\r\n\r\n10/22  The Book of Daniel, pp. 82-108.\r\n\r\n10/29  The Book of Daniel, pp. 108-136.\r\n\r\n11/05  The Book of Daniel, pp. 136-161.\r\n\r\n11/12  The Book of Daniel, pp. 161-192.\r\n\r\n11/19  The Book of Daniel, pp. 193-221.\r\n\r\n11/26  The Book of Daniel, pp. 221-250.\r\n\r\n12/03  The Book of Daniel, pp. 250-303.\r\n\r\n12/10  Oral Presentation on Ragtime: Part 1 (Groups 1-4)\r\n\r\n12/17  Oral Presentation on Ragtime: Part 2 (Groups 5-8)\r\n\r\n12/24  Oral Presentation on Conversations with E. L. Doctorow: Part 1\r\n       (Groups 1-4)\r\n\r\n12/31  No class\r\n\r\n01/07  Oral Presentation on Conversations with E. L. Doctorow: Part 2 \r\n       (Groups 5-8)\r\n\r\n01/14  Final Exam\r\n", "scorePolicy": "Grading policy: class attendance and performance: 30%; oral presentations: 30%; final examination: 40%", "materials": "Texts:\r\nE. L. Doctorow’s The Book of Daniel (1971) (303 pages)\r\nE. L. Doctorow’s Ragtime (1974; film: 1981) (320 pages)\r\nMorris, Christopher D and E. L. Doctorow. Conversations with E. L. Doctorow (Literary Conversations Series) (256 pages)\r\n", "foreignLanguageTextbooks": false}]