[{"name": "陳雅玫", "email": "ymchen@ntut.edu.tw", "latestUpdate": "2007-11-02 00:28:01", "objective": "This course is designed to introduce to students basic skills for sight translation (or sight interpreting) and consecutive interpretation, including public speaking, reading aloud, paraphrase, interpreting numbers, memory retention, and shadowing. These skills will not only lay the foundation for more advanced interpreting training but will also be of value in other professions.", "schedule": "WEEK 1: introduction of the course; interpreting practice\r\nWEEK 2: Mid-Autumn Festival Holidays\r\nWEEK 3: basic concepts of interpretation and requirements for being  \r\n        an interpreter; read aloud \r\nWEEK 4: public speaking; paraphrase (Chinese - Chinese)\r\nWEEK 5: paraphrase (Chinese - Chinese)\r\nWEEK 6: paraphrase (English - English)\r\nWEEK 7: paraphrase (English - English)\r\nWEEK 8: interpreting numbers \r\nWEEK 9: MID-TERM EXAM\r\nWEEK 10: sight translation (English-Chinese)             \r\nWEEK 11: sight translation (English-Chinese)\r\nWEEK 12: sight translation (Chinese - English) \r\nWEEK 13: sight translation (Chinese - English)\r\nWEEK 14: memory retention and recall; short consecutive interpreting \r\n        (E-C)\r\nWEEK 15: short consecutive interpreting (E-C)\r\nWEEK 16: New Year’s Day\r\nWEEK 17: short consecutive interpreting (C-E)\r\nWEEK 18: FINAL EXAM\r\n", "scorePolicy": "(1) attendance & participation: 15%\r\n(2) assignment: 25%\r\n(4) mid-term exam: 30%\r\n(5) final exam: 30%  \r\n", "materials": "Requirements and rules: \r\n1. Please turn off your cell phone during the two-hour class period.\r\n\r\n2. Absence: Students are expected to attend the class ON TIME. \r\n(1) Being late for more than TWENTY minutes equals one hour  unexcused absence. One hour UNEXCUSED absence results in 2 points deduction.  \r\n(2) For an absence to be excused, students need to submit compelling evidence of the gravity or unforseeability of the event causing the absence within ONE WEEK. \r\n(3) Students missing more than TEN hours will have a fail.\r\n(4) Absence from a class is no excuse for not knowing the assignment and what has been discussed in that class. There will be NO MAKE-UP EXAM unless you have valid and official reasons for absence BEFOREHAND.\r\n\r\n3. Assignment: \r\n(1) Students are required to do the practice assignments both individually and in a group, except for the public speaking assignment. \r\n(2) In class, the instructor will call on individual students at random to check off if they have done the assigned exercises, and students’ performances will be evaluated.  \r\n(3) Concerning group evaluation, each group needs to submit a written report (within one page) every week, briefly describing in English the problems or difficulties encountered as regards the assigned exercises. The report should be e-mailed to the instructor by Friday 5pm. For late submission, 20% of the mark will be deducted each day. Reports more than THREE days late will not be accepted\r\n", "foreignLanguageTextbooks": false}]