[{"name": "陳雅玫", "email": "ymchen@ntut.edu.tw", "latestUpdate": "2008-09-18 14:50:58", "objective": "This is an introductory course aiming to familiarize students with basic concepts of translation, including qualifications of good translators, the procedure of translation, use of references & electronic tools and the idea of translation equivalence. Also, the relevance of contrastive studies between English and Chinese to translation will be introduced. A guided application of the linguistic knowledge to practical work will be provided, in the interest of assisting students in formulating suitable and appropriate translation strategies and techniques. This course is intended to prepare students for more specialized translation training.", "schedule": "Week 1: course introduction\r\nWeek 2: lecture on “what makes a good translator?”; exercises\r\nWeek 3: oral report; lecture on: (1) procedure of translation;\r\n(2)  references & electrical tools\r\nWeek 4: Double Tenth Day\r\nWeek 5: discussion of assignment; oral report; lecture on\r\ntranslation equivalence\r\nWeek 6: discussion of assignment; oral report; lecture on\r\ncontrastive studies of lexicon & translation (1)\r\nWeek 7: oral report; lecture on contrastive studies of lexicon &\r\ntranslation (2)\r\nWeek 8: discussion of assignment; oral report; lecture on\r\ncontrastive studies of pronouns & translation\r\nWeek 9: Mid-term exam\r\nWeek 10: oral report; lecture on contrastive studies of verbs &\r\ntranslation (1)\r\nWeek 11: discussion of assignment; oral report; lecture on\r\ncontrastive studies of verbs & translation (2)\r\nWeek 12: oral report ; lecture on contrastive of prepositions and\r\narticles & translation\r\nWeek 13: discussion of assignment; oral report; lecture on\r\ncontrastive studies of word order & translation (1)\r\nWeek 14: oral report; lecture on contrastive studies of word order &\r\ntranslation (2)\r\nWeek 15: discussion of assignment; oral report; lecture on idioms &\r\ntranslation\r\nWeek 16: oral report; lecture on cultures & translation\r\nWeek 17: discussion of assignment; wrap up\r\nWeek 18: Final exam\r\n", "scorePolicy": "(1) attendance & participation: 15%\r\n(2) presentation: 15%\r\n(3) assignment: 20%\r\n(4) mid-term exam: 20%\r\n(5) final-exam: 30%\r\n", "materials": "1. instructor’s lecture handouts\r\n2. selected readings from the following books:\r\n(a) main textbooks:文體與翻譯 （劉宓慶）\r\n(b) references:英漢翻譯教程（張培基）、英漢與漢英翻譯（柯平）\r\n英漢翻譯理論與實踐（葉子南）\r\nA Textbook of Translation (Peter Newmark)\r\n\r\nRequirements & Rules:\r\n1. Please turn off your cell phone during the three-hour class period.\r\n\r\n2. Absence: Students are expected to attend the class ON TIME. \r\n(1) Being late for more than TWENTY minutes equals one hour unexcused absence. One hour UNEXCUSED absence results in 2 points deduction.  \r\n(2) For an absence to be excused, students need to submit compelling evidence of the gravity or unforseeability of the event causing the absence within ONE WEEK. \r\n(3) Students missing more than TEN hours excused or unexcused will have a fail.\r\n(4) Absence from a class is no excuse for not knowing the assignment and what has been discussed in that class. There will be NO MAKE-UP EXAM unless you have valid and official reasons for absence BEFOREHAND.\r\n\r\n3. Translation + Commentary Essays: \r\n(1) Students will periodically submit portions of translation with commentary. All translation assignments have to be typed. Further details concerning the format will be provided in WEEK 3. \r\n(2) All assignments must be submitted via e-mail by 5pm Monday. For late assignments, 20% of the assignment mark will be deducted each day. Assignments more than THREE days late will not be accepted\r\n\r\n4. Readings and PowerPoint presentations\r\n(1) All students are expected to complete the assigned readings before classes. \r\n(2) Guidelines for the oral presentations are given below: \r\n(a) The presentations must be made in ENGLISH and should be around 30 minutes long. \r\n(b) E-mail the PowerPoint slides to the instructor by 5 pm Tuesday. \r\n\r\n5. Term Paper:\r\n(1) A fully documented short research paper (4,000 - 4500 words in length) on a topic chosen in consultation with the instructor. \r\n(2) A 3-4 page proposal of the research paper will be due in Week 12. \r\n(3) The final paper will be due in Week 18. Late work will not be accepted except in urgent circumstances. \r\n(4) Further details concerning the format will be provided in WEEK 6. \r\n\r\n", "foreignLanguageTextbooks": false}]