[{"name": "柯萊恩", "email": "kcline@ntut.edu.tw", "latestUpdate": "2007-11-16 12:33:03", "objective": "本課程旨在訓練學生公開表達之能力，內容包括語言表達基本原則與技巧、肢體語言與演講要領，備題演講及即席演講演練。\t\r\nThis course will present you with work aimed at developing your oral language skills, including your ability to “think on your feet,” and to speak effectively, fluently, cogently and dramatically.  Students will regularly be asked to prepare and present oral presentations or to argue cases, either pro or con, as part of a debating team.  Both the public speaking and debate components of the class will also require research, preparation and rehearsal; indeed, upon the soundness of these three prerequisites your grade will chiefly rest.", "schedule": "STUDENT RESPONSIBILITIES\r\n\r\n1)  Participation.  A substantial portion of your final grade is based on your participation in the class.  This is calculated not only according to your giving of presentations and engagement in debates, but upon your willingness to ask meaningful questions of and critique classmates.\r\n\r\n2) Critiques.  Each class, a number of students will be given the opportunity to try out their public speaking skills with various topics and in various situations.  You are responsible, each class, for composing a brief (one paragraph) written critique of at least one student’s public speaking performance.  These critiques must be typed, double-spaced, and handed into me at the beginning of the class following the speaker’s original remarks.  I will look over your paragraph, give you critique credit and then pass on your remarks to the student you have evaluated.  Each class you must evaluate a different student.  No late critiques will be accepted.\r\n\r\n3)   Small Group Work.  Students will work with classmates on a number of small group activities over the course of the semester.  Small group activities form a large part of your participation score in the class and are mandatory for all class members.\r\n\r\n4)  Attendance..  Frequent attendance is mandatory.  After your first three absences, each subsequent unexcused absence will cause your final grade to be reduced by one grade point.  If you are absent, it is your responsibility to find out the substance of class discussions and to make up homework.  Since I generally take roll in the first five minutes of class, if you come in late you may be marked absent.  It is your responsibility to let me know if you've been tardy after class ON THE DAY THAT YOU ARE LATE.  Three tardies = one absence.\r\n", "scorePolicy": "25%     Public Speaking Presentations\t\t\t\r\n25%     Debate Presentations\t\t\t\t\r\n25%     Class Participation and Critiques\r\n25%     Final Presentation\r\n", "materials": "　", "foreignLanguageTextbooks": false}]