[{"name": "余盛延", "email": "syyu@ntut.edu.tw", "latestUpdate": "2014-07-10 06:10:19", "objective": "本課程引導學生熟悉變遷中之英美文學作品典律，並探討其形成之歷史文化背景及隨變遷所產生之時代意義。課程中將討論與作品相關之社會、政治、文化、心理、哲學、理論等議題，使學生能瞭解欣賞選讀作品，並銳化其思辯能力及分析技巧。學生須於課前詳讀作品，並於課堂上參與討論。", "schedule": "09/11  Introduction\r\n\r\n09/18  General comments on Christopher Marlowe’s Doctor Faustus (1604; 1616); Doctor Faustus [Prologue, 1.1-1.4]\r\n\r\n09/25  Doctor Faustus [2.1-2.3]\r\n\r\n10/02  Holiday\r\n\r\n10/09  Doctor Faustus [3 Chorus; 3.1; 3.2]\r\n\r\n10/16  Doctor Faustus [4 Chorus; 4.2]\r\n\r\n10/23  Doctor Faustus [5.1-Epilogue] \r\n\r\n10/30  General Comments on Nathaniel Hawthorne’s The Scarlet Letter; The Scarlet Letter [The Custom-House]\r\n\r\n11/06  The Scarlet Letter [I. The Prison-Door; II. The Market-Place; III. The Recognition]\r\n\r\n11/13  The Scarlet Letter [IV. The Interview; V. Hester at Her Needle; VI. Pearl; VII. The Governor’s Hall]\r\n\r\n11/20  The Scarlet Letter [VIII. The Elf-Child and the Minister; IX. The Leech; X. The Leech and His Patient]\r\n\r\n11/27  The Scarlet Letter [XI. The Interior of a Heart; XII. The Minister’s Vigil; XIII. Another view of Hester; XIV. Hester and the Physician]\r\n\r\n12/04  The Scarlet Letter [XV. Hester and Pearl; XVI. A Forest Walk; XVII. The Pastor and His Parishioner]\r\n\r\n12/11  The Scarlet Letter [XVIII. A Flood of Sunshine; XIX. The Child at the Brook-side; XX. The Minister in a Maze]\r\n\r\n12/18  The Scarlet Letter [XXI. The New England Holiday; XXII. The Procession; XXIII. The Revelation of the Scarlet Letter; XXIV. Conclusion]\r\n\r\n12/25  Final Exam\r\n\r\n01/01  National Holiday\r\n\r\n01/08  Review and Discussion", "scorePolicy": "Grading policy: attendance: 20%; class participation: 30%; final exam: 50%", "materials": "Required Texts\r\nMarlowe, Christopher. The Tragical History of Doctor Faustus. (A 1604 Version) Ed. David Bevington and Eric Rasmussen. English Renaissance Drama: A Norton Anthology. Ed. David Bevington, et al. New York: Norton, 2002. 250-284.\r\n\r\nHawthorne, Nathaniel. The Scarlet Letter. Oxford UP.", "foreignLanguageTextbooks": false}]