[{"name": "施欣文", "email": "sharinschroeder@ntut.edu.tw", "latestUpdate": "2014-09-19 14:52:29", "objective": "課程重點：(1)藉由適合其程度的教材加強學生必備的基礎文法觀念和句型結構；(2)使學生確切把握閱讀要領以及充分瞭解寫作的各種技巧，重心在生字、片語、句法的解釋和基本寫作技巧的分析；(3)熟悉英語人士日常生活情境及與學生將來就業環境相關之會話及適當之應對方式；(4)透過練習加強聽、說、讀、寫的知能及表達。", "schedule": "Week 9 is the midterm.\r\nWeek 18 is the final. \r\nIn other weeks, you will have homework, presentations, quizzes, and tests.", "scorePolicy": "GRADING CATEGORIES\r\nHomework: 25%\r\nQuizzes/Tests: 25%\r\nParticipation: 10%\r\nSkits, Presentations, and Oral Work: 10%\r\nMidterm: 15%\r\nFinal: 15%\r\n(Note that we will be using TOIEC tests for the midterm and final, and there are practice exams online.)\r\n\r\nI may modify these grade percentages and this syllabus at my discretion. The midterm and final will always be worth 30% of your grade.", "materials": "Required Materials:\r\n‧\tTextbook: American Headway Level 4 (2nd edition), John and Liz Soars, Oxford\r\n‧\tnotebook with removable paper (or additional loose-leaf paper)\r\n‧\tdry-erase marker and cloth to be used as an eraser\r\n‧\tscissors\r\n\r\nACTIVITIES\r\nIn class we will do many activities involving listening, speaking, reading, and writing. Be prepared to speak in front of the class. In some weeks I may assign skits and/or oral presentations in addition to the homework. I may also have you write short paragraphs in class. Depending on the purpose of this writing activity, I may or may not have you turn in your writing activity. (I do not tell you in advance whether I will collect a writing activity.) Please show yourself trustworthy in all areas by always doing your own work.\r\n\r\nPARTICIPATION\r\nYour participation is what makes or breaks this course. When you participate, everyone learns more and has more fun. Someone with a high grade in participation is engaged with class activities; takes academic honesty seriously and does all homework individually; stays focused and on task; takes notes; speaks exclusively, frequently, and thoughtfully in English; knows when to listen and when to speak; reads with expression and enthusiasm; is creative, enthusiastic, and audible during skits and presentations; is trustworthy; and interacts positively, helpfully, and tactfully with other class members. Remember, it’s okay to make mistakes. The goal is communication, and your questions and comments help other students. \r\n\r\nCLASS POLICIES\r\n‧\tSpeak English. If you speak only in English, your participation grade will be high. If you speak mostly English, your participation grade will be passing. If you speak more Chinese than English, you will not receive a passing grade in participation. \r\n‧\tCell phones should never be visible or audible in class, even for charging. Keep them out of sight and turned off. Please do not use any electronic devices, other than an optional electronic translator, in class. Electronic translators can only be used for translation. If your cell phone or other electronic device is visible, even if off, you will lose participation points. If you use any electronic device for any reason, you will be marked absent. \r\n‧\tPlease by prompt. Lateness equals ½ absence. \r\n‧\tStudents who have six absences (the equivalent of three weeks), twelve tardies, or the equivalent combination of absences and tardies, cannot pass the course. \r\n‧\tIf you are not participating in an activity or are asleep, you will be marked absent. Failure to bring course materials may lead to being marked absent and losing participation points.\r\n‧\tYou are always responsible for knowing what happens during all class meetings. If you miss a class session, telephone or email a member of the class, and ask him/her what you missed and what you need to be ready for at the meeting to come. If it’s an excused absence, make sure to give me the proper form. Make sure you know what homework is due next time. \r\n‧\tHomework, dialogues, quizzes, and tests may not be made up after the fact. Please let me know a week ahead of time if you have an official school-excused absence in the future.", "foreignLanguageTextbooks": false}]