[{"name": "張素薰", "email": "shchang@ntut.edu.tw", "latestUpdate": "2014-05-26 15:54:20", "objective": "本課程利用新聞教材加強英語字彙能力及聽力技巧, \t內容採用電台、報紙、電視的時事、深度報導和全球議題以增強學生英語知識。同時, 學生亦可獲得各種有用的聽力技巧以加強英語聽力。", "schedule": "Multimedia English Listening and Speaking\r\n\r\nObjective:\r\n\r\nThis course is designed to familiarize students with daily spoken English as well as listening and speaking skills. The content includes a wide variety of authentic multimedia materials-printed audio and video texts. This gives students an opportunity for both recognition of different speaking styles and an in-depth, culture-rich understanding of the topics from multiple perspectives. Real-life situations are rehearsed in the classroom, with role-plays, situational activities, excerpts from newspapers and magazines and interviews with real people. Speaking practices based on day-to-day language are emphasized in class.\r\n\r\nBasic Doctrines:\r\n\r\n1.\tExpose students to cosmopolitan themes that are up-to-date, sophisticated and varied in tone, with a view to stimulating students more profoundly and to accelerating their retaining and using in the target language.\r\n2.\tThe films and magazines of contextually rich—cultural background and competent knowledge-related to the corresponding themes are provided to integrate the skills of the target language.\r\n3.\tLanguage capability and performance are equally stressed and developed.\r\n4.\tStudents’ active participation is essentially required.\r\n5.\tIndividual reflection is perceived by pair and group works, out-of-class assignments for review and research, oral reports and specific presentations.\r\n\r\nAssessment:\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nSyllabus for 4e1 Multimedia English Listening and Speaking, 2014 (1)\r\nWeek\tCNN ( No. 96)\tLanguage Skills\r\n1\tIntroduction\tIntroduction\r\n2\tHeir Apparent\tFinding Faults\r\n3\tThe Man behind the Mouse\tYour Talk\r\n4\tA View from the Top\tSelf-examination\r\n5\tCrash Landing\tImpromptu Delivery\r\n6\tBreathing Easy, Appy Birthday\tOutline Delivery\r\n7\tGetting a Grip, Texting Trauma\tManuscript Delivery\r\n8\tPuppet Magic, Delectable Lima\tMemorized Delivery\r\n9\tPower-point Presentation\tMid-Term\r\n10\tGiving Diplomacy a Chance\tThe Voice\r\n11\tTool of Terror\tThe Voice\r\n12\tStreaming Success\tClarity\r\n13\tBending Bodies\tSelf-Evaluation\r\n14\tPackaging Pioneer\tWord Choice\r\n15\tGalaxy Gears Up, Stun Phone\tWord Meaning\r\n16\tBusan by the Sea\t\r\n17\tPowerpoint Presentation\t\r\n18\tFinal examination\tFinal examination", "scorePolicy": "1.\tWeekly tests and Attendance (20 points maximum deduction). 80%\r\n2.\tOral reports and presentations. 20%", "materials": "　", "foreignLanguageTextbooks": false}]