[{"name": "施欣文", "email": "sharinschroeder@ntut.edu.tw", "latestUpdate": "2014-06-02 21:26:02", "objective": "COURSE OVERVIEW\r\n\r\nIn this class, we will work increasing spoken fluency and building a larger vocabulary. The more you speak, the more you will learn, and the better you will do in the class (provided that you are also attentive to those around you and allow them a place to jump into the conversation). We will do many small and large group activities to facilitate conversation. \r\n\r\nThis is an English conversation class. In order to get a grade of a 75% or higher, you must speak exclusively in English in this class. (Failure to speak exclusively in English will automatically lower your grade to a 75%, and it may be even lower based on your performance in other areas. You will receive three grace cards for minor slip-ups.) Please speak only English from the moment you walk in the classroom door. Greet your classmates in English. Say goodbye in English. Make plans to work on your group presentations in English. Only by constantly speaking English will you find the holes in your vocabulary and reach fluency.", "schedule": "Each week, you will have a reading to do or podcast to listen to, which we will discuss in class the following week. You will also need to study for vocabulary quizzes, and you will make group and/or individual presentations. Schedule TBA, but here is a sample schedule. \r\n\r\nWeek 1: Syllabus Discussion\r\nCircumlocution\r\n\r\nWeek 2:  “The Art of Conversation” \r\n\r\nWeek 3: Emily Post  “Conversation” from Etiquette. 1922.", "scorePolicy": "GRADING AND OTHER POLICIES\r\n\r\nGrade Percentages:\r\n\r\nI may modify these grade weights at my discretion. If I do so, I will let you know. \r\n\r\n\r\n30%\tPresentations (graded on criteria such as clarity, fluency, originality, creativity, and effort)\r\n30%\tReading and Vocabulary Quizzes\r\n25%\tParticipation & English spoken (in student-led discussions, whole-class activities, etc.) \r\n15%\tFinal Oral Exam/Improvisation \r\n\r\nGrading Criteria:\r\n\r\nA\tSuperior work. Achievement that is outstanding relative to the level necessary to meet course requirements.\r\n\r\nB\tAchievement that is significantly above the level necessary to meet course requirements.\r\n\r\nC \tAchievement that meets the course requirements in every respect. \r\n\r\nD \tAchievement that fails to meet fully the course requirements. \r\n\r\nF \tAchievement that is not worthy of credit. The student did not contribute sufficient effort. S/he may not participate in classroom work. Assignments are either (a) completed but not completed at a level of achievement that is not worthy of credit; (b) frequently late, thereby lowering the grade too significantly to give the student a chance to pass; or (c) never completed at all.", "materials": "ATTENDANCE AND TARDINESS POLICIES\r\nComing to class late or leaving class early disrupts class discussion and activities. In addition, you miss important class announcements concerning future class sessions. You may also miss assignments and quizzes. (Quizzes in my class cannot be made up. Your lowest quiz score will be dropped.) Plan to arrive on time and be prepared to work during the entire class period. If you are five minutes late, that counts as half an absence. If you have three unexcused absences, you will fail the course. On the other hand, if you attend every class session and are on time, I will raise your final grade by 1%. Attendance requires your presence in both body and mind. If you are not prepared to participate and engage in class discussion and activities, you may be counted absent.\r\n\r\nYou are always responsible for knowing what happens during all class meetings. If you miss a class session, telephone or email a member of the class, and ask him/her what you missed and what you need to be ready for at the meeting to come. If you miss the class on a presentation day, you cannot make up the points and your group should be prepared to present without you (if it’s a group project). \r\n\r\nPlease e-mail me if you will be absent (before class if possible and no later than twenty-four hours after class). Absent students who e-mail me consistently do better in the course than those who fail to contact me. I will communicate with you by email; check your email. In the event that class is cancelled, I will most likely communicate this to you via email as early as possible before class starts.\r\n\r\n \r\nUSE OF TECHNOLOGY\r\nPlease print out any e-mailed readings. I ask that students do not use laptops, cell phones, iPods, or other electronic devices in my class. (I find that laptop use in discussion-based classes discourages eye contact and distracts students around you.) If you do have a cell phone in your bag, make sure it’s turned off. Never respond to an electronic device during class. If you are using your laptop or any other electronic device inappropriately in class, you will be marked absent. \r\n\r\nOFFICE HOURS\r\nI prefer not to answer involved questions over e-mail. Students tend either (a) to procrastinate while waiting to hear from me (wasting their own time), or (b) to move on, so that they no longer need my answer by the time I am able to respond to their question (wasting my time). If you would like to discuss a question with me, make an appointment with me during my office hours. If you do set up a time to meet with me, feel free to include your question in the e-mail. I may not answer it over e-mail, but I will think about it, and we can discuss it when you come to my office. \r\n\r\nETHICS\r\nPlease show yourself to be trustworthy in all areas. All of your work should be original and well documented. Below is a description of academic dishonesty: \r\n\r\nScholastic dishonesty means plagiarizing; cheating on assignments or examinations; engaging in unauthorized collaboration on academic work; taking, acquiring, or using test materials without faculty permission; submitting false or incomplete records of academic achievement; acting alone or in cooperation with another to falsify records or obtain dishonestly grades, honors, awards, or professional endorsement; altering, forging, or misusing a University academic record; or fabricating or falsifying data, research procedures, or data analysis.", "foreignLanguageTextbooks": false}]