[{"name": "洪祖全", "email": "tchung@ntut.edu.tw", "latestUpdate": "2009-10-26 16:21:33", "objective": "授課目標:本學期主要奠立學生對於能源系統的認識，達到具有以下的實力：(1)狀態與熱力性質、(2)過程與狀態的轉換、(3)質量與能量守恆、(4)不同系統的認識與應用、(5) Entropy的認識。\r\n\r\n學生可獲得之知識、技能或進階學習之基礎 :\r\n認識熱力學之後，學生將會對材料性質的抽象轉為具體，因此對於任何領域的接觸，將會更容易接受。將來同學可以往能源與動力相關領域走。", "schedule": "授課進度及大綱:\r\n1. Basic concept: Overall picture of thermodynamics and energy; Introduction of the systems, cycles, processes, states, and properties.\r\n2. Basic concept: point (state) and path (process) functions; the knowledge of pressure, work, heat, unit conversion.\r\n3. Properties: Extensive and intensive properties; physical and thermodynamic properties; total energy and various types of energy;\r\n4. Equilibrium diagram: Saturated curve of pure substance from experiments.\r\n5. Equilibrium diagram: its relation with steam Table; Table method practice; determination of the state location.\r\n6. More practice of the Table method for determining the properties; 1st mid-term exam.\r\n7. Equilibrium diagram: Reasons to assume its ideal gas; Table method practice; concept of u = u(T).\r\n8. More practice and understanding to the ideal gas; incompressible materials.\r\n9. Conservation of Mass: General equation – the derivative.\r\n10. Conservation of Mass: concept of uniform, steady state, and transient\r\n11. fundamental concept of thermodynamic cycles\r\n12. 2Nd law of thermaodynamics and entropy\r\n13. Conversions among T-v, p-v, and T-s diagrams.\r\n", "scorePolicy": "About 2 mid-terms and 1 final examinations: Date will be determined according to the progress of the lecture.\r\nYour final points will be completely dependent of what you can show yourself in the examinations and special performance in the class. Homework will be assigned but you do not have to hand in. They will be considered in the examinations. You can freely handin your homework and would be helpful in your grade.", "materials": "1. 教科書：”Thermodynamics” – by William Z. Black and James G. Hartley\r\n2. 教材：備有講義成冊供學生拷貝\r\n3. 參考教材：”Engineering Thermodynamics” – by Moran and Shapiro.\r\n", "foreignLanguageTextbooks": false}]