[{"name": "曾添文", "email": "f10403@ntut.edu.tw", "latestUpdate": "2009-09-05 12:45:08", "objective": "介紹單位換算與有效數位，元素的原子結構、化學方程式平衡與計算，反應熱，氣體與氣體定律，大氣層與環境污染，週期表，化學鍵，化合物的分子結構，熱力學，動力學，反應機構，平衡常數，氧化與還原，酸鹼反應，電化學，混合物的分離及現代科技材料，奠定良好化學基礎。", "schedule": "1週. Chemical Foundations: units of measurement, significant figures and calculations, dimensional analysis, temperature, density, classification of matter.\r\n2-3週. Atoms, Molecules, and Ions: fundamental chemical laws, Dalton’s Atomic Theory, the modern view of atomic structure, naming simple compounds.\r\n4-5週. Stoichiometry: atomic masses, the mole, molar mass, determining the formula of a compound, chemical equations, the concept of limiting reagent.\r\n6-7週. Types of Chemical Reactions and Solution Stoichiometry: the nature of aqueous solutions,the composition of solutions, precipitation reactions, stoichiometry of precipitation reactions, acid-base reactions,oxidation-reduction reactions, balancing oxidation-reduction equations.\r\n8週. Gases: pressure,the Ideal Gas Law, gas stoichimetry, Dalton’s Law of partial pressures,the kinetic molecular theory of gases, effusion and diffusion,real gases,characteristics of several real gases, chemistry in the atmosphere.\r\n9-10週. Thermochemistry: the nature of energy, enthalpy and calorimetry, Hess's Law, standard Enthalpies of formation, new energy sources.\r\n11-12週. Atomic Structure and Periodicity: electromagnetic radiation, the atomic spectrum of htdrogen, the Bohr model, the quantum mechanical model of the atom, quantum numbers, orbital shapes and energies, electron sin and the Pauli principle, polyelectronic atoms, the history of periodic table, group trends periodic trends in atomic properties, ionization energy, sizes of atoms and ions, the properties of a group.\r\n13-14週. Bonding: General Concepts: types of chemical bounds, electronegativity, nond polarity and dipole moments, ions: electron configurations and sizes, energy effects in binary ionic compounds, partial ionic and covalent bond energies and chemical reactions, the localized electron bonding model, Lewis structure.\r\n15-16週. Covalent Bonding: hybridization, molecular orbital model, bounding in homonuclear diatomic molecules, bounding in heteronuclear diatomic molecules, combining the localized electron and molecular orbital models.\r\n17-18週. Liquids and Solids: intermolecular forces, the liquid state, an introduction to structures and types of solids, structure and bounding in metals, carbon and silicon, molecular solids, ionic solids, vapor pressure and changes of state, phase diagrams. \r\n", "scorePolicy": "期中考:30%\r\n平常小考:30%\r\n期末考:40%\r\n", "materials": "Chemistry\r\nSteven S. Zumdahl\r\nSusan A. Zumdahl\r\n Brooks/Cole, Cengage Learning, eighth edition.", "foreignLanguageTextbooks": false}]