[{"name": "楊韻華", "email": "yhyang@ntut.edu.tw", "latestUpdate": "2009-09-14 12:36:43", "objective": "Course Title:\t\tEnglish for Economics and International Business (經貿英文)\r\nCredit Hours:\t\t3\r\nTerm Offered:\t\tFall, 2009\r\nInstructor’s Name:\tDr. Yun-Hua Yang\r\nContact E-Mail:\tyhyang@ntut.edu.tw \r\nOffice \t\t\tGeneral Education Building Rm#805\r\nOffice Hours:\t\tBy Appointment \r\nRequired Text:    (1)Business Results Advanced Oxford University Press, 2009 \r\n                (2) Compiled Handouts of Business Content Vocabulary \r\n(3) Selected business journal articles  \r\nCourse Description: The course is designed for English-major students who wish to increase their knowledge in business-related issues and expertise in future business practice.  All students enrolled in this course are expected to be equipped with an advanced level of English proficiency as well as basic knowledge of effective business communication as it continues where Business English Writing left off. This course covers fundamental business concepts, important current business events, essential business terms, and comprehensive language used in business practice. Business content vocabulary incorporating several main business categories / disciplines will be introduced. Also, students are required to read the current issues of several prestigious business publications, including but not limited to, Fortune, The Economist, BusinessWeek, Wall Street Journal and the New York Times. The \r\nCourse Objectives:  This course centers its focus on understanding business context in English, and it aims to help the students:\r\n(1)\tlearn about business through the medium of English \r\n(2)\tpromote high level of awareness of the business climate \r\n(3)\timprove reading comprehension of articles relating to business\r\n(4)\tdevelop functional business language in English \t\r\n", "schedule": "Weekly Syllabus\r\nWeek / Date \tMain Course Activities\r\n(Task-Based) \tBusiness Vocab.\r\n(Content-Based)\tQuiz / Note\r\nWk 1 \tOrientation \tBusiness VQ test\t\r\nWk 2\tPresentation Unit 2\r\nCareers\tManagement\t\r\nWk 3\tPresentation Unit 3\r\nChange\tManagement\t\r\nWk 4\tPresentation Unit 4\r\nRisk\tMarketing \tQuiz 1\r\nWk 5\tPresentation Unit 5\r\nTeamwork\tMarketing \t\r\nWK 6\tSpecial Topic: Marketing (Tentative)\t*Marketing \tWharton Business School / HBS \r\nWK 7\tSpecial Topic: Marketing (Tentative)\t*Marketing\tWharton Business School / HBS\r\nWK 8\tPresentation Unit 6\r\nProgress\tProduction & Operation Management\tQuiz 2\r\nWK 9\tMidterm Week\tMidterm Week \t\r\nWK 10\tPresentation Unit 7\r\nLearning \tProduction & Operation Management \t\r\nWK 11\tPresentation Unit 8\r\nPerformance\tMoney & Banking\tQuiz 3\r\nWK 12\tPresentation Unit 9\r\nResources \tMoney & Banking\t\r\nWK 13\tUniversity Evaluation\tUniversity Evaluation \t\r\nWK 14\tPresentation Unit 10\r\nLeadership\tTrade & Commerce\tQuiz 4\r\nWK 15\tPresentation Unit 11\r\nValues \tTrade & Commerce\t\r\nWK 16\tCurrent Business Topics\tCompany Finance\tQuiz 5\r\nWK 17\tCurrent Business Topics \tCompany Finance\t\r\nWK 18\tFinal Exam\t\t\r\n", "scorePolicy": "Student Assignments and Class Activities:\r\n\t\t\t\t(A) Students are obligated to \r\n1)\tpresent course units as assigned with annotated handouts. (40 mins)\r\n2)\tserve as commentators on student colleagues’ presentation\r\n3)\ttake tri-weekly business English vocabulary quizzes\r\n (B) During the semester, 1-2 guest speaker(s) will be invited to lecture particular business topics and share their expertise in their respective business practice (Schedule /Topic TBA)  \r\n(C) Students enrolled in this business class are encouraged to take another related course “Foreign Companies in Taiwan.” (see NTUT Courses 2009) \r\n\r\nGrading Policy:\t1) Final Exams 20%\r\n\t\t\t\t2) Presentation 20%\r\n\t\t\t\t3) Business quizzes (5 quizzes) 30%\r\n\t\t\t\t4) Attendance  30%\t\r\nLeaves and Absences: \t1) Any AWOL will result in the penalty of 10% semester grade deduction.\r\n\t\t\t\t  \t2) Penalty-waiver can be granted for any absence w/ official document at the \r\n\t\t\t\t\t   \t instructor’s discretion. It is only limited for one time in the entire semester. \r\nShould there be any major incidents and issues, special considerations will be given after thorough discussion with the student(s) and the class advisor(s). \r\n3) Each lateness, after the instructor finishes the second-round roll call, will result in the penalty of 5% semester grade deduction. \r\nPresentation Guideline(s):\t1) Each presentation will be delivered by students as assigned. The time duration for each is 40-50 mins, which will be followed by the presentation commentators for another 10 mins. Both presenters and commentators need to work collaboratively prior to class delivery. \r\n\t2) All presentations will be delivered by PPT, and need to include the unit components assigned. Main emphasis needs to be contributed to the analysis of the unit case study. (See textbook)\r\n\t3) Each presentation group is responsible to provide a list of unit content vocabulary edited bilingually, which later will be tested. \r\n\t4) Both the draft and revised PPT files, and the unit vocabulary list need to be submitted on the compact disc to the instructor a week after the presentation.\r\n\r\nQuizzes & Tests:\t1) Each quiz comprises 2-3 parts: unit vocabulary & business concept vocabulary, and current business issues. \r\n2) Unit vocabulary will be prepared by student presenters. Business concept vocabulary by fields and disciplines will be introduced by the class instructor. \r\n3) Students will be assigned to read current business articles to update their business intelligence. \r\n\r\n\r\n", "materials": "Required Text:    (1)Business Results Advanced Oxford University Press, 2009 \r\n                (2) Compiled Handouts of Business Content Vocabulary \r\n(3) Selected business journal articles  \r\n", "foreignLanguageTextbooks": false}]