[{"name": "柯萊恩", "email": "kcline@ntut.edu.tw", "latestUpdate": "2009-09-29 12:05:04", "objective": "In this course we will introduce and develop skills and techniques necessary for the preparation of a research paper.  Students will read and discuss primary and secondary sources from Eastern and Western wisdom traditions and compose four short (3-5 page) papers and one medium length (5-8 page) essay based on these works.  Today, the first day of class, you will be given a primary text which will hopefully lead each of you into a differing (through sometimes intersecting) fields of investigation.  You should look at your initial text as a sort of clue in a larger mystery, for which, however, there is no single denouement.  Although your research Assignment must draw upon your primary text, it will be your responsibility to find more research materials--books, articles, films, interviews, musical compositions, poems, stories, works of art of all sorts--on your topic.  It will also be up to you to find an angle on your material: perhaps it will be a study of the culture, mythology, religion, or lifestyle from which your original source is drawn. Perhaps it will be a comparative work—examining beliefs from more than one culture.  As long as your final result includes the first text you selected in some significant manner, you will have accomplished the task I am assigning.", "schedule": "September 12\tIntroduction  ASSIGNMENT:  Journal Entry (JE) #1: Articulating your questions\r\n\r\nSeptember 19\t“The Western Way”  ASSIGNMENT: READ Matthews, pp. 2-14  JE #2\r\n\r\nSeptember 26\tDiscuss “Discuss Rules for Practices.  ASSIGNMENT: READ Matthews, \r\npp. 3-21  JE #3\r\n\r\nOctober 3 \tDiscuss “The Old Religion”  ASSIGNMENT: READ Matthews, pp. 22-42 JE#4  \r\n\r\nOctober 17\tVisualization/Contemplation/Meditation/Prayer  ASSIGNMENT: FINDING YOUR CLAN TOTEM  JE#5  (Other exercises may be substituted or performed optionally).\r\n\r\nOctober 24\tDraft MIDTERM PAPER (with three extra copies) DUE\r\n\r\nOctober 31\tMIDTERM PAPER DUE\r\n\t\tASSIGNMENT:  Read Matthews 106-128 JE#6\r\n\r\nNovember 7\tASSIGNMENT:  Read Matthews Attempt one or both of the practices 128-132.  JE#7\r\n\r\nNovember 14\tSYNCHRONICITY:  Read Jung Foreword on I Ching\r\n\t\tAssignment:  Consult the I Ching JE#8\r\n\r\nNovember 21\tPrepare for Presentations\r\n\r\nNovember 28\tGroup Presentations I\r\n \r\nDecember 5\tGroup Presentations II/ Discuss Final Paper\r\n\t\tAssignment:  Collect Together Everything Written So Far; Begin Writing Draft\r\n\r\nDecember 12\tIndividual Conferences I\r\n\r\nDecember 19\tIndividual Conferences II\r\n\r\nDecember 26\tDRAFT (WITH THREE EXTRA COPIES) OF FINAL PAPER DUE\r\n\r\nJanuary 2\tDRAFT (WITH THREE EXTRA COPIES) OF FINAL PAPER DUE\r\n\r\nJanuary 7\tFINAL PAPER DUE", "scorePolicy": "25% Midterm Paper\r\n25% Journal Writing\r\n25% Final Paper\r\n25% Participation and  Presentation", "materials": "　", "foreignLanguageTextbooks": false}]