[{"name": "楊韻華", "email": "yhyang@ntut.edu.tw", "latestUpdate": "2009-09-17 13:11:13", "objective": "本課程涵蓋的主題包含語音，句法，語意，心理語言，社會語言，語言學習等簡介，作為更進一步語言（母語／外語）學習，教學，研究的基礎。\r\nCourse Title:\t\tIntroduction to Linguistics\r\nCredit Hours:\t\t3\r\nInstructor’s Name:\tDr. Yun-Hua Yang\r\nContact E-Mail:\tyhyang@ntut.edu.tw\r\nTerm Offered:\t\tFall, 2009\r\nScheduled Class Hours: Thursday 1:10-4:00 P.M.\r\nOffice Hours:      By appointment\r\nRequired Texts:   Yule, G.. The Study of Language Cambridge University Press, 2006\r\nCourse Description:\tThe current course is designed to prepare English-major students with core knowledge of linguistics. A range of disciplines in linguistics studies will be introduced, including the origins of languages, morphology, syntax, semantics, pragmatics, discourse analysis, language acquisition and language variations.\r\nCourse Objectives:  At the successful conclusion of this course, students are expected to\r\n(1)\tunderstand fundamental concepts of core disciplines of linguistics\r\n(2)\tdevelop knowledge of language to analyze language phenomena\r\n(3)\tidentify and describe differences among languages by theories learned\r\n(4)\tanalyze meanings of language in pragmatic sense\r\n(5)\texplore language variations\r\nCourse Requirements:\r\n(1)\tAll students are required to use a copyrighted textbook. No photocopied edition will be accepted for use in class. It is important for students to be aware that legal action will potentially be sought by the publisher in the case of using an unauthorized duplicated text.\r\n(2)\tStudents are responsible for preparing annotated handouts as assigned. Handouts need to include:\r\ni.\tUnit Precis (at least 800 words) with translation\r\nii.\tDefinitions of key terms\r\niii.\tDefinitions / meanings of unfamiliar lexical items\r\niv.\tResearch Tasks (see textbook)\r\nHandouts are to be distributed to the class prior to the unit session except for the translation. An electronic file (on compact disc, not via email) of complete handouts will be due for submission in two weeks after the session. All submitted files need to comply with the format as instructed.\r\n(3)\tEach student will be given abundant opportunities to provide his/ her response toward the assigned reading content as the lectures proceed. Students must complete all readings assigned prior to the class session.\r\n(4)\tThe instructor will not assign additional readings. As Linguistics comprises a broad array of theories and studies, students who are highly interested in this field are strongly encouraged to consult the professor for further suggested readings.\r\n", "schedule": "Weekly Schedule\r\nWeek / Date\tContent Unit\r\nWk 1\tOrientation / Origins of language / Animals and human language\r\nWk 2\tDevelopment of writing / Sounds of language\r\nWk 3\tSound patterns of language / Words and word-formation processes\r\nWk 4\tReview / Morphology\r\nWk 5\tMorphology / Phrases and sentences: grammar\r\nWk 6\tSyntax / Semantics\r\nWk 7\tSemantics / Pragmatics\r\nWk 8\tPragmatics\r\nWk 9\tMidterm\r\nWk 10\tDiscourse analysis\r\nWk 11\tLanguage and the brain\r\nWk 12\tFirst language acquisition\r\nWk 13\tSecond language acquisition\r\nWk 14\tGestures and sign languages / Language history and change\r\nWk 15\tLanguage history and change / Language and regional variation\r\nWk 16\tLanguage and regional variation / Language and social variation\r\nWk 17\tLanguage and culture\r\nWk 18\tFinal Exam\r\n*Class schedule is subject to necessary modifications at the professor’s discretion.\r\n", "scorePolicy": "Evaluation Procedures & Grading System:\r\nFinal grades will be determined by a point system (X out of 100 total points). Students will be evaluated by their handout assignment, full-length text translation, in-class exams, and attendance.\r\n(1)\tAttendance 30 %\r\n(2)\tExams (Midterm & Final) 55 %\r\n(3)\tAssignment 15%\r\nAttendance:  Students are required to attend the class as scheduled.\r\n1) Any AWOL will result in the penalty of 10% semester grade deduction.\r\n2) Penalty-waiver can be granted for any absence w/ official document at the sole\r\ninstructor’s discretion. It is only limited for one time in the entire semester.\r\nShould there be any major incidents and issues under extreme circumstances, special considerations will be given after thorough discussion with the student(s) and the class advisor(s).\r\n3) Lateness to class: Any arrival to class after the instructor finishes the second-round roll call is considered lateness. Each lateness will, in effect, incur a grade penalty of 5% semester grade deduction.\r\n", "materials": "Required Texts:   Yule, G.. The Study of Language Cambridge University Press, 2006\r\n--------------------------------------------------------------\r\nHandout Assignment Format\r\nIntroduction to Linguistics: The Study of Language\r\nAnnotated Handout Prepared by\r\nSamantha Chen (97038923) Andrew Wang (97038933) Kelly Kuo (97028943)\r\nDistribution Date: Oct. 8, 2009\r\nElectronic File Submission Date: Oct. 22, 2009\r\n------------------------------------------------------------------------------------------------------------------------------------\r\nI. Unit Precis\r\nABCDEFGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGG\r\nGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGG\r\n本章節介紹語言的起源---------------------------------\r\nII. Definitions of Key Terms\r\n1. creole: a variety of a language that developed from a pidgin and is used as a first language by a population of native speakers 混語方言\r\n2. deep structure: --------------------------------------------------------------------------------------------------------------\r\nIII. Definitions / Meanings of Unfamiliar Lexical Items\r\n1. circumvent (v.) to go around; to bypass 迴避\r\nIV. Research Tasks\r\nA. What is the connection between ------------?\r\n   Analysis: \r\n\r\n", "foreignLanguageTextbooks": false}]