[{"name": "賀一平", "email": "ipho@ntut.edu.tw", "latestUpdate": "2009-08-10 00:16:30", "objective": "本課程之設計是用來發展現代各種英語教學法之理論與實務。", "schedule": "Week\t\t\t\t\tTopic\r\n1\tOrientation: An Overview of Language Teaching Approaches and Methods\r\n2\tThe Grammar-Translation Method; The Direct Method; The Audio-Lingual Method; Total Physical Response and the Natural Approach\r\n3\tCommunity Language Learning; Suggestopedia; The Silent Way\r\n4\tCommunicative Language Teaching for the Twenty-First Century\r\n5\tCooperative Language Learning; Tasked-Based Language Teaching; Content-Based Approach\r\n6\tWhole Language; Reader Response\r\n7\tTeaching by Principles: Cognitive, Socio-affective, Linguistic Principles\r\n8\tSecond Language Learning/Acquisition Theories\r\n9\tMid-Term Exam\r\n10\tApproaches to educational psychology: Behaviorism; Cognitive Psychology; Humanism; Social Interactionism; Constructivist View of Learning\r\n11\tTeaching Reading\r\n12\tTeaching Writing\r\n13\tTeaching Listening\r\n14\tTeaching Speaking\r\n15\tTeaching Grammar and Vocabulary\r\n16\tFocus on the Learner and the Learning Process; Strategies-Based Instruction\r\n17\tSyllabus Design\r\n18\tFinal Exam\r\n", "scorePolicy": "Journal Entries: 30%\r\nOral Presentations: 30%\r\nExaminations: 40%\r\n", "materials": "Brown, H. D. (2007). Teaching by principles: An interactive approach to language pedagogy. White Plains, NY: Pearson.\r\nLarsen-Freeman, D. (2000). Techniques and principles in language teaching.  Oxford: Oxford University Press.\r\nRichards, J. C., & Rodgers, T. S. (2001). Approaches and methods in language teaching.  New York: Cambridge University Press.\r\nBrown, H. D. (2007). Principles of language learning and teaching. White Plains, NY: Pearson.\r\nNunan, D. (1999). Second language teaching and learning.  Boston, MA: Heinle & Heinle.\r\nCelce-Murcia, M. (2001). Teaching English as a second or foreign language.  Boston, MA: Heinle & Heinle.\r\nHadley, A. O. (2001). Teaching language in context.  Boston, MA: Heinle & Heinle.\r\nCarter, R., & Nunan, D. (2001). The Cambridge guide to teaching English to speakers of other languages.  New York: Cambridge University Press.\r\nMitchell, R., & Myles, F. (1998). Second language learning theories.  New York: Oxford University Press.\r\nWilliams, M., & Burden, R. L. (1997). Psychology for language teachers: A social constructivist approach. New York, NY: Cambridge University Press.\r\nNunan, D. (2003). Practical English language teaching.  New York, NY: McGraw-Hill/Contemporary.\r\n", "foreignLanguageTextbooks": false}]