[{"name": "陳雅玫", "email": "ymchen@ntut.edu.tw", "latestUpdate": "2009-09-16 13:25:01", "objective": "This course aims (1) to familiarize students with English grammatical framework in relation to reading and writing, and (2) to develop students’ rhetorical awareness. A review of grammatical ideas at the advanced level is reinforced by correcting sentence errors and revising awkward usage of words or sentence structures as well as by doing lively grammar practice exercises. The main topics covered include various parts of speech, tense, clauses, reporting, conjunction, punctuation, and the relationship between grammar and context.", "schedule": "Week1    course introduction\r\nWeek 2   topics: tenses; the future \r\nWeek 3   topics: linking verbs, passives, questions\r\nWeek 4\ttopics: verb complementation ; modals and seminal-modals \r\nWeek 5   topic: reporting \r\nWeek 6   topics: nouns; pronouns, substitution and leaving out words\r\nWeek 7\ttopics: articles, determiners and quantifiers\r\nWeek 8   topic: prepositions\r\nWeek 9   Mid-term exam\r\nWeek 10  topics: adjectives and adverbs (1)\r\nWeek 11\ttopics: adjectives and adverbs (2)\r\nWeek 12  topics: relative clauses and other types of clause\r\nWeek 13  topics: adverbial clauses and conjunctions\r\nWeek 14  topic: organising information\r\nWeek 15  topics : dangling modifiers ; misplaced modifiers\r\nWeek 16\ttopics: illogical comparisons and mixed construction; punctuation; mechanics\r\nWeek 17  wrap-up\r\nWeek 18  Final exam\r\n\r\n", "scorePolicy": "1. attendance & participation: 15%\r\n2. quizzes: 20\r\n3. assignments: 20%\r\n4. mid-term exam: 20%\r\n5. final-exam: 25%\r\n", "materials": "Requirements & Rules:\r\n1. Please turn off your cell phone during the two-hour class period.\r\n\r\n2. Absence: Students are expected to attend the class ON TIME. \r\n(1) Being late for more than TWENTY minutes equals one hour unexcused absence. One hour UNEXCUSED absence results in 4 points deduction. \r\n(2) For an absence to be excused, students need to submit compelling evidence of the gravity or unforseeability of the event causing the absence within ONE WEEK. \r\n(3) Students missing more than EIGHT hours unexcused will have a fail.\r\n(4) Absence from a class is no excuse for not knowing the assignment and what has been discussed in that class. There will be NO MAKE-UP EXAM unless you have valid and official reasons for absence BEFOREHAND.\r\n\r\n3. Each student must complete all readings assigned prior to the class session. All assigned readings will be included in the in-class quizzes, mid-term exam and final exam. \r\n\r\n4. Assignments: \r\n(1) Assignments will be given periodically throughout the course. \r\n(2) All assignments must be submitted via e-mail by 5PM SATURDAY. For late assignments, 20% of the assignment mark will be deducted each day. Assignments more than THREE days late will not be accepted\r\n", "foreignLanguageTextbooks": false}]