[{"name": "柯萊恩", "email": "kcline@ntut.edu.tw", "latestUpdate": "2009-09-29 12:03:10", "objective": "We will begin our study with assorted short comic plays (examples of the “The Variety Theatre,” a kind of artistic slapstick) first presented by the Futurists, an Italian avant-garde group of the early 20th Century.  Next we will turn to examples of “Poet’s Theatre,” that is, short plays for voice, containing little or no physical action. Our major undertaking will be the play Woyengi  by Obotunde Ijimere, a play written by a Nigerian playwright in Africa in English.  This will present a marvelous opportunity to share Taiwanese and African cultures on that fundamental level of being which is so much part of the experience of enacting a play.  We will study the fundamental characteristics of dramatic form including plot, character, action, and setting, as well as the conventions of dramatic genres, specifically tragedy, comedy, and tragicomedy.  Our approach will be informed by the examination of drama as a specifically literary genre, studying the texts of the plays for their themes, historical contexts and uses of language. But drama--unlike fiction and poetry--is a mixed genre: the play is only partially realized when read on the page.  It must be performed.  Thus each student will be responsible for bringing about the enactment of short scenes from these two highly influential and deeply moving examples of modern western drama.  To this end, you will also receive instruction in basic acting techniques, including voice and intonation, character motivation and emotional layering, and stage movement.  All of this will come in quite handy if you intend to take the Literature and Film course next semester, but also will give you a greater appreciation for all dramatic forms you encounter, whether on television, film or the stage.  The course may be a bit of a challenge, but it is a great opportunity for you to study and learn from two masterpieces of the English language, and to discover the difference between writing done purely as a mode of elementary communication, and writing that is open-ended, provocative, dynamic, haunting, and relentless in its dis/solving of the puzzle of the Real.\r\n\r\n研讀戲劇作品，注重作品所反映的人文與社會環境的互動。上課方式以評析和討論為主，以加強口語表達能力及文學賞析能力，並以戲劇演練提升語言學習效果。", "schedule": "September 10\tINTRODUCTION: Marinetti’s Variety Theatre\r\n\t\tAssignment:  Memorize lines\r\n\r\nSeptember 17\tINTRODUCTION II: Marinetti’s Variety Theatre\r\n\t\tAssignment: Memorize lines, work on characterization through voice\r\n\r\nSeptember 24\tBasics of blocking\r\n\r\nOctober 1\tRun Throughs\r\n\r\nOctober 15\tRun Throughs with Sets\t\r\n\r\nOctober 22\tLunchtime Variety Theatre  (FORMAL GRADE #1)\r\n\r\nOctober 29\tRadio/Voice Theatre  Assignment:  Familiarize yourself with lines\r\n\r\nNovember 5\tRadio/Voice Theatre Blocking Run Through  (MIDTERM) Assignment: Read Woyengi  by Obotunde Ijimere\r\n\r\nNovember 12\t Discuss Woyengi.  Select Parts/Scenes  ASSIGNMENT:  Memorize Lines\r\n\r\nNovember 19\tBlocking I/Sets/Costuming\r\n\r\nNovember 26\tBlocking II/Sets/Costuming\r\n\r\nDecember 3\tRehearsal  (Mandatory for all students)\r\n\r\nDecember 9\tRehearsal  (Mandatory of all students)\r\n\r\nDecember 17\tRehearsal  (Mandatory of all students)\r\n\r\nDecember 24\tRehearsal  (Mandatory of all students)\r\n\r\nDecember 31\tDress Rehearsal  (ABSOLUTELY mandatory of all students)\r\n\r\nJanuary 7\tFinal Presentation  (ABSOLUTELY mandatory of all students)", "scorePolicy": "25%: midterm\r\n25%: final presentation\r\n25%: homework\r\n25%: participation in class discussions", "materials": "Assorted Futurist Texts\r\nShort Voice Plays (by Dylan Thomas and Samuel Beckett)\r\nWoyengi (by Obotunde Ijimere)", "foreignLanguageTextbooks": false}]