[{"name": "楊韻華", "email": "yhyang@ntut.edu.tw", "latestUpdate": "2009-09-21 09:27:24", "objective": "本課程藉由邀請專業經理人與同學們分享台灣在全球佈局的競爭力與競爭優勢，以及分析在外商公司與本土企業工作的文化差異，讓同學深刻瞭解自身在全球上的競爭力與需補強之處。\r\nCourse Title:\t\tInternational Forum Series: Foreign Companies in Taiwan \r\nCredit Hours:\t\t1\r\nInstructor’s Name:\tDr. Yun-Hua Yang\r\nOffice:\t\t\tIntegrated Technology Complex, Lecture Hall 2 \r\nContact E-Mail:\tyhyang@ntut.edu.tw\r\nTerm Offered:\t\tFall Semester, 2009\r\nScheduled Class Meeting: Thursday 6:30-9:00 PM (from 9/17 to 10/22) \r\nOffice Hours:      Monday to Friday by appointment \r\nRequired Text(s):   N/A\r\nCourse Description: This course aims to broaden students' views on a multitude of global concerns. Globalization is a reality and shaping a new identity, by which individuals and nations constructs their strength of empowerment. In this course, senior management professionals working in and for foreign companies in Taiwan will be invited to give a series of talks with emphasis on global strategies and competition at the level of their respective corporations and lines of professions. Students will be able to understand the essential differences of local and foreign businesses in the aspects of corporate cultures and credentials required to career development. At the conclusion of this course, students will obtain a clear view of how to enhance their strengths and professional capital for future global career needs.\r\nCourse Objectives:  At the successful conclusion of this course, students shall be able to \r\n(1)\tdemonstrate a thorough understanding of global views of business \r\n(2)\tunderstand the complexity of global business environment \r\n(3)\tidentify opportunities and benefits of participating in global cultural and economic activities\r\n(4)\tdevelop early awareness of global business competition and increase students’ own competitiveness \r\n(5)\tconsolidate all insights learned and inspired from invited speeches to formulate future career goal as a true global worker \r\nCourse requirements: \r\nEach student must fulfill the following requirements:   \r\n(1)\tStudents are required to attend all lectures; punctuality is prioritized. Lateness for twenty minutes (after 6:50 pm) is considered as an unexcused absence. \r\n(2)\tA brief reflection regarding each lecture is required for all students enrolled in this class. Reflection papers can be written in either Chinese or English. No word count is necessary. All papers need to be typed and submitted online. \r\n(3)\tStudents are invited to share with the class their ideas and opinions regarding the previous and current lecture(s). \r\n(4)\tParticipate in course activities and respond to questions in class discussion if necessary. \r\n", "schedule": "Wk1 Orientation\r\nWk 2 American Chamber of Commerce\r\nWk 3 NVIDIA\r\nWk 4 Pfizer\r\nWk 5 Citi Bank\r\nWk 6 IBM", "scorePolicy": "Grading:\r\nAssignment:\r\nFive lecture reflection papers 12% each \r\n\t60%\r\nAttendance (Each absence will result in a penalty of grade deduction of 10%.)\t40%\r\n*(The grading policy is subject to contingent alternations as the class proceeds.)\r\n\r\n", "materials": "N/A", "foreignLanguageTextbooks": false}]