[{"name": "施欣文", "email": "sharinschroeder@ntut.edu.tw", "latestUpdate": "2012-09-20 23:03:02", "objective": "In this course we will use a historical approach in order to analyze the intersection between high and popular culture. What is the purpose of popular culture? What differentiates music, art, and literature that become popular among the masses from works that do not? Who decides what popular culture is, and who decides what high culture is? We will pay particular attention to the ways in which popular culture becomes high culture and vice versa. We will analyze how similar stories recur across various time periods and geographic regions, how modernity affects our view of culture and art, and how stories change when told in different genres. Students will make presentations about aspects of popular culture that interest them, will participate in in-class writing, quizzes, and exams, and will write two formal reflection papers.", "schedule": "This syllabus is simplified. Full syllabus can be obtained from the instructor.\r\n\r\nWeek 1 What is Pop Culture?\r\n“Cull vs. Surrender”\r\nGeorge Orwell’s “Good Bad Books”\r\n\r\nWeek 2 Genre: the Novel\r\nCase Study: Jane Austen’s Northanger Abbey and Pride and Prejudice (Jane Austen in Pop Culture)\r\n\r\nWeek 3 Making Rules about Culture\r\nIn class-reading from Matthew Arnold’s Culture and Anarchy\r\nAssignments: Excerpts from Matthew Arnold’s Culture and Anarchy\tMao Zedong’s “Talks at the Yan’an Forum on Literature and Art”\r\n\r\nWeek 4 Gender Roles (Tragedies)\r\nCenter Stage (1992) Dir. Stanley Kwan. Perf. Maggie Cheung, Han Chin, and Tony Leung Ka Fai\t\r\n\r\nWeek 5 Gender Roles (Comedies)\r\nI Love Lucy\r\n\r\nWeek 6 Some Like it Hot (1959)\r\nDir. Billy Wilder. Perf. Marilyn Monroe, Tony Curtis, and Jack Lemmon. \r\n\r\nWeek 7 Word, Image, Tone\r\nGender and Music Videos\r\nFrom Gentlemen Prefer Blondes Madonna: “Material Girl” “Video Killed the Radio Star”\r\n\r\nWeek 8\r\nTurn in your paper, but there is no class today. Reflection Paper 1 due (600-800 words—About three pages)\r\n\r\nWeek 9 The Internet and Pop Culture\t\r\nPresentations\r\n\r\nWeek 10 The Hobbit (1937)\r\nSnow White and the Seven Dwarfs (1937)\tCh. 1–3, “An Unexpected Party,” “Roast Mutton,” “A Short Rest,” \r\n\r\nWeek 11 The Hobbit \r\n\r\nWeek 12 The Hobbit\r\n\r\nWeek 13 The Hobbit\r\nFrom Beowulf \r\nFrom T.S. Eliot’s “Tradition and the Individual Talent.”\r\n\r\nWeek 14 The Hobbit\r\nReviews of The Hobbit.\r\n\r\nWeek 15 Monsters\r\nThe Fellowship of the Ring (film—2001) (Tolkien’s The Fellowship of the Ring was published in 1954.)\r\nRead from Frankenstein (e-mailed section—14 pages) \r\n\r\nWeek 16 The Fellowship of the Ring (week 2)\t\r\n\r\nWeek 17 Pop Culture in Taiwan: Localized? Globalized? Both?\r\nPresentations\r\n\r\nWeek 18 Reflection Paper 2 due (3–4 pages) (750-1000 words)", "scorePolicy": "In-class Writing and Quizzes: 20%\r\nReflection Papers: 45%\r\nPresentations: 25%\r\nParticipation: 10%", "materials": "J. R. R. Tolkien’s The Hobbit (We will also go to see The Hobbit when the movie comes out.)\r\nCourse Packet and E-mailed readings (Please print these.)\r\nOther Readings, Films, TV, and Music TBA.", "foreignLanguageTextbooks": false}]