[{"name": "勞維俊", "email": "lolouis@graduate.hku.hk", "latestUpdate": "2012-09-12 19:38:30", "objective": "課程橫跨英國文學的歷史，由中世紀到現代， 選讀英國文學史中最經典、最耐讀、可讀性最高的作品。務求由社會背境、歷史脈絡、和哲學思潮各方面理解作品。目標除了對英國文學史，不同文類（詩、戲劇、小說）和文學技巧有較全面的認識外，更可以提升理解其他文學作品的能力。", "schedule": "Course Aims:\r\n\r\nThis course offers a directed sampling of a range of literary texts across the history of British literature, from the medieval to the modern period. Canonical works of different literary genres (poetry, drama, novel) will be discussed in relation to their social, historical and philosophical backgrounds. Upon completion of the course, participants should have a basic understanding of the history of British literature, and be able to identify their corresponding styles and literary devices, cultural and philosophical issues.\r\n\r\nCourse Outline: \r\n\r\n1. Introduction\t: overview and examples, selected poems from:\r\nBlake, ‘The Tyger’, ‘The Sick Rose’, ‘London’\r\nDickens, Bleak House (ch.1) \r\n\r\n2-3. Romantic poetry:\r\nKeats, ‘Ode to a Nightingale’, ‘Ode on a Grecian Urn’, ‘Ode to Autumn’, ‘Ode on Melancholy’. \r\nColeridge, ‘Kubla Khan, or, A Vision in a Dream. A Fragment’ and ‘The Rime of the Ancient Mariner’ \r\nWordsworth, ‘Lines Composed a Few Miles above Tintern Abbey,’ ‘There Was a Boy,’ and ‘Preface to the Lyrical Ballads’ (1802)\r\n\r\n4-5. Literature and the fantastic: \r\n* Robert Louis Stevenson, Strange Case of Dr Jekyll and Mr Hyde (1886) \r\n- Freud, ‘The “Uncanny”’\r\n\r\n6-8. Detailed study: Dickens’ Great Expectations (week 7: university holiday on 1 Nov) \r\n* Dickens, Great Expectations  (1860-1)\r\n- Dickens, Hard Times (ch.1)\r\n- Thomas Carlyle, Signs of the Times (extract)\r\n- Freud, Beyond the Pleasure Principle \r\n- Peter Brooks, Reading for the Plot\r\n\r\n9. Mid-term exam\r\n\r\n10-11. Elizabethan Renaissance theatre \r\n* Shakespeare, Macbeth (1607) \r\n- Sonnets (No. 30, 66, 116)\r\n\r\n12. Seventeenth-century poetry: \r\nAndrew Marvell, ‘An Horatian Ode upon Cromwell’s Return from Ireland,’ ‘To His coy Mistress,’ ‘The Garden,’ and ‘Upon Appleton House’ (extract)\r\n- John Donne\r\n- George Herbert \r\n- T.S. Eliot on Marvell\r\n\r\n13. Augustan poetry\r\n- Alexander Pope, Epistle to Dr Arbuthnot (1735) \r\n- Samuel Johnson, ‘The Vanity of Human Wishes: The Tenth Satire of Juvenal Imitated’ (1749) and ‘On the Death of Dr Robert Levet’\r\n\t\t\r\n14-15. Reading the Modernist poem\r\nT.S. Eliot, ‘The Waste Land’ (1922)\r\n- Shakespeare, The Tempest  (extract)\r\n- Dante, Inferno (Canto 1) and Purgatorio  (Canto 26)\r\n- Pound, ‘Cathay’ or ‘Station in a Station of a Metro’\r\n\r\n16-17. Postmodernist play\r\nSamuel Becket’s Endgame (1957)\r\n\r\n18. Final Essay due", "scorePolicy": "TTeaching Approach (tentative):\r\n\r\nThe students are expected to have read the required primary texts before the lecture. Classes will be in the form of lectures and tutorials (2-hour lecture and 1-hour tutorial per week). Assessments include tutorial participation, group presentation, mid-term test, and essay writing.\r\n\r\nAssessment: \r\n\r\nTutorial participation \t\t\t10%\r\nPresentation \t\t\t\t20%\r\nMid-term test\t\t\t\t30%\r\nFinal Essay\t\t\t\t40% (drafts 10%, final revision 30%)\r\n\r\nNOTE: Please make sure your works are original and contain no unacknowledged materials. Plagiarism is an offense in the academic field, and NTUT takes it very seriously. The minimum penalty for plagiarism is a straight Fail in the course and the case may be passed on to the university for record.", "materials": "Bibliography:\r\n\r\nPrimary Texts: (A reading pack of the materials except those marked with [*] will be provided in the first lecture)\r\n\r\nGreenblatt, Stephen and M. H. Abrams (eds).  The Norton Anthology of English \tLiterature (2 vols.). New York: W. W. Norton, 2006.\r\n\r\n* Dickens, Charles. Great Expectations. Oxford: Oxford University Press, 2008. (The Penguin edition is also fine) \r\n* Shakespeare. Macbeth (Arden Shakespeare). Ed. Kenneth Muir. London: Arden, 2005. Or Shakespeare. Macbeth. Ed. Nichokas Brooke. Oxford: Oxford University Press, 1990. ISBN: 9780199535835\r\n* Stevenson, Robert Louis. Strange Case of Dr Jekyll and Mr Hyde and Other Tales. Oxford: Oxford University Press, 2008. ISBN: 0199536228. Or Stevenson. Strange Case of Dr Jekyll and Mr Hyde. Ed. Katherine Linehan. London: W.W. Norton, 2003. ISBN: 9789393974652\r\n\r\nBeckett, Samuel. Endgame. London: faber and faber, 1958 \r\nBlake, William. The Complete Writings of William Blake. Ed. Geoffrey Keynes. London: Oxford University Press, 1966.\r\nDonne, John. The Complete English Poems. London: Everyman’s Library, 1991. ISBN: 0781857150056.\r\nEliot, T.S. ‘The Waste Land’ in Collected Poems 1909-1962. London: Faber and Faber. ISBN: 9780571105489 \r\nKeats, John. The Major Works (including ‘Endymion’ and selected letters). Ed. Elizabeth Cook. Oxford: Oxford University Press, 2001.\r\nMilton, John. The Major Works (including ‘Paradise Lost’). Ed. Stephen Orgel and Jonathan Goldberg. Oxford: Oxford University Press, 2003.\r\nWordsworth, William. Selected Poetry of William Wordsworth. Ed. Mark van Doren. New York: The Modern Library, 2001.\r\n\r\nReferences:\r\n\r\nBell, Arthur H. and Bernard D. N. Grebanier. English Literature (3 vols.: The Beginnings to 1800, 1800-1900, and 1900 to the Present). New York: Barron’s Educational Series, 1994.\r\nHulme, Peter. Colonial Encounters: Europe and the Native Caribbean, 1492-1797. London: Methuen, 1986. (On Daniel Defoe’s Robinson Crusoe)\r\nMayhead, Robin. John Keats. Cambridge: Cambridge University Press, 1967. (A good introduction to Keats’ Odes)\r\nSanders, Wilbur. John Donne's Poetry. Cambridge: Cambridge University Press, 1971. ISBN: 0521079683\r\nTambling, Jeremy. Re: Verse: Turning Towards Poetry. London: Longman, 2007. (On poetry in general, and on some of the poems discussed in this course)\r\nWatt, Ian. The Rise of the Novel. Harmondsworth: Penguin, 1963. (Ch.3 discusses Robinson Crusoe, individualism and the novel as a literary form.)", "foreignLanguageTextbooks": false}]