[{"name": "柯萊恩", "email": "kcline@ntut.edu.tw", "latestUpdate": "2012-09-17 14:29:25", "objective": "To communicate sensibly in an academic environment, certain conventions of arisen.  Many such conventions are actually flexible; one does well to flow them unless there is some reason not to.  Of all the conventions in academic written discourse, however, one remains recalcitrant.  IT will be followed or your paper just sort of naturally sinks to the bottom of the swimming pool to drown.  It has no mooring, is fundamentally disconnected from the main.  The “main” being the world of ideas in which we are training you to communicate.  To communicate intelligibly on a college level you must demonstrate a command of the ideas with which shape your thesis.  Since only a few of the ideas in your essay will be, strictly speaking, your own invention, you must (indeed it is your sacred duty to) honestly inform your reader which ideas come from what source.  If you do not inform the reader of the origin of an idea that comes from an outside source, it does not matter the quality of your work in other ways, it is a an embarrassing failure.  It is a slap in the face of true scholarship.  So the typical college-level research paper, thesis or dissertation will contain a multitude of quotations, all with transition connecting together your own ideas and observations, presumably proving a case if that is what you are arguing or deepening meaning if you’re exploring an aesthetic, literary or philosophical idea.  But all of these quotatations, paraphrases and summaries mustneeds have a system of categorization to make it easier for the reader to understand and evaluate the source-material being used.  For this reason, a few, common systems for documenting sources emerged.  In our course we will study one of the two most popular forms of in-text citation, foot-note notation and bibliography reference.  It is called the MLA format, after the Modern Language Association.  The MLA is the form of reference most commonly used for writing in the humanities, while the APA (which you have already learned or will learn the second half of the semester) is most suited for the Social Science.  But you must be consistent in your choice.  Only MLA shall be used or only APA should be used.  In this course we will use only MLA.", "schedule": "COURSE SCHEDULE I\r\n\r\n \r\nSeptember 17\tIntroduction  ASSIGNMENT:  LOCATE AT LEAST ONE SOURCE (EITHER A BOOK, A COMPLETE PDF FILE FROM COMPUTER. OR A JOURNAL ARTICLE.  Make sure you include all the information you will need to make a standard MLA reference.)\r\n\r\nSeptember 24\tQUOTATION  (IN-TEXT CITATIONS)\r\n\r\nOctober 1\tSUMMARY  (IN-TEXT CITATIONS)\r\n\r\nOctober 8 \t PARAPHRASE  (IN-TEXT CITATIONS)\r\n\r\nOctober 15\tWORKS CITED PAGE\r\n\r\nOctober 22\tSTUDENT PRESENTATIONS I\r\n\r\nOctober 29\tSTUDENT PRESENTATION II\r\n\r\nNovember 5\tSTUDENT PRESENTATION III.   DUE:  FINAL ASSIGNMENT (one-two pages containing examples of quotation, paraphrase and summary employing standard MLA format) \r\n\r\n\r\nCOURSE SCHEDULE II\r\n\r\nNovember 12\tIntroduction  ASSIGNMENT:  LOCATE AT LEAST ONE SOURCE (EITHER A BOOK, A COMPLETE PDF FILE FROM COMPUTER. OR A JOURNAL ARTICLE.  Make sure you include all the information you will need to make a standard MLA reference.)\r\n\r\nNovember 19\t  QUOTATION  (IN-TEXT CITATIONS)\r\n\r\nNovember 26\tSUMMARY  (IN-TEXT CITATIONS)\r\n \r\nDecember 3\t PARAPHRASE  (IN-TEXT CITATIONS)\r\n\t\t\r\nDecember 10\tWORKS CITED PAGE\r\n\r\nDecember 24\tSTUDENT PRESENTATIONS I\r\n\r\nDecember 31\tHOLIDAY\r\n\r\nJanuary 7\tSTUDENT PRESENTATIONS II\r\n\r\nJanuary 9\tSTUDENT PRESENTATION III.   DUE:  FINAL ASSIGNMENT (One-two pages containing examples of quotation, paraphrase and summary employing standard MLA format)", "scorePolicy": "QUESTION 1.  (25 points maximum)  You are reading a book by Arthur I. Miller entitled “Dephiphering the Cosmic Number,” and. fascinated, you wish to draw from some of the theoretical material contained within.   You quote from the work and use proper MLA citation but now wish to place it on your Works Cited list.  You look at the book.  On the title page, underneath the title and author, there are the words:\r\nW.W. Norton & Company     New York     London\r\nOn the copyright page (the reverse side of title page) we read:\r\n\t\t\tCopyright © 2009 by Arthur I. Miller\r\n\t\t\tAll rights reserved.\r\n\t\t\tFirst Edition.\r\n\r\n\t\t\tManufacturing by R. R. Donnelley Harrisonburg\r\n\t\t\tBook design by Margaret M. Wagner\r\n\t\t\tProduction manager:  Julia Druskin\r\n\r\nBased on the above information, and using the proper MLA format, write out the most straightforward bibliographic entry which might appear on a standard MLA Works Cited page.  Please print clearly as this must be EXACT.  \r\n\r\n\r\n\r\n\r\nFIVE BONUS POINTS:  Can you spot the single punctuation error I have made in the in question above?  How should I have punctuated that passage?\r\n\r\nQUESTION 2.  (25 points maximum) You have just finished viewing and taking notes on the film Hugo, directed by Martin Scorsese.  You want to be able to paraphrase scenes, quote from dialogue, and summarize swaths of action.  A quick check of the credits at the end tell you that the film was produced by Martin Scorsese and Johnny Depp; the screenplay is by John Logan based on the book “The Invention of Hugo Cabret” by Brian Selznick.  The studio is listed as G.K. Films, and the date of distribution November 23, 2011.\r\n\r\nBased on the above information, and using the proper MLA format, write out the most straightforward bibliographic entry which might appear on a standard MLA Works Cited page.  Please print clearly as this must be EXACT.  \r\n\r\n\r\n\r\nFIVE BONUS POINTS:  Can you spot the single punctuation error I have made in the in question above?  How should I have punctuated that passage?", "materials": "　", "foreignLanguageTextbooks": false}]