[{"name": "施欣文", "email": "sharinschroeder@ntut.edu.tw", "latestUpdate": "2012-09-20 23:14:27", "objective": "This course will help you organize and present your ideas in clear, fluent, logical paragraphs. Students will learn to analyze their own voice, style, and word choice with the goal of becoming more creative at the same time as they learn to write more clearly. We will workshop papers in small groups and as a class, helping students analyze their own and other students’ writing. Each week will also involve a review of important grammatical points.", "schedule": "This is simplified. Obtain original from instructor.\r\n\r\nWeek 1\t“The Writing Process”\r\nWeek 2\t“Pre-writing Techniques”, “Ten Tips on How to Write Less Badly”\r\nWeek 3\tRevision of first-day freewrite\r\nWeek 4\tFrom Narrative of the Life of Frederick Douglass\r\nWeek 5\tThe Lead \r\nWeek 6\t“Finding a Voice and Style”\r\nWeek 7\tForming Main Body Ideas; Paragraph Development I\r\nWeek 8\tParagraph Development II \r\nWeek 9\tThe Ending\r\nWeek 10\tLibrary Day\r\nWeek 11\tThey Say/I Say\r\nWeek 12\tOn Plagiarism—Case Studies; Academic Writing & MLA\r\nWeek 13\tRead the selected articles for your possible argument paper. \r\nWeek 14\tPersuasion, Sources, and Logic; Tolkien’s Letter; Lydia Maria Child’s Preface; From Martin Luther King’s “Letter from a Birmingham Jail.”\r\nWeek 15 Draft 1: Argument Essay. Meet with me\r\nWeek 16\tSignal Phrases; Peer Review\r\nWeek 17\tReview for Final\r\nWeek 18\tFinal—MLA citation and other class material will be covered", "scorePolicy": "Grade Percentages:\r\n\r\nFormal Papers: 50%\r\nQuizzes and Homework: 20%\r\nInformal Writing Assignments: 20%\r\nPeer Review Effort and General Class Participation: 10%", "materials": "TEXTS\r\n‧\tCourse Packet and/or e-mailed readings and handouts. Please print these. \r\n\r\nSUPPLIES\r\n‧\tA journal, pens, and loose-leaf paper for in-class writing and quizzes\r\n‧\tA dry-erase marker and a cleaning cloth\r\n‧\tA pocket folder in which to submit papers and drafts\r\n‧\tMoney, paper, and fresh ink cartridges for printing out or photocopying drafts and readings (Please always bring a copy of all readings with you to class). \r\n‧\tA binder in which to keep all your class readings (highly recommended)", "foreignLanguageTextbooks": false}]