[{"name": "柯萊恩", "email": "kcline@ntut.edu.tw", "latestUpdate": "2012-09-17 14:20:41", "objective": "In this course we will introduce and develop skills and techniques necessary for the preparation of a research paper.  Students will read and discuss primary and secondary sources from Eastern and Western wisdom traditions and compose four short (3-5 page) papers and one medium length (5-8 page) essay based on these works.  Today, the first day of class, you will be given a primary text which will hopefully lead each of you into a differing (through sometimes intersecting) fields of investigation.  You should look at your initial text as a sort of clue in a larger mystery, for which, however, there is no single denouement.  Although your research Assignment must draw upon your primary text, it will be your responsibility to find more research materials--books, articles, films, interviews, musical compositions, poems, stories, works of art of all sorts--on your topic.  It will also be up to you to find an angle on your material: perhaps it will be a study of the culture, mythology, religion, or lifestyle from which your original source is drawn. Perhaps it will be a comparative work—examining beliefs from more than one culture.  As long as your final result includes the first text you selected in some significant manner, you will have accomplished the task I am assigning.", "schedule": "COURSE SCHEDULE\r\n\r\nAll assignments are due next class session unless otherwise indicated.  For complete details of formal writing assignments and informal writing tasks (journal entries), please see appropriate writing assignment or journal entry schedule.\r\n\r\nSeptember 19\tIntroduction  ASSIGNMENT:  Journal Entry (JE) #1: Articulating your questions\r\n\r\nSeptember 26\tDiscussion of primary texts.  \r\n\r\nOctober 3\tDiscuss Secondary Texts.  ASSIGNMENT: JE #2\r\n\r\nOctober 10 \t Evaluating and discriminating between primary and secondary texts.\r\n\r\nOctober 17\tQuestions and comments.  Draft Preliminary Midterm Paper (BRING TO CLASS WITH ONE EXTRA COPY)\r\n\r\nOctober 24\tDISCUSS PRELIMINARY MIDTERM PAPER ASSIGNMENT:  DRAFT FINAL MIDTERM PAPER (with three extra copies)\r\n\r\nOctober 31\tPEER EVALUATION OF MIDTERM PAPER (with three extra copies)\r\n\r\nNovember 7\tMIDTERM PAPER DUE  ASSIGNMENT: JE #3\r\n\r\nNovember 14\tSynthesizing your research findings\r\n\r\nNovember 21\tFinding an Angle  ASSIGNMENT: JE#4  \r\n\r\nNovember 28\tSpeculation and Enlargement.  Prepare for Group Presentations.\r\n \r\nDecember 5\tGroup Presentations \r\n\t\t\r\nDecember 12\tGroup Presentations\r\n\r\nDecember 19\tGroup Presentations.   Assignment:  Begin Writing Final Draft\r\n\r\nDecember 26\tDISCUSSION OF FINAL DRAFT\r\n\r\nJanuary 2\tDRAFT (WITH THREE EXTRA COPIES) OF FINAL PAPER DUE\r\n\r\nJanuary 9\tDRAFT (WITH THREE EXTRA COPIES) OF FINAL PAPER DUE", "scorePolicy": "STUDENT RESPONSIBILITIES\r\n\r\n1) Peer Evaluation.  A significant portion of the class will be given over to peer evaluation of essays.  The purpose of this is at least threefold:  1) to offer student writers criticism from peers, so that they may improve their work; 2) to cause each class member to articulate his or her critical concerns; and 3) to encourage the formation of a community of writers.  For peer evaluation you must be prepared to make multiple copies of your written work for other students in the class, AND YOU MUST BRING YOUR WORK AND THREE COPIES IN TO CLASS ON THE DAY THEY ARE DUE.  All peer evaluation activities--not only your having your paper evaluated, but also your active, cheerful participation in the critique of essays by your fellow classmates—are absolutely mandatory and count towards participation points in the class that cannot be made up.\r\n\r\n2)  Journals.  Students must keep a journal on an ongoing basis containing responses to the works they are examining and share these writings with the rest of the class.  The essays that you write will be drawn from these journal entries.  To receive full credit, you must bring your journal entry to class with one additional copy (for the instructor) and read it aloud on the day that it is due.  I will not accept late or e-mailed journal entries or writing assignments.\r\n\r\n3) Presentations.  Students will give two oral presentations in concert with two or three classmates.  Preparation of these presentations will lead to development and refinement of your final essay topic, and will provide a meaningful context for discussion in the class.\r\n\r\n4)  Attendance.  Frequent attendance is mandatory.  After your first two absences, each subsequent unexcused absence will cause your final grade to be reduced by one grade point.  If you are absent, it is your responsibility to find out the substance of class discussions and to make up homework.  \r\n\r\n5)  Anyone caught plagiarizing will receive a failing grade in the course.  All outside sources that you use in the production of your papers must be properly attributed using the MLA format.\r\n\r\nGRADING\r\n\r\n25%\tMidterm Paper\r\n25%\tJournal Writing\r\n25%\tFinal Paper\r\n25%\tParticipation and Presentation", "materials": "RESEARCH\r\n\r\n“RE-SEARCH N. [MF RECHERCHE fr. RECHERCHER to go about seeking] Studious inquiry or examination: esp : investigation or experimentation aimed at the discovery and interpretation of facts, revision of accepted theories or laws in the light of new facts, or practical application of such new theories or laws.” (Merriam-Webster’s Collegiate Dictionary, Eleventh Edition)\r\n\r\nBy “STUDIOUS INQUIRY OR EXAMINATION” we mean a full and careful reading and synthesis of any and all texts and other media of a scholarly nature available to you in relation to a certain topic.  Such a synthesis is made possible by a process of writing, ranging from marking key passages in the text or texts under examination, to making note of such passages (replete with MLA citation information) in a written journal along with incidental ideas or your own or those drawn from other studies—whether or not directly related to your source text(s)—the incorporation of your journal records and speculations within short, informal papers which (to the accompaniment of in-class and written feedback) you will share with both class and instructor. As this process continues it will fall upon you to further draw upon these informal journal writings to compose a series of drafts of increasing complexity [or in some cases simplicity] (of thesis idea, source materials, development of content, word choice and writing style).  These drafts will be formally evaluated by peer groups of three of four students before they are handed in to me to receive a final grade.\r\n \r\n“INVESTIGATION” is the first and foremost activity of a successful research project.  Here, great care must be taken to select a topic worthy of your careful and continued scrutiny.  You must be willing to look beneath the surface of, say, a Wikipedia article, and to trace your topic back to its original source.  This should be accomplished without the uncriticized interpolation (much less uncited usage) of secondary or tertiary articles, but should demonstrate to one degree or another the actual reading and apprehension of the originary source text(s).  Still, if you were simply to paraphrase an original source text (say a novel or philosophical passage from Plato) without reference to the critical views available in secondary texts, this would also bring into question the scholarly depth of your research effort.  This is where “interpretation” enters into the equation.\r\n\r\n“INTERPRETATION” involves the synthesis of primary and secondary texts in an original, meaningful way.  Your interpretation may favor one critical opinion over another, but it must give every critical opinion its due, and maintain a healthy, critical skepticism of every opinion encountered.  Secondary critical opinions should not be used without laying the proper groundwork (through quotation, paraphrase and summary) of the original text(s).  In other words, secondary critical opinions are only valuable insofar as they illuminate some essential or recondite idea in the original source, which in turn is only valuable insofar as it illuminates some grander idea of your own.\r\n\r\nThe entire research endeavor then is a process of “DISCOVERY.”  Discovery means finding out something new, not to just to yourself (although this may at times be sufficient) but to the world of ideas of which your research project is but one small part.  This may sound a tall order but it is important to remember that the discovery for which you are headed is implicitly UKNOWN to you at the outset of your project.  If you already know what you will discover at the outset your voyage toward discovery is redundant. Your “DISCOVERY,” (what you have discovered through the process of exploration/research), is ultimately your thesis idea.  \r\n\r\nCuriously, however, rhetorical rules dating from the ancient Romans state that your finished essay must begin with its thesis idea.  The paradox of having to begin with an idea you only discover at the end of your writing process is only reconcilable if you allow for the intermediary", "foreignLanguageTextbooks": false}]