[{"name": "周素鳳", "email": "sfchou@ntut.edu.tw", "latestUpdate": "2012-09-13 19:52:54", "objective": "This course aims to enhance students' English competence through reading and discussion on topics revolving around education, relationships, entertainment, and social media.  The texts include articles from newspapers and magazines as well as excerpts from popular books. Special emphasis will be put on content analysis, text summarization, and critical comprehension skills such as identifying the main ideas and supporting details, recognizing context clues, drawing inferences and making critical judgments. Supplementary readings, selected chapters from Justice: What’s the Right Thing to Do?( by Michael Sandel, 2009) The World is Flat (by Thomas L. Friedman, 2007) and How Will You Measure Your Life (by Clayton M. Christensen , 2012), are assigned to be independent study projects. The class format will combine lecture, small-group discussion and presentation.", "schedule": "9/17\t Introduction & Warm-up\r\n\t\r\n9/24   “I Think, Therefore IM” /\t  Justice (pp. 21-24)\r\n10/1\t   “A Year of Sleepless Nights”\t/   Justice(pp. 24~30): Group 1\r\n10/8\t   “A Required Course in Beating the Freshman Blues” /  How will You measure Your Life (pp. 9~17): Group 2 \r\n10/15    How will You measure Your Life (pp. 25-41): Group 3.4\r\n10/22   “History 101: Pass the Popcorn Please”/ How will You measure Your Life (pp. 42~59):Group 5.6\r\n10/29\tRetargeting Ads Follow Surfers to Other Sites / Justice (pp. 166~183): Group 7& 8\r\n11/5\t         Review\r\n11/12\tMidterm Exam\t\r\n11/19\t“He’s Not That into You”\t/The World is Flat (pp. 3~12)\r\n11/26\t“What I’ve Learned from Men” /The World is Flat (pp. 12~21)\r\n12/3\t   “Baby Battle”/ The World is Flat (pp. 21~31)     \r\n12/10\t“Posteverything Generation”/\tThe World is Flat (pp. 31~40)\r\n12/17\t  \"Posteverything Generation\"/ The World is Flat (pp. 40~50)\r\n12/24\t“Meet the Beatles, Again”\t/The World is Flat (pp. 607~616)\r\n12/31\t“Why We Crave Horror Movies”/ The World is Flat (pp. 616~626) / The World is Flat (pp. 626~635)\r\n1/7\tReview\t\r\n1/14\tFinal Exam", "scorePolicy": "Grading Scale: \r\n1. Midterm Exam: 25% \r\n2. Final Exam: 25 %\r\n3. Reading Portfolio: 20%\r\n4. In-class activities+ Quizzes: 30%", "materials": "Requirements:\r\n1.Regular attendance is required to pass this course.  3 unexcused absences from class will result in failing this course.  One unexcused absence will result in an automatic final score reduction of 2 points.  \r\n\r\n2. Students will be given quizzes, announced or unannounced, on the reading texts. In-class group discussions and writing will be included to develop students’ critical thinking skills. If you miss any of the quizzes or fail to finish the group activity by the end of the class, there is no way to make it up (no exceptions).  However, your two lowest scores will be dropped—so, save these for those unexpected occasions when you might be sick or miss class for other reasons.\r\n\r\n3. Selections of the supplementary readings are designed as a self-study reading assignment. The whole class will be divided into 8 groups with 3 students in each group.  Every week, 1-2 groups will be well-prepared for oral presentation on the assigned reading. The task for each group-member includes (1) a brief summary of the section assigned; (2) a review on selected words and expressions; (3) comments or reflections on significant passages or sentences; (4) questions for classmates.\r\n\r\n4. Each student should keep a Reading Portfolio on the supplementary readings. Your reading portfolio includes at least 6 Summary entries and 12 pages of Handwritten Notes on useful expressions or your reflection on any of the passages encountered while reading.", "foreignLanguageTextbooks": false}]