[{"name": "楊景德", "email": "jyang@ntut.edu.tw", "latestUpdate": "2013-10-23 10:37:38", "objective": "This course is designed for student who is not disciplined in philosophy. As an introduction, we begin at the origin of western philosophy, the philosophical questions and finally, the relationship of human life and philosophy. Philosophy takes place when human being thinking of himself. Man by nature desire to know himself as well as the external world. And due to this love of wisdom, men can be critical to knowledge and be passionate toward truth. Eventually, grasping the sprit of western philosophy , we can view our life in quite a different view. In our time, facing the world of international, we should better understand the western culture, which is rooted in philosophy.", "schedule": "Weeks    Contents of instruction  Text chapter\r\n1\tIntroduction of the course\r\n2\tChapter one of Nagel's book: Introduction \r\n3        Chapter two: How do we know anything?\r\n4\tChapter three: Other minds \r\n5-6      Chapter four: The mind-body problem   \r\n7\tChapter Five :The meaning of words  \r\n8        Mid-term exam week\r\n9\tChapter Six: Free will \r\n10\tChapter Seven : Right & wrong\r\n11\tChapter 8 & 9 : Justice and Death\r\n12\tIntroduction to Paulos' book\r\n13\tChapter One: Two unlikely pairs of men\r\n14\tChapter Two: Logic\r\n15\tChapter Three: Science\r\n16\tChapter Four: People\r\n17\tConclusion\r\n18\tFinal exam", "scorePolicy": "Final exam：80%\r\nGeneral performance(based on attendance rates and performance at the class)：20%", "materials": "1. Thomas Nagel, What Does It All Mean ?-A very short introduction to philosophy. The Eurasian Publishing Group, 2002。\r\n2.John Allen Paulos,I Think, Therefore I Laugh：The Flip Side of Philosophy.  Columbia University Press, 2000.\r\n3. Complimentary work: BBC： The Human Mind The Complete Series (DVD Video, 2004 and films from Discovery、NHK。", "foreignLanguageTextbooks": false}]