[{"name": "郭佳雯", "email": "98551503@nccu.edu.tw", "latestUpdate": "2019-09-26 10:33:27", "objective": "課程概述：\r\n本課程大致收錄時代雜誌與英國衛報的社論與新聞篇幅來細查探討身體政治。身體政治的定義略說來，為個體與社會，甚至國族之間的互動，以及社會、文化與國族對個體身體使用的干涉與箝制。\r\n\r\nBasically we will discuss “body politics” from the news coverage as well as columns from TIME magazine and England’s long-established newspaper The Guardian. As far as the term “body politics” is concerned, the interactions between the individual, society and culture are highly valued. Here we will talk about the controls and restraints society/nation/culture has on the individuals. In addition to the weekly lectures, we expect students to participate in the class discussion. We aim to develop students’ ability to express themselves fluently in English on numerous issues. Furthermore, we encourage students to pay attention to the happenings around the world in order to be an independent thinker in the international domain.\r\n\r\n課程目標：\r\n本課程教學採講授兼同學互動討論的方式，預期使同學增加討論重要時事的片語與詞彙，栽培同學有固定關懷世界新聞的習慣，藉此增進英文能力，並與全球化接軌，加深獨立思考的能力。", "schedule": "課 程 進 度\r\n\r\n單元主題與教材安排\r\n\r\n課程介紹: 何謂身體政治? (Body Politics)\r\n何謂國際觀? (Global Citizenship)\r\n\r\n過重的身體\r\n“The ‘Dear Fat People’ video is tired, cruel and lazy – but I still fight for the woman who made it”\r\n\r\n– The Guardian 英國衛報社論\r\n\r\n厭食的身體\r\n“France Criminalizes ‘Thinspiration’ Websites Promoting Anorexia, Thigh Gaps”\r\n\r\n– International Business Times 國際商業時代報導\r\n\r\n厭女與暴力: 肢解的女體\r\n“Black Dahlia Murder Case Hits 68 Years Unsolved”\r\n\r\n– Time 時代雜誌報導\r\n\r\n國族與女職: 中國女性健身文化\r\n“Why China’s ‘fat’ women refuse to sweat it out in the gym”\r\n\r\n– The Telegraph 英國郵報社論\r\n\r\n未來生殖主義: 精子銀行與基因學\r\n“Designer babies? It looks like racism and eugenics to me”\r\n\r\n– The Guardian 英國衛報社論\r\n\r\n性別平權: 男女廁所的爭議\r\n“The Everyday Sexism of Women Waiting in Public Toilet Lines”\r\n\r\n– Time 時代雜誌社論\r\n\r\n女性生殖/墮胎權討論\r\n“Pregnant Suicidal Woman Denied an Abortion in Ireland”\r\n\r\n– Cosmopolitan 柯蘭夢丹社論\r\n\r\n男性自殺率\r\n“Austerity a factor in rising suicide rate among UK men”\r\n\r\n– The Guardian 英國衛報社論\r\n\r\n網路的身體 “Psychology of Ghosting”\r\n– Psychology Today 今日心理學摘錄\r\n\r\n人工智慧與未來主義\r\n“Artificial intelligence, automated surgeons and cyborg sex dolls: will robots become part of London life?”\r\n\r\n–Evening Standard 英國民粹晚報社論\r\n\r\n塑膠的身體: 後人類社會\r\n“Should we ban sex robots while we have the chance?”\r\n\r\n–          The Guardian 英國衛報社論\r\n\r\n跨文化整形現象\r\n“About Face: Why is South Korea the world’s plastic-surgery capital?”\r\n\r\n– The New Yorker  紐約客社論\r\n\r\n國族與女體: 穆斯林與面紗\r\n“Feminism, fashion and religion: Why Muslim women choose to wear the veil”\r\n\r\n– The Telegraph英國郵報社論\r\n\r\n身體的形象: 身體畸形恐懼症\r\n“The Ugly Truth about Body Dysmorphia”\r\n\r\n–          The Guardian 英國衛報社論\r\n\r\n兒童的身體: 飲食均衡與家長輔導\r\n“How should I tell my children they’re fat?”\r\n\r\n–          The Telegraph 英國郵報專欄\r\n\r\n殘缺的身體: 自我身體表現\r\n“Becoming disabled by choice, not chance: ‘Transabled’ people feel like imposters in their fully working bodies”\r\n\r\n–          National Post 美國國家郵報\r\n\r\n期末考Final Exam", "scorePolicy": "筆記 30%\r\n作業 30%\r\n期末考 40%", "materials": "www.bbc.com\r\n\r\nhttps://time.com/\r\n\r\nhttps://www.theguardian.com/international", "foreignLanguageTextbooks": true}]