[{"name": "李美慧", "email": "meihueili@yahoo.com.tw", "latestUpdate": "2019-06-20 18:19:31", "objective": "本課程主要目的為讓學生可以利用暑期或其它時間至學校認可之校外公私立機構進行或參與實習，以增進學生之實務能力。學生於學校認可之校外機構實習總累計時數不得低於320小時。學生實習期滿後，應依據各系規定繳交相關實習相關成果報告，彙交所屬系保存，並作為成績核定之依據。學生校外實習學期成績之評定比例原則：實習單位占50%，輔導老師占50%，各系得依其屬性調整之。\r\nThe main purpose of this course is to elevate an all-round ability for the students at NTUT. During the summer break　or other periods of time, students are required to go to government-based organizations or industry/business-oriented agencies with respect to promoting practice of ability. The course takers will need to stay in the same individual organization or agency with an accumulated amount of time of no less than 320 hours. After the students complete the requirements in question, these organizations and agencies will offer them certificates -- or proof of any kind -- in accordance with the real performance on site. The grading principle will be equivalently decided by the thesis advisor (50%) and the on-site organization or agency (50%), respectively. The individual department or graduate institute may make proper adjustments according to the situations in need.", "schedule": "依據國立臺北科技大學學生校外實習辦法\r\n大四上:校外實習相關表格繳交，確定天數與審核\r\n大一下:校外實習相關事項說明", "scorePolicy": "依據天數審核，及校外實習單位學習評量的分數", "materials": "無特定參考書目", "foreignLanguageTextbooks": false}]