[{"name": "施邦築", "email": "bjshih@ntut.edu.tw", "latestUpdate": "2019-05-29 13:41:58", "objective": "本課程除介紹土木工程的基本領域，如結構工程、大地工程、營建管理、生態與防災、水資源與水利工程、空間資訊、環境工程等外，亦強調環境生態、環境與人文等社會層面的議題，更著重於土木工程與環境的關係，期使未來在土木建設之際，亦能瞭解環境、尊重生態及朝永續利用的目標努力。另本課程亦強調訓練學生團隊合作、設計構想與動手實作能力，藉由課堂所學基本土木工程知識，利用簡易材料與設備再以電腦軟體輔助，自行構思、設計與製作土木結構或設備模型，及利用既有設備測試所設計之成品。\r\nIn this course, not only professional fields of civil engineering including structural engineering, geotechnical engineering, construction management, ecological engineering and disaster prevention, water resources and hydraulic engineering, and spatial information are introduced, but also environmental, ecological, societal, and cultural issues are emphasized. The most important point is focused on the relationship between civil engineering and environment such that students who take this course can understand environment, appreciate ecology, and pursue sustainable development when they are engaged in civil engineering construction in future. In addition, training of team works and ability to think, design, and carry out a plan by hand are emphasized. Students can plan, design, fabricate, and test a structural model using available material, equipment, and computer-aid software based on knowledge learned from fundamental civil engineering courses.", "schedule": "第一週\t課程說明、緒論、基本實作概念介紹\r\n第二週\t結構工程與環境\r\n第三週\t橋梁工程與環境\r\n第四週\t大地工程與環境、土木構造基本實作\r\n第五週\t大地工程與環境、土木構造基本實作\r\n第六週\t水資源工程與環境、土木構造基本實作\r\n第七週\t水資源工程與環境、土木構造基本實作\r\n第八週\t土木構造基本實作評論\r\n第九週\t期中考週\r\n第十週\t交通運輸與環境\r\n第十一週\t營建管理介紹、土木構造基本實作\r\n第十二週\t環境工程與管理介紹、土木構造基本實作\r\n第十三週\t生態工程介紹、土木構造基本實作\r\n第十四週\tGPS、GIS、RS在土木工程上的應用\r\n第十五週\t都市環境管理、土木構造基本實作\r\n第十六週\t全球氣候變遷與調適、土木構造基本實作\r\n第十七週\t土木構造基本實作評論\r\n第十八週\t期末考週", "scorePolicy": "1、\t平常成績（作業、點名、上課情形）15％\r\n作業：約八次\r\n點名：幾乎每次上課都點名\r\n出席率、上課參與討論的認真度\r\n2、\t期中考 25%\r\n3、\t期末考 25%\r\n4、\t基本實作：35%", "materials": "一、\t自編教材（網路學園可下載）\r\n二、\t土木工程概論 臺灣大學土木工程系主編，藝軒圖書出版社印行，ISBN 957-616-419-2\r\n三、\t土木與環境  中國土木水利工程學會編著，科技圖書出版，ISBN 957-655-399-7", "foreignLanguageTextbooks": false}]