[{"name": "林彥良", "email": "ericlin@ntut.edu.tw", "latestUpdate": "2019-06-03 00:30:46", "objective": "This course aims at providing students with the fundamental knowledge and competence that they will need in doing research and writing research papers.  Its main purpose is to familiarize students with methods, procedures, and techniques that are applicable to quantitative and qualitative research as well as to improve their ability to write research papers.  The main topics for instruction include: the research process; major research methods; and the structure of a research paper.  The research methods primarily studied include the experimental method, descriptive research, ethnography, case study, observation, survey research (questionnaire and interviews), content analysis/documentary analysis, and critical approaches to literature.", "schedule": "W1. Introduction to Research:\r\nDifferent types of research / What is a research paper? \r\nW2. Research Design:\r\nWhat makes a good research question? / Online resources\r\nW3. Data Collection & Coding: Audio- and video-recorded data, experiments, questionnaires & interviews, observation, etc. \r\nW4. Using Computers to Study Texts:\r\nCorpora & discourse analysis; compiling your own corpus\r\nW5. Analyzing Quantitative Data & Statistics\r\nW6. Analyzing Qualitative Data \r\nW7. APA Style & Citing Sources (Bullock, pp 170-207)\r\nW8. Project Presentation \r\nW9. Midterm", "scorePolicy": "Project Presentation (group presentation): 25%\r\nProject Report (group report): 25%\r\nMidterm: 30%\r\nParticipation, In-class Tasks & Assignments: 20%", "materials": "Bullock, R., Brody, M., & Weinberg, F. (2017). The little seagull handbook. New York: Norton. (Required, Available in the Taipei Tech bookstore)\r\nMackey, A., & Gass, S. M. (2015). Second language research: Methodology and design. New York: Routledge. (Available online)\r\nWray, A., & Bloomer, A. (2006). Projects in linguistics: A practical guide to researching language. London: Hodder Arnold. (Available online)", "foreignLanguageTextbooks": true}]