[{"name": "陳玉敏", "email": "yumchen@umail.iu.edu", "latestUpdate": "2019-08-29 04:42:56", "objective": "The goal of the course is to prepare students for a variety of public speaking situations and strengthen their ability in researching, outlining, and analyzing the audience in order to deliver effective short, informal presentations as well as longer speeches. In the class, students will learn to use verbal and nonverbal aids, and techniques of oral presentation and persuasion. Topics will include natural geography, climate changes, health, technology, politics, cultural conventions and perceptions of self and others. This course attempts to enhance students’ oral communication skills as a critical thinker and effective speaker. Attendance is mandatory as this is a practice-oriented course although theoretical methods will also be included. Students are expected to conduct presentations for every class as speaking clearly and comfortably in public is an essential skill.", "schedule": "Part One: Public Speaking in an Electronic World\r\n\r\nWeek 1: Introduction \r\nWeek 2: Speech and Higher Education: Apprehension (PP)\r\nWeek 3:  Social identity. (s) \r\nWeek 4:  Determining your purposes and central ideas (pp) \r\nWeek 5: Unit Five: Movement: The Panama Canal: A Brief History (s)        \r\nWeek 6: Introductory Speech / Peer Evaluation \r\nWeek 7: Critical listening and note taking (pp)\r\nWeek 8: Unit Five: Dangers and opportunities in the Arctic Circle (s)  \r\nWeek 9: Mid-term \r\nWeek 10: Public speaking, strategies for negotiating cultural differences(pp)Informative Speech \r\nWeek 11: Unit Three: Cognitive neuroscience, Emotional thinking (s)\r\nPart Two: Planning and Preparing your Speech\r\nWeek 12: Understanding your audience, analyze your audience (pp) \r\nWeek 13: Unit Four: The top five causes of Wildfire, Controlling the Uncontrollable (S)\r\nWeek 14: Finding and using supporting materials (pp)/ Persuasive Speech \t\r\nWeek 15: Unit Two: Beautifully Broken, Community Development/  (S)\r\nWeek 16: Organizing and outlining your speech (pp)\r\nWeek 17: Beginning and ending your speech/ Special Occasion Speech  (pp)\r\nWeek 18: Final YouTube Speech project", "scorePolicy": "Attendance/ Participation\t\t\t\t\t\r\nClass Presentations\t\t\t\t\t\t\t   \r\nIntroductory Speech                          \t\t\t  \r\nInformative Speech\t\t\t\t\t\t\t    \r\nPersuasive Speech\t\t\t\t\t\t\t   \r\nSpecial Occasion Speech\t\t\t\t\t   \r\nMid-term & Final", "materials": "‧\tRogers, Louis. Skillful 3.  London: Macmillan, 2018. (S)\r\n‧\tGerma, Kathleen. Principles of Public Speaking. Boston: Pearson, 2013.  (PP)", "foreignLanguageTextbooks": true}]