[{"name": "吳浴沂", "email": "cyywu@ntut.edu.tw", "latestUpdate": "2020-01-14 20:32:54", "objective": "車輛工程乃融合跨領域的科技，本課程從各個角度介紹車輛科技，幫助學生進入職場前作準備；而職場成敗與人生苦樂繫乎心靈之所向，本課程藉由認清自我來提升心靈層次，協助學生追求幸福快樂與探索自身潛能，並發展職場上所需要的品格道德、人際互動、服務利他的人格特質。課程內容有：車輛科技發展趨勢(環保、安全、智慧)，法規需求(安全、能耗、污染)，各項車輛科技介紹(節能低污染引擎、電動車、自駕車)；汽車產業，機車產業，電動車產業(機車、巴士、小客車)；職場需求、心靈環保、樂活人生。\r\nVehicle engineering contains interdisciplinary technologies. This course introduce vehicle technology with various directions for the students’ career planning before entering the workplace. By the way, the success in workplace and happy life depend on the spirit cultivation. By advising self-awareness to promote the students’ spirit, to help students pursuing happy and exploring their potential. And then, to develop the requirement in workplace, such as: moral character, interpersonal interaction, and social services. The contents of the course are: the trend of vehicle technology development, the regulation requirement, the introduction of various vehicle technologies, the industries of automobile and motorcycle, the requirement of workplace, the environmental protection of the mind, and happy life.", "schedule": "一、車輛科技\r\n車輛科技發展趨勢(環保、安全、智慧) (2W)，法規需求(安全、能耗、污染) (2W)，各項車輛科技介紹(節能低污染引擎、電動車、自駕車) (2W)。\r\n二、車輛產業概況\r\n汽車產業(1W)，機車產業(1W) ，電動車產業(機車、巴士、小客車) (3W)。\r\n三、職場發展\r\n職場需求(2W)、心靈環保(3W)、樂活人生(2W)。\r\n\r\n週次\t     各週主題\r\n1\t車輛科技發展趨勢(環保、安全、智慧)\r\n2\t車輛科技發展趨勢(環保、安全、智慧)\r\n3\t先進車輛科技(節能低污染引擎、電動車、自駕車)\r\n4\t邀請業師(謝豐吉博士)：先進車輛科技介紹 (10.02, 13:10-16:00)\r\n5\t車輛法規需求(安全、能耗、污染)\r\n6\t車輛法規需求(安全、能耗、污染)\r\n7\t汽車產業\r\n8\t機車產業\r\n9\t邀請業師(謝騰輝執行長)：車輛產業跨領域介紹(11.06, 13:10-16:00)\r\n10\t電動車產業(機車、巴士、小客車)\r\n11\t電動車產業(機車、巴士、小客車)\r\n12\t職場需求\r\n13\t職場需求\r\n14\t邀請業師(陳武雄博士)：提升心的生產力(12.11, 13:10-16:00)\r\n15\t心靈環保與樂活人生\r\n16\t期末報告\r\n17\t期末報告\r\n18\t期末考週放假", "scorePolicy": "報告：期中書面報告(30~50分)，期末口頭報告(30~50分)。書面報告只要有姓名學號2張圖片，口頭報告只要有上台報告3分鐘，至少各30分；抄襲或遲交以零分計。\r\n期中書面報告：「車輛科技心得報告」，第9週的週一繳交；23:59前用北科i學園網路繳交。\r\n期末口頭報告：「職場需求與心靈環保(感恩與快樂)心得報告」，第18週上課報告。\r\n書面報告只要有姓名學號至少2張圖片，口頭報告只要有上台講3分鐘，至少各30分；抄襲或遲交以零分計。\r\n*書面報告不限格式，使用Word檔，約1000字，可加圖片，1張圖或照片可抵100字。", "materials": "無", "foreignLanguageTextbooks": false}]