[{"name": "楊韻華", "email": "yhyang@ntut.edu.tw", "latestUpdate": "2016-09-12 08:46:02", "objective": "本課程旨在訓練學生公開表達之能力，內容包括語言表達基本原則與技巧、肢體語言與演講要領，備題演講及即席演講演練。\r\nDepartment of English, National Taipei University of Technology\r\nCourse Syllabus 2016\r\n\r\nCourse Title:\t\tPublic Speaking and Debates\r\nCredit Hours:\t\t2\r\nInstructor’s Name:\tDr. Yun-Hua Yang\r\nContact E-Mail:\tyhyang@ntut.edu.tw\r\nOffice: \t        General Education Building Rm.805 / Extension: 3941\r\nTerm Offered:\t\tFall, 2014\r\nCourse Description: \tThis course aims to establish the foundation for English-major students to deliver public speeches in English. Students learn to select topics, collect essential information, analyze the audience, organize materials, improve delivery skills, distinguish different types of speeches, and further to evaluate their own and others’ speeches. Each student is expected to deliver at least 4 individual speeches, and 2-3 debates. Speech topics will be assigned to students. Any modifications of the speech topics will have to be approved by the instructor. All student speech sessions must be videotaped.(*1)", "schedule": "2016 English Public Speaking and Debates                           Weekly Syllabus \r\nWeek/ Date \tCourse Content\tClass Activities\r\nWk1\tOrientation \r\n\tInstructor Lecture & Discussion \r\nWk2\tTrial Speech \t\r\nWk 3 \tGuidelines to Informative and Persuasive Speeches\tClasses Merged:Students required to attend two class sessions (TBD)\r\nWk4\tInformative Speech (1st group) \tExtemporaneous (selected topics)\r\nWk5\tInformative Speech (2nd group)\tExtemporaneous (selected topics)\r\nWk6\tPersuasive Speech (1st group)\tExtemporaneous (selected topics)\r\nWk7\tPersuasive Speech (2nd group)\tExtemporaneous (selected topics)\r\nWk8\tAnalytical / Rebuttal Speech Preparation \tClasses Merged\r\nWk9\tAnalytical / Rebuttal Speech (Affirmative & Negative Rebuttal Speech)\tExtemporaneous\r\nWk10\tAnalytical / Rebuttal Speech (Affirmative & Negative Rebuttal Speech)\tExtemporaneous\r\nWk11\tGuidelines to Debate & Debate Preparation (1) Guidelines to Debate & Debate Preparation (2) \tClasses Merged: Students required to attend two class sessions (TBD)\r\nWk12\tDebate Preparation  \tInstructor Session \r\nWk13\tStandardized Format Debate \r\nGroup 1 & 2 \t\r\nWk14\tStandardized Format Debate \r\nGroup 1 & 2 \t\r\nWk15\tDebate Preparation \t\r\nWk16\tCross-Exam Debate Group 1 & 2 \t\r\nWk17\tCross-Exam Debate Group 1 & 2 \t\r\nWk18\tFinal Debate Match \tTBD", "scorePolicy": "Course Requirements: \tStudents’ responsibilities in this class include:\r\n(1)\tAttending class regularly and to arrive on time: \r\n(2)\tDelivering speeches as scheduled: \r\ni.\tStudents are required to present their speeches on the day scheduled; \r\nii.\tMake-up speech will be only allowed when the failure to perform is due to an officially excused absence or incidents under extreme circumstances\r\niii.\tThe ideal time duration for each speech is 4 to 6 minutes. The minimum length of speech time is 3 minutes, and the maximum 6. Violation of the time limit (less than 3 and more than 6) constitutes a failure w/o points awarded. The time length for debates will vary due to the different formats employed.\r\niv.\tIt is essential to comply with the prescriptive requirements for each speech. Failure to follow will result in disqualification to complete the speech \r\n(3)\tSubmitting to the instructor a speech file with inclusion of the outlined speech as well as the full-length speech script (with citation and references), the speech evaluation sheet, the self-evaluating commentaries of both the current and previous speeches, and also blank A-4 size lined sheets for notes and feedbacks(see Appendix 1 & 2) when presenting the speech. Students who do not have the file ready and fail to comply with the outline format requirements (sampled and specified below_Appendix 3) forfeit the right to deliver the speech and hence receive zero points.  \r\n(4)\tStudent speakers are also required to display their outline slide(s) during the speech. \r\n(5)\tEvaluating one’s own speech (by the self-evaluation guideline): Students are required to evaluate him/herself after delivering an in-class speech. Self-evaluation is to be submitted to TA (10 minutes before the class starts) for preliminary check to secure the right to give an in-class speech. All speeches have to be videotaped by the student speaker prior to the classroom speech. Student speakers are required to watch their own videotaped performance, observe their own speeches, and compile all speech and debate evaluation for submission. Students are strongly advised to use their own videotaping devices for both the pre and during class speeches. Post-class recordings will be arranged and produced in the Lab, if necessary. A complete portfolio (preferably on compact disc) including all recordings is required for submission at the semester end.", "materials": "(1) No required texts / Extensive research required \r\n(2) For more information, please refer to the detailed syllabus and specific instructions discussed in class.", "foreignLanguageTextbooks": true}]