[{"name": "王聖銘", "email": "ryan5885@gmail.com", "latestUpdate": "2016-09-05 16:15:28", "objective": "本課程將包含使用者經驗設計的基礎，以及使用者研究量測的內涵及方法。本課程中，將透過課堂上課、討論、以及實習的方式，介紹使用者研究的實際案例、評估模式、團隊合作方法、設計與評估工具、實踐思維、挑戰、以及實際執行的程序。預期學生將於本課程中，透過分組獲得使用者經驗在互動設計、空間設計以及產品設計上，有關使用者研究的設計、評估、施行、以及質化與量化分析量測評估的知識與方法。", "schedule": "Unit 1: Principles and Process（第一單元：原理與步驟）\r\nIntroduction to UX（使用者經驗概論）\r\n\tDescribe the field of UX and how it relates to other disciplines\r\n\tOutline the stages in the UX process\r\n\tIdentify the structure and purpose of various design deliverables\r\nUser Research and Personas（使用者研究與人物誌整理）\r\n\tWrite a questionnaire\r\n\tInterview users in context\r\n\tIdentify User Centered Design techniques\r\n\tCreate effective personas to define the users one is trying to reach\r\nUX Analysis（使用者經驗分析）\r\n\tAsk questions that discover key business needs\r\n\tDescribe the benefits to an MVP approach\r\n\tGiven a goal, identify the tasks for a user to complete that goal and draw the user flow\r\n\tGiven a problem and a determined feature set, use a competitive audit to determine if there are different ways to implement the feature\r\n\tPrioritize features based on essentialness and level of effort\r\nUnit 2: UX Toolkit and Measurement（第二單元：使用者經驗分析與量測工具）\r\nCreating Wireframes and Prototypes（架構與雛型的建構）\r\n\tIdentify and describe tools for wireframing, prototyping, advanced drawing, and creating clickable drawings\r\n\tCreate wireframes, clickable drawings, and prototypes\r\nUsability Principles and Testing（易用性評估原理與測試）\r\n\tEvaluate user experience of given websites and products, using Jakob Nielsen's 5 Principles of Usability（易用性的五大原則）\r\n\tDefine each type of usability test and determine when to use each\r\n\tRun a usability test using best practices\r\nUser Experience Measurement（使用者竟驗量測）\r\n\tMeasuring user experience by participant observation\r\n\tEye tracking basic, applications and implementation on user experience analysis\r\n\tUsing Electroencephalography (EEG) in a usability test of a survey\r\n\tScientific data analysis and big data analysis\r\nUnit 3: Practices for Design Patterns（第三單元：設計實務）註：依修課學生之領域選擇\r\nProduct Service System User Survey（產品設計系統使用者調查）\r\nService Design of Interaction Technology（互動技術之服務設計）\r\nSocial Network Experiences Design and Evaluation（社群網絡之經驗設計與評估）", "scorePolicy": "Participation  課程參與\t20%\r\nProject I  \t專案一 10%\r\nProject II  專案二\t10%\r\nMidTerm Project  期中專案成果 \t20%\r\nTerm Project and Paper  期末專案成果\t40%", "materials": "1.\tResearch Based Web Design & Usability Guidelines, U.S. Department of Health and Human Services, Available as free PDF from http://usability.gov/guidelines/guidelines_book.pdf\r\n2.\tMoggridge, B, Designing interactions, MIT press, (2007). (Chapter \"Designing Interactions\" pp. 647-662) \r\n3.\t As We May Think, Vannevar Bush, The Atlantic Monthly, July 1945 \r\n4.\tRich Gold, The Plenitude: Creativity, Innovation, and Making Stuff (Simplicity: Design, Technology, Business, Life) (Chapter 2: The Four Creative Hats I've Worn, pp 5-31) \r\n5.\tJon Kolko (2011), Exposing the Magic of Design: A Practitioner's Guide to the Methods and Theory of Synthesi\r\n6.\tJon Kolko (2010), Thoughts on Interaction Design\r\n7.\tDunne, A, & F Raby, Design Noir: The secret life of electronic objects, Birkhauser, 2001. (Sec 2 \"Hertzian Space\" pp. 15-43).\r\nDunne, A, & F Raby, Design Noir: The secret life of electronic objects, Birkhauser, 2001. (Sec 5 \"The Secret Life of Electronic Objects\" pp. 75-90).\r\n8.\tRittel, Horst, and Melvin Webber; \"Dilemmas in a General Theory of Planning,\" pp. 155-169, Policy Sciences, Vol. 4, Elsevier Scientific Publishing Company, Inc., Amsterdam, 1973. [Reprinted in N. Cross (ed.), Developments in Design Methodology, J. Wiley & Sons, Chichester, 1984, pp. 135-144.]\r\n9.\tBillinghurst, M., Kato, H. and Poupyrev, I. (2001). MagicBook: Transitioning between Reality and Virtuality. \r\n10.\tKuniavsky, Mike (2010), Smart Things: Ubiquitous Computing User Experience Design (Chapter 10)\r\n11.\tPhysical Computing: Sensing and Controlling the Physical World with Computers by Tom Igoe and Dan O'Sullivan (2004). (SELECTIONS) \r\n12.\tPast, Present, and Future of User Interface Software Tools, Brad Myers, Scott E. Hudson, Randy Pausch, ACM Transactions on Computer-Human Interaction, March 2000, pp. 3 - 28.\r\n13.\tStacey Kuznetsov and Eric Paulos, Rise of the Expert Amateur: DIY Projects, Communities, and Cultures, ACM NordiCHI, Reykjavik, Iceland, October 2010\r\n14.\tVoyagers and Voyeurs: Supporting Asynchronous Collaborative Information Visualization, Jeffrey Heer, Fernanda Viegas, Martin Wattenberg, CHI 2007: ACM Conference on Human Factors in Computing Systems, pp. 1029 - 1038.\r\n15.\tJohn Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research through design as a method for interaction design research in HCI. In Proceedings of the SIGCHI conference on Human factors in computing systems (CHI '07). ACM, New York, NY, USA, 493-502.\r\n16.\tTracee Vetting Wolf, Jennifer A. Rode, Jeremy Sussman, and Wendy A. Kellogg. 2006. Dispelling \"design\" as the black art of CHI. In Proceedings of the SIGCHI conference on Human Factors in computing systems (CHI '06), Rebecca Grinter, Thomas Rodden, Paul Aoki, Ed Cutrell, Robin Jeffries, and Gary Olson (Eds.). ACM, New York, NY, USA, 521-530 \r\n17.\tUniversal Principles of Design, Revised and Updated: 125 Ways to Enhance Usability, Influence Perception, Increase Appeal, Make Better Design Decisions, and Teach through Design - William Lidwell (SELECTIONS )\r\n18.\tKuniavsky, Mike (2010), Smart Things: Ubiquitous Computing User Experience Design (Chapter 19)\r\n19.\tPaul Dourish, Where the Action Is (chapters 1 & 2)\r\n20.\tNorman, D. Emotional Design: Why We Love (Or Hate) Everyday Things. Basic Books, 2004. (SELECIONS)", "foreignLanguageTextbooks": true}]