[{"name": "楊士萱", "email": "shyang@ntut.edu.tw", "latestUpdate": "2016-10-21 22:08:18", "objective": "This course Linear Algebra\r\n\tis a mathematics course.\r\n\tis useful and fundamental to CSIE (and many other discipline) students.\r\n\temphasizes both computations and concepts.\r\n\tasks you to use an open-source mathematical package called Scilab.\r\n\tguides you to read an English textbook.\r\n\trequires hard work.", "schedule": "1. Linear Equations \r\n\tTo understand the basic terminologies and notations of matrices and systems of linear equations, in the forms of vector equation and matrix equation.\r\n\tSolving a system of linear equations with the Gaussian elimination: reducing a matrix to its echelon form. \r\n\tTo interpret a system of linear equations in various ways.\r\n\tFirst exposure to key concepts such as linear independence and linear transformation. \r\n2. Matrix Algebra \r\n\tTo learn basic matrix arithmetic operations: addition, subtraction, multiplication power, transpose, and inverse.\r\n\tTo summarize the concepts for systems of n linear equations in n unknowns. \r\n3. Vector Spaces \r\n\tIntroduction to vector spaces. \r\n\tFundamental subspaces of a matrix: column space, row space, and null space.\r\n\tBasis and dimension of a vector space. \r\n4. Eigenvalues and Eigenvectors\r\n\tTo find the eigenvalues and eigenvectors of a matrix. \r\n\tDiagonalization of a matrix (linear transformation).\r\n5. Orthogonality and Orthogonal Bases \r\n\tTo introduce inner product of vectors, and thus the geometric concepts of length, distance, and angle (perpendicularity).\r\n\tTo be familiar with the use of orthogonal bases.\r\n\tLeast-Squares approximation.", "scorePolicy": "1. Attendance and warm-up quizzes (sampled and comprehensive), 10% (extra).\r\n2. Written exercises, 20%. Hand in your homework every Thursday right before class. \r\n3. Programming assignments and Scilab projects, 20%.\r\nFor 2 and 3, discussion is encouraged but plagiarization (抄襲) is prohibited.\r\n4. Two 50-minute tests, 10% each. (20%)\r\n5. Midterm exam and final exam, 20% each. (40%)", "materials": "Textbook: \r\nDavid. C. Lay, Stephen R. Lay, and Judy J. McDonald, Linear Algebra and its Applications, Fifth Edition, Pearson Education Limited, 2016. （偉明書局代理）\r\n\r\nGood References :\r\n1. Introduction to Linear Algebra with Applications by J. Defranza and D. Gagliardi. \r\n2. Elementary Linear Algebra by Howard Anton. \r\n3. Linear Algebra and Its Applications by Gilbert Strang.", "foreignLanguageTextbooks": true}]