[{"name": "霍弘毅", "email": "twall@ntut.edu.tw", "latestUpdate": "2016-09-13 13:59:31", "objective": "本課程透過希臘英雄的偉大冒險故事以及希伯來聖經傳統中的聖哲事蹟來探索早期西方文明的兩大源頭（希臘與希伯來文化）所呈現出的主要風貌。", "schedule": "In this course I will introduce the class to the deep backgrounds that have shaped Western Literature and Culture. Even contemporary Literature, Movies and other Art forms are still influenced by literary and philosophical texts that date back more than a thousand years. The course organization will begin with three very broad and deep backgrounds: the Judaic, the Greek, and the Christian. We will read these fundamental texts together and I will provide as much commentary as I can. You will have to take notes because this is the first time I have taught this course and I do not have lectures typed out. I will proceed slowly and the two exams will be open book. Someone who grows up nowadays in the Middle East will be deeply influenced by Islam (and Judaism) even if they are non-believers; a person living in Asia will be influenced by Confucianism and the Buddha even if they have never read a word of Confucius and never practice meditation. In the same way, the Western world is profoundly Jewish and Platonic even for atheists and non-philosophers. My goal is to try to make these deep influences visible and intelligible.\r\n\r\nPart I: The Background\r\n1 The Judaic Tradition: History, Genesis, Exodus, Psalms\r\n2 The Greek Heritage: Hesiod, Homer, Plato, Aesop, Sappho, Aristotle\r\n3 The Christian Influence: Mathew, John, Paul\r\n\r\nPart II: Selected Literature\r\nMilton, Cervantes, Coleridge, Mary Shelly, Emily Bronte, others", "scorePolicy": "Grading: \r\nMid-Term Exam (multiple choice) 40%; \r\nFinal Exam (multiple choice) 50%\r\nOne or Two Paragraph Topic Paper (to be assigned) 10%", "materials": "Text: Periodic Handouts", "foreignLanguageTextbooks": true}]