[{"name": "張素薰", "email": "shchang@ntut.edu.tw", "latestUpdate": "2016-05-30 00:00:12", "objective": "本課程利用新聞教材加強英語字彙能力及聽力技巧, \t內容採用電台、報紙、電視的時事、深度報導和全球議題以增強學生英語知識。同時, 學生亦可獲得各種有用的聽力技巧以加強英語聽力。", "schedule": "ournalistic English & Listening Training\r\nIntroduction:\r\nThis course is designed to fortify English listening and speaking abilities by exploring different aspects of the contemporary themes in which vocabulary build-up and its application to relevant topics are emphasized. Current events, in-depth reports as well as global issues from radio, newspapers and T.V are provided. \r\nBasic Doctrines:\r\n1.\tExpose students to cosmopolitan themes that are up-to-date, sophisticated and varied in tone, with a view to stimulating students more profoundly and to accelerating their retaining and using in the target language.\r\n2.\tThe films of contextually rich—cultural background and competent knowledge-related to the corresponding themes are provided to integrate the skills of the target language.\r\n3.\tLanguage capability and performance are equally stressed and developed.\r\n4.\tStudents’ active participation is essentially required.\r\n5.\tIndividual reflection is perceived by pair and group works, out-of-class assignments for review and research, oral reports and specific presentations.\r\n\r\n\r\n\r\nAssessment:\r\n1.\tWeekly tests and Attendance (20 points maximum deduction). 80%\r\n2.\tOral reports and presentations. 20%\r\n3.\tTeacher’s website: http://www.cc.ntut.edu.tw/~shchang/2016(1)/\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nSyllabus for 4E1 Multimedia English Listening and Speaking, \r\n2016(1)一零五學年度第一學期\r\nWeek\tClassification \tEnglish News\tFriends\r\n1\tIntroduction\r\n2\tHealth\t1. Taipei to require prescriptions for purchasing contact lenses (2015/07/17)\t1\r\n3\t\t2. Researchers at Chang Gung Memorial find popular Chinese medicine Ganoderma aids weight loss (2015/06/26)\t2\r\n4\tLaw\t3. Taipei Mayor Ko Wen-je urges central government to write drone laws after Taipei 101 crash (2015/07/22)\t3\r\n5\t\t4. Taipei hopes to require new car owners to provide proof of private parking space (2015/07/20)\tStage Play\r\n6\tBusiness\t5 With banks reluctant to take over Taipei Dome, city to continue talks with Farglory (2015/06/26)\r\n\t4\r\n7\t\t6. Record high temperatures lead some to worry that power rationing could be in store (2015/06/26)\t5\r\n8\tLife\t7. Food and Drug Administration begins implementing GMO labeling regulations (2015/07/20)\t6\r\n9\t\tPowerpoint Presentation\r\n10\t\t8. Officials say wealth gap is improving, contrary to Liberty Times report (2015/07/01)\r\n\t7\r\n11\tSociety\t9. Taipei MRT stabbing leads many to reconsider the appropriate escalator etiquette (2015/07/21)\t8\r\n12\t\t10. Government creates new foundation to help water park explosion victims long-term (2015/07/02)\t9\r\n13\tEducation\t11. Students publicly protest Education Ministry to implement China-centric curriculum guidelines (2015/07/05)\tDemonstration\r\n14\t\t12. Plans to tear down elementary school show challenges associated with urban renewal (2015/07/07)\t10\r\n15\tTraffic\t13. On visit to airport MRT line, Taipei mayor anticipates moving Taipei airport (2015/07/02)\t11\r\n16\t\t14. Taichung opens bus service on lanes previously dedicated to BRT system (2015/07/08)\t12\r\n17\t\tPowerpoint Presentation\r\n18\tFinal Report\r\n\r\nThe way to get into contact with the teacher:\r\n1.\tTeacher’s website: http://www.cc.ntut.edu.tw/~shchang/2016\r\n2.\tTeacher’s e-mail: shchang@ntut.edu.tw", "scorePolicy": "Evaluation:\r\n1.\tWeekly Tests and appearance, one absence being reduced two points. 80%\r\n2.\tPresentations and Reports. 20%", "materials": "　", "foreignLanguageTextbooks": false}]