[{"name": "施欣文", "email": "sharinschroeder@ntut.edu.tw", "latestUpdate": "2016-08-18 18:16:16", "objective": "COURSE OVERVIEW\r\n\t \r\nThis course aims at providing students with the fundamental knowledge and competence that they will need in doing research and writing research papers using the MLA style. Its main purpose is to familiarize students with methods, procedures, and techniques that are applicable to quantitative and qualitative research as well as to improve their ability to write research papers. The main topics for instruction include the research process, major research methods, and the structure of a research paper. Students will also learn how to come up with a high-quality research question, best practices for evaluating source material, how to make use of the electronic and hard-copy sources that are available, and how to carry out a long-term research project, with the goal of avoiding the pitfalls that first-time research project students and writers may fall into.", "schedule": "Dates and assignments reflect the schedule for the first nine weeks: students in the second group should refer to their printed syllabus copy, as there will be differences based on the school holidays. \r\n\r\nWeek 1: An Introduction to Research\r\n“How to Write a History Paper”\r\nAdvice from “Writing your Dissertation in Fifteen Minutes a Day” \r\nSelected Course Packet Readings\tNote that our first group project will be due on 9/26. Take a look at that reading to see if you would like to be the group to present that day. You might also preview other project possibilities to see which one you think will be the most useful to you to present. \r\n\r\nWeek 2: MLA practice:\r\nActivity on Works Cited in MLA Style, Ch. 14: p. 268–306\r\n\tRead the syllabus carefully. \r\nRead WRP pp. 21–36 (“Why Do Research?” “Learning the Conventions of Academic Writing” “Understanding and Avoiding Plagiarism,” “Understanding a Research Assignment,” “Topic Selection,” and “Relating Your Personal Ideas to a Scholarly Problem”) \r\nBe prepared for a quiz on the syllabus and a quiz on the reading. Remember that you will often have unannounced quizzes on the reading. Make sure you bring your dry-erase marker today and on subsequent days.\r\n\r\nWeek 3: Identifying and Using Library Sources\r\nGP: “Reading/Evaluating Sources” 127–42.\r\nPowerpoint on Library Resources\r\nDocumenting Sources Using MLA style\tRead the sections from chapter 2 on refining your topic: pp. 36–41 and pp. 66–68 on using Boolean expressions.\r\n\r\nWeek 4: Using the Internet for Research/ Recording Information\r\n“Preparing an Annotated Bibliography and Review of Literature” WRP p. 143–52.\r\nG.P.: “Conducting Field Research” p. 102–112 (and make sure to modify some of these for research in Taiwan—our spring literature conference website may help: https://forgottenbookstaipei.wordpress.com/archives-in-taiwan/). \r\nGP: “Plagiarism and How to Avoid It” WRP pp. 113–26 \tRead “Research Tip: Avoiding ‘Cut-and-Paste” Plagiarism” on WRP p. 62.  \r\nRead “Developing Outlines and Writing Effective Notes,” WRP p. 153–166 (through 9g)\r\nRead: “They Say/I Say” (Course Packet)\r\n\r\nWeek 5: (1st nine weeks--no class. Second nine weeks, please take this schedule with a grain of salt. Your dates and assignments may be arranged differently.)\r\n\r\nWeek 6: NTUT/Tai Da Library Project Due\r\nTai Da Database Project Due\r\n\r\nWeek 7: GP: MLA Style: In-text References:\r\nGroup Projects (A, B, C): A=WRP pp. 192–98, B=pp. 198–204 (note: there’s a typo on p. 199; the period in the text example should go after “(qtd. in Kemery).”   C=pp. 204–11\tRead Signal Phrases, Integrating quotations (Course Packet)\r\nRead: “Piles, Stacks, Folders” (Course Packet)\r\n\r\nWeek 8: Group Projects: Drafting the Paper in an Academic Style and MLA Style: In-text References, A: pp. 166–69 & 174–81, B: pp. 181–91 (Spend time on what you think will be useful (probably not file formats, etc.)—also keep in mind that the rule on third-person and passive voice may not apply for literature; our discipline prefers active voice), C: pp. 211–17.\tRead chapter 12 from WRP, paying particular attention to the checklists and hints on pages 219, 225, 226–27, 231, and 234. Note down important points or questions from your reading (e.g. which methods do you think you will want to return to and use when you write your senior project?) and from your more careful reading. \r\n\r\nWeek 9: Course Wrap-Up\t\r\nExtended Research Proposal with Annotated Bibliography Due", "scorePolicy": "ASSIGNMENTS\r\n•\tIn order to receive credit for this course, you must complete all assignments.\r\n•\tAll assignments are due in hard copy at the beginning of class. (You will have technology problems. Make sure to print your paper early enough that you will not run into difficulties with non-functioning printers.) For formal papers (e.g. your proposal and annotated bibliography) I take off 5% if you are late to class on a paper due date (10% if you are fifteen or more minutes late), 10% if the paper is turned in within twenty-four hours after the due date (before 4:00 p.m. on Wednesday) and 20% if the paper is turned in within forty-eight hours of the deadline. You will not receive any credit for a paper turned in more than 48 hours late. Any late paper should be turned in both by an e-mail Word document and in an identical hard copy. I hope that you will turn in all papers on time, but in the event that a paper is late, bring it to my office. If I am not in my office, slip the paper under the door or put it my box. Please also immediately send me an e-mail alerting me that you have left a paper for me. If you wish to receive credit for a late paper, it is your responsibility to make sure that the paper gets to me safely. \r\n•\tAs this class is more assignment-based than others that I teach, I will give 50% credit for late assignments turned in within 24 hours. No credit is given for later homework. If you know you will be absent, get me the assignment ahead of time.\r\n•\tOn your many quizzes, you may use the notes you have taken in your reading notebook so long as these notes are a result of your individual effort on the reading and have not been borrowed from or shared with other students (which is scholastic dishonesty). \r\n \r\n PARTICIPATION\r\n\r\nSomeone with a high grade in participation shows a thorough engagement with the course readings, speaks only English, jots down questions in a notebook while reading in order to bring these questions up in class discussion, frequently makes thoughtful contributions that raise the level of class discussion, knows when to listen and when to speak, takes notes in class, is trustworthy, takes academic honesty seriously, stays focused and on-task during class periods, is helpful and engaged during peer-review workshops, interacts positively and tactfully with other class members, and reads with expression and enthusiasm. \r\n\r\nIf you are worried about your level of participation, please see me. Shy people can do as well in their participation grade as outgoing people, but both shy and outgoing people have to put in effort. Participation is not how much you say or how smart you can show me you are: contribute in ways that help you and the people around you learn. \r\n\r\nETHICS\r\nPlease show yourself to be trustworthy in all areas. All of your work should be original and well documented. Below is a definition of academic dishonesty: \r\n\r\nScholastic dishonesty means plagiarizing; cheating on assignments or examinations; engaging in unauthorized collaboration on academic work; asking a friend for a summary or their notes rather than doing the reading yourself; having a friend rewrite sections of your essay; taking, acquiring, or using test materials without faculty permission; submitting false or incomplete records of academic achievement; acting alone or in cooperation with another to falsify records or obtain dishonestly grades, honors, awards, or professional endorsement; altering, forging, or misusing a University academic record; or fabricating or falsifying data, research procedures, or data analysis.\r\n\r\nPlagiarism can include \r\n•\tsubmitting a paper written by means of inappropriate collaboration;\r\n•\tsubmitting a paper written by you for another course, submitted without the permission of both instructors;\r\n•\tsubmitting a paper purchased, downloaded, or cut and pasted from the Internet;\r\n•\tfailing to properly acknowledge its sources through standard citations. For example, the student may paraphrase or summa", "materials": "•\tLester, James D. and James D. Lester, Jr. Writing Research Papers: A Complete Guide.15th ed. Boston: Pearson, 2015. Print. \r\n•\tCourse Packet and/or e-mailed readings and handouts. Please print these. \r\nSUPPLIES\r\n•\tA reading notebook/journal, pens, and loose-leaf paper for in-class writing and quizzes\r\n•\tA dry-erase marker and a cleaning cloth", "foreignLanguageTextbooks": true}]