[{"name": "廖思涵", "email": "shliao35@gmail.com", "latestUpdate": "2016-06-07 00:26:19", "objective": "WELCOME TO INTERMEDIATE CHINESE! Intermediate Chinese is designed to consolidate the foundations built in Basic Chinese and continue developing students' skills in aural comprehension, speaking, reading, and writing. While all four skills are emphasized, primary attention will be given to listening and speaking, since a solid foundation in these two skills is vital to the development of reading and writing skills. Upon completion of the course, you should be able to speak Chinese with some fluency on everyday topics and be able to write short compositions on simple everyday life topics. We not only educate you to compare Chinese culture with your own culture, but also immerse you in a Chinese cultural environment and provide you with the communicative tools you need in order to act appropriately in Chinese culture.", "schedule": "W1\tIntroduction 課程介紹\r\nW2\tLesson 2 Visiting a Night Market 第二課 逛夜市\r\nW3\tLesson 2 Visiting a Night Market 第二課 逛夜市\r\nW4\tLesson 3 Eating at a Food Stand 第三課 還是小吃好\r\nW5\tLesson 3 Eating at a Food Stand 第三課 還是小吃好\r\nW6\tLesson 4 Tea and Chinese People 第四課 茶與中國人\r\nW7\tLesson 4 Tea and Chinese People 第四課 茶與中國人\r\nW8\tMidterm 期中考試\r\nW9\tLesson 5 Marriage and Match-Makers 第五課 我愛紅娘\r\nW10\tLesson 5 Marriage and Match-Makers 第五課 我愛紅娘\r\nW11\tLesson 6 Taipei is so crowded! 第六課 台北怎麼那麼擠\r\nW12\tLesson 6 Taipei is so crowded! 第六課 台北怎麼那麼擠\r\nW13\tLesson 7 Roasted Students 第七課 熱鍋上的「烤」生\r\nW14\tLesson 7 Roasted Students 第七課 熱鍋上的「烤」生\r\nW15\tLesson 8 Religions and Folk Beliefs 第八課 大拜拜\r\nW16\tLesson 8 Religions and Folk Beliefs 第八課 大拜拜\r\nW17\tFinal Presentation 期末報告\r\nW18\tFinal Presentation 期末報告", "scorePolicy": "Attendance and class performance 出缺席與課堂表現\t30%\r\nHomework and quizzes 作業與小考\t20%\r\nMidterm Examination 期中考試\t20%\r\nFinal Presentation 期末報告\t30%\r\nTotal 合計\t100%", "materials": "今日台灣：中級漢語課程 Taiwan Today: An Intermediate Course, 2004 Extended Edition (note: make sure to get this edition. ISBN: 9574108678.)", "foreignLanguageTextbooks": false}]