[{"name": "楊韻華", "email": "yhyang@ntut.edu.tw", "latestUpdate": "2016-09-10 10:20:58", "objective": "Course Title:\t\tEnglish for Economics and International Business (經貿英文)\r\nCredit Hours:\t\t3\r\nTerm Offered:\t\tFall, 2016\r\nInstructor’s Name:\tDr. Yun-Hua Yang\r\nContact E-Mail:\tyhyang@ntut.edu.tw \r\nOffice \t\t\tGeneral Education Building Rm#805\r\nOffice Hours:\t\tBy Appointment \r\nRequired Text:    Multiple Online Resources \r\nCourse Description: The course is designed for English-major students who wish to increase their knowledge in business-related issues and expertise in future business practice.  All students enrolled in this course are expected to be equipped with an advanced level of English proficiency as well as basic knowledge of effective business communication as it continues where Business English Writing left off. This course covers fundamental business concepts, important current business events, essential business terms, and comprehensive language used in business practice. Business content vocabulary incorporating several main business categories / disciplines will be introduced. Also, students are required to read the current issues of several prestigious business publications, including but not limited to, The Economist, BusinessWeek, Financial Times, and local business magazines.\r\nCourse Objectives:  This course centers its focus on understanding business context in English, and it aims to help the students:\r\n(1)\tlearn about business through the medium of English \r\n(2)\tpromote high level of awareness of the business climate \r\n(3)\timprove reading comprehension of articles relating to business\r\n(4)\tdevelop functional business language in English", "schedule": "Weekly Syllabus\r\nWeek \tContent Reading & Discussion (Q&A included)\t\r\nWk 1 \tOrientation / Corporate Organizations / Business Report \tDr. Yang \r\nWk 2\tHuman Resources / Biz Report\t\r\nWk 3\tChange / Biz Report\t\r\nWk 4\tResponsibility / Biz Report\t\r\nWk 5\tReview\t\r\nWK 6\tGovernance / Biz Report \t\r\nWK 7\tStart-ups / Biz Report \t\r\nWK 8\tResources / Biz Report \t\r\nWK 9\tReview\t\r\nWK 10\tPower / Biz Report\t\r\nWK 11\tE-Marketing / Biz Report\t\r\nWK 12\tRisk / Biz Report\t\r\nWK 13\tMisconduct / Biz Report\t\r\nWK 14\tReview \t\r\nWK 15\tDevelopment / Biz Report\t\r\nWK 16\tProblem Solution (Solving the Dilemmas) \t\r\nWK 17\tProblem Solution (Solving the Dilemmas) \t\r\nWK 18\tFinal Exam \t\r\n(The weekly syllabus is subject to change.)", "scorePolicy": "Course requirements:\r\nEach student must complete the following requirements:  \r\n1)\tattendance* noted for grading details\r\n2)\treading all materials assigned \r\n3)\ttaking lecture notes for presentation  \r\n4)\tin-class quizzes based on the reading materials \r\nGrading Policy:\t1) Attendance 30%  2) Weekly business updates 10%   3) Presentation 30%\r\n           4) Final Exam  20%\t\r\nLeaves and Absences: \t1) Any AWOL will result in the penalty of 10% semester grade deduction.\r\n\t\t\t\t  \t2) Penalty-waiver can be granted for any absence w/ official document at the \r\n\t\t\t\t\t   \t instructor’s discretion. It is only limited for one time in a semester. \r\nShould there be any major incidents and issues, special considerations will be given after thorough discussion with the student(s) and the class advisor(s). \r\n3) Each lateness, after the instructor finishes the second-round roll call, will result in the penalty of 5% semester grade deduction. \r\n\r\nGuideline(s): 1) Students are responsible for full-length presentations on chapter units assigned. Presentation shall be complemented by additional research on unit topic. \r\n2) Students are also required to brief on the most up-to-date business stories. Business updates can be those from international and/or local business journals. Business Weekly can be made available in the main office. \r\n3) Submitting two papers (each for 10%) at any time during the semester. The paper has to primarily be based on the many dilemmas introduced in the course book. Choose at least two dilemmas, to which tenable solutions are provided in the manner prescribed by essay style.", "materials": "Required Text:  Multiple Online Resources: Knowledge @ Wharton, the Economist, Bloomberg Businessweek, etc.", "foreignLanguageTextbooks": true}]