[{"name": "吳孟真", "email": "philwu@gmail.com", "latestUpdate": "2020-08-14 00:20:23", "objective": "From the fundamental constants as concepts for understanding our universe, to the duality of matter and waves, we will build our understanding of the tangible universe in terms of optics and magnetism. Concepts beyond the classical description will be introduced, such as the semi-classical hydrogen model of Bohr, the Schrödinger Equation, and an introduction to applied technology. A major focus will be the modern attention of physics to medical device and technology. This course will utilize mathematical concepts from linear algebra and calculus.", "schedule": "Week of \tTopics\tDetails\tProblem Sets\r\nSept. 14\tFundamental Concepts – Constants and how they were determined. \t-Atomic mass of proton, neutron and electron as well as the Avogadro’s number. \r\n-Millikan’s Oil drop.\r\n-Interferometry and gravitational lensing\r\n-Blackbody\tPS1\r\nSept. 21\tOptics\t-Photoelectric effect\r\n-Waves\r\n-X-rays\r\n-Compton effect\r\n-E&M\r\n-Polarization,\tPS2\r\nSept. 28\tIntroduction to Quantum Mechanics\t-Schrodinger Equation and solving particle in a well (box)\r\n-Tunneling and other examples\r\n\r\nAsk students availability for one extra hour this week.\tPS3\r\nOct. 5\tAtoms and Molecules\t-Bohr atom\r\n-atomic spectra\r\n-energy levels\r\n-nuclear motion\r\n-atomic excitation (lasers, spectroscopy)\r\n\r\nNo class on Wednesday\tPS4\r\nOct. 12\t\t-SG experiment introducing spin and uncertainty principle\r\n-periodic table, and an explanation\r\n-spin-orbit coupling\r\n-total angular momentum\r\n-xray spectra\r\n-molecular bonds\r\n-hydrogen molecule H2\r\n-rotational and vibrational energy levels (nmr)\tPS5\r\nOct. 19\tConcepts in Magnetism, Solids and Optoelectronic Devices\t-Magnetism an Introduction: para-, ferro-, ferri-, dia-, exotic etc.\tPS6\r\nOct. 19\t\t-Solids: band theory of solids semiconductors, conductors, superconductors\r\n-Hydrodynamics\tPS7\r\nOct. 26\tElementary Particles and Cosmology\t-Elementary Particles, Relativity, Cosmology\tPS8\r\nNov. 2\tApplied Concepts\t-Applied concepts: IC, TCO, Transmission lines, Storage (batteries, capacitors, inductors, etc.) and ideas, solar cells, devices, thin films, photonics, integrated optics, lcds, fiber optics, sensors, fourier optics\tOct. 31-Nov. 1, TT’s anniversary celebration.\r\nPS9\r\nNov. 9\tMedical Physics: Mechanics and Power Laws\tNo lecture on Tuesday for Midterm Examination\r\n\r\n-Medical Physics:\r\n-Mechanics and forces, stress and strain in human body\r\n-Hydrostatics, buoyancy, compressibility, viscosity\r\n-Circulatory system and Poiseuille (Bernoulli) flow\tMidterm Examination on Tuesday, no problem sets, English proficiency test (undergraduates only)\r\nNov. 16\tMedical Physics: Systems of Many Particles and Thermodynamic Concepts \t-Food Consumption\r\n-Basal Metabolic Rate and Scaling\r\nSystems of Many Particles : Gas Molecules in box\r\n-Systems of Many Particles: Thermodynamics Ensembles, Entropy, Boltzmann Factor, Nernst Equation\tFailure Warning Issued,\r\nPS10\r\nNov. 23\tThermodynamic Concepts\texample in cells)\r\n-Heat Capacity (and heat transport)\r\n-Chemical Potential\r\n-Gibbs Free Energy\r\n-Diffusion (example of diffusion in pores, kidney)\r\n-Brownian Motion\tPS11\r\nNov. 30\tBiomagnetism\t-Biomagnetism : Quick Review of Lorentz, Magnetic field of moving charge, Magnetoencephalogram and induction\r\n-Discussion of topics for presentations\tPS12\r\nDec. 7\tPotentials and Transport (Through Neutral Membranes)\t-Membranes osmotic pressure\r\n-transport through a membrane and pore\r\n-Hodgkin-Huxley Model for Membrane Current\r\n-Electrocardiograms\r\n-Method of Least Squares and Signal Analysis (photosynthesis in plants) and other functions\tHelp prepare presentations: ask students to work on presentations and submit by Tuesday\r\nDec. 14\tMedical Physics: Atoms and Lights\t-Atoms and Lights – Considerations such as IR to and from body, how to handle UV\r\n-Sound and Ultrasound\tPS13\r\n\tMedical Physics: Interaction of Photons and Charged Particles with Matter\t-Sound and Ultrasound\r\n-Radiometry and Photometry, Medical uses of X-rays, Photons\tPS14\r\nDec. 21\tStudent Presentations\tSchedule of student presentations\tPresentations from all students\r\nDec. 28\tMedical Physics: Imaging\t-Magnetic Resonance Imaging\tPS15\r\nJan. 4\tMedical Physics: Nuclear Physics and Nuclear Medicine\t-Nuclear methods, half-life and why we should care\r\n- Nuclear Physics and Nuclear Medicine\tPrepare for finals.\r\nJan. 11\t\tFinal Examinations\tFinal Examination on Tuesday, no more problem sets =) \r\nJan. 18\t\t\tWinter Break Begins!\r\nJan. 25\t\t\t\r\nJan. 31\t\t\tFall Semester Ends", "scorePolicy": "Evaluation: \r\n•\tAttendance – 100% (full attendance or two sick leaves allowed), 90% (4 total allowed leaves, included 2 sick leaves). 75% > 5 missed classes. 50% > 50% missed classes.\r\n•\tProblem Sets – weekly homeworks to be turned in the following Tuesday before end of class.\r\n•\tExams – midterm (50% of category) and finals (50% of category).\r\n•\tPresentation – Here’s an example of a good presentation (document and video?).\r\nEtiquette: No cellphones please unless emergency, computer or digital aids for note taking allowed.\r\n\r\n\r\nGrading Schema\r\nA+\t97-100\r\nA\t94-97\r\nA-\t90-94\r\nB+\t87-90\r\nB\t84-87\r\nB-\t80-84\r\nC+\t77-80\r\nC\t74-77\r\nC-\t70-74\r\nD+\t67-70\r\nD\t64-67\r\nD-\t60-64\r\nF\t0-60", "materials": "This course is not planned to follow any single particular text. \r\nRecommended reading:\r\n“Essential University Physics”, 3E, by R. Wolfson, chapter 7.\r\n“Modern Physics for Engineers” Jasprit Singh, John Wiley & Sons, New York 1999.", "foreignLanguageTextbooks": true}]