[{"name": "張玉鈍", "email": "ytchang@ntut.edu.tw", "latestUpdate": "2020-06-13 16:21:51", "objective": "2020Fall 課程概述  張玉鈍0916247766\r\n工業工程與管理專業人員， 需協同製程技術工程師， 依目前需求、未來需求， 選擇適當製程設備、 自動化 、人機配合、 產線平衡、 製程步驟組合， 從事產線設計及管理。\r\n\r\n本課程參酌北科工管系之課程規劃， 期能引導學員對於製程技術相關知識 ，能有基礎的常識及專業名詞的認知，  能漸有熟悉和親近的感覺， 能具有協同製程技術工程師的基礎知識能力。課程內容包括工程材料、 工程圖學、 公差與配合、 熱處理、  量具、  夾治具、  傳統製造程序如鑄造鍛造機械加工組裝， 及先進製造程序如smt ic pcb等等。\r\n\r\n期能有助於同學對於由製程技術所組成的生產製造系統的設計、營運、管理，  產生興趣並發展成專業。\r\n\r\n本課程安排將有助於補強已經修習過的工業工程與管理概論、工作研究課程，有助於後續品質管理、  生產管理 、 設施規劃等課程的學習。\r\n\r\nProfessionals in industrial engineering and management need to cooperate with process technology engineers to select appropriate process equipment, automation, human-machine coordination, production line balance, and process step combinations based on current and future needs to engage in production line design and management.\r\n\r\nThis course refers to the curriculum planning of NTUT IEM Department. It can guide students to have knowledge of process technology through basic common sense and professional terminology, can gradually feel familiar and close to this field, and can have the basic ability to collaborate with process technology engineers.  Course content includes engineering materials, engineering graphics, tolerances and fits, heat treatment, measuring tools, jigs, traditional manufacturing procedures such as casting , forging, machining, assembly, and advanced manufacturing procedures used for SMT IC PCB and so on.\r\n\r\nWe will try to  help students to become interested in the design, operation, and management of the manufacturing system composed of process technology and develop into a professional.\r\n\r\nThis course arrangement will help to reinforce course such as IEM introduction and Work Study that have been taken, and will help the follow-up study of quality management, production management, facility planning and other courses.", "schedule": "本課程教學  將輔以大量的線上影音教材及翻譯軟體。  並含組裝實作。\r\nThe teaching of this course will be supplemented by a large number of online audiovisual materials and translation software. And includes assembly practicing。\r\nThe topics include:\r\n3 Mechanical Properties of Materials 40\r\nengineering graphics, tolerances and fits\r\n10 Fundamentals of Metal Casting 184\r\n12 Shaping Processes For Plastics 242\r\n15 Powder Metallurgy 315\r\n16 Metal Forming and Sheet Metalworking 352\r\n21 Machining Operations and Machine Tools 463\r\n22 Cutting-Tool Technology 503\r\n24 Grinding and Other Abrasive Processes 546\r\n26 Heat Treatment of Metals 592\r\n27 Surface Processing Operations 602\r\n29 Welding Processes 635\r\n30 Brazing, Soldering, and Adhesive Bonding 672\r\n31 Mechanical Assembly 687\r\n32 Additive Manufacturing W-1\r\n33 Processing of Integrated Circuits W-21\r\n34 Electronics Assembly and Packaging W-50\r\n37 Automation Technologies For Manufacturing Systems W-97\r\n40 Quality Control and Inspection W-170", "scorePolicy": "Participation 10%\r\nHomework 20%\r\nQuiz 30%\r\nMid term 20%\r\nFinal Exam 20%", "materials": "本課程教學  將輔以大量的線上影音教材及翻譯軟體。  並含組裝實作。\r\nGroover, Mikell P.\r\nFundamentals of modern manufacturing: materials, processes and systems, 4th ed.", "foreignLanguageTextbooks": true}]