[{"name": "楊士萱", "email": "shyang@ntut.edu.tw", "latestUpdate": "2020-12-10 17:36:33", "objective": "This course Linear Algebra\r\n- is a mathematics course.\r\n- is useful and fundamental to CSIE (and many other discipline) students.\r\n- emphasizes both computations and concepts.\r\n- asks you to use mathematical software packages (MATLAB, Scilab, or GNU Octave).\r\n- guides you to read an English textbook.\r\n- requires hard work.\r\n本課程\r\n- 為數學課\r\n- 為資工領域(及許多其他專業領域)學生基礎課程\r\n- 計算與概念並重\r\n- 要求使用MATLAB, Scilab, 或 GNU Octave等套裝軟體\r\n- 引導同學閱讀英文教科書\r\n- 需要同學用功讀書", "schedule": "1. Matrix Operations (Sections 2.1 and 2.2) 矩陣運算\r\n- To learn basic matrix arithmetic operations: addition, subtraction, multiplication power, transpose, and inverse. 矩陣加、減、乘、乘方、轉置、反矩陣\r\n2. Linear Equations (Sections 1.1 to 1.5) 線性方程式\r\n- To understand the basic terminologies and notations of matrices and systems of linear equations, in the forms of vector equation and matrix equation. 線性聯立方程組、向量方程式、矩陣方程式\r\n- Solving a system of linear equations by reducing a matrix to its echelon form. 解線性聯立方程組、階梯型式\r\nTest #1\r\n3. Introduction to Linear Independence and Linear Transformation (Sections 1.7, 1.8, and 2.3) 線性獨立與線性轉換\r\n- First exposure to key concepts such as linear independence and linear transformation. 線性獨立與線性轉換初探\r\n- More about the matrix inverse. 更多有關反矩陣\r\n- To summarize the concepts for systems of n linear equations in n unknowns. 綜整n個變數n個線性方程式\r\nMidterm Exam\r\n3. Vector Spaces (Chapter 4) 向量空間\r\n- Introduction to vector spaces. 向量空間簡介\r\n- Fundamental subspaces of a matrix: column space, row space, and null space. 矩陣子空間：行空間、列空間、零空間\r\n- Basis and dimension of a vector space. 向量空間的基底和維度\r\nTest #2\r\n4. Eigenvalues and Eigenvectors (Chapter 5) 特徵值與特徵向量\r\n- To understand the meaning of eigenvalues and eigenvectors of a matrix, and the approaches to find them. 矩陣特徵值與特徵向量的意義與計算方式\r\n- Diagonalization of a matrix (linear transformation). 矩陣的對角化\r\n5. Orthogonality and Orthogonal Bases (Chapter 6) 正交性與正交基底\r\n- To introduce inner product of vectors, and thus the geometric concepts of length, distance, and angle (perpendicularity). 向量內積，長度、距離、角度(垂直)\r\n- To be familiar with the use of orthogonal bases. 正交基底\r\n- Least-Squares approximation. 最小平方估計\r\nFinal Exam", "scorePolicy": "1. In-class attendance/practice and quizzes, 15%.\r\n2. Written exercises, 15%.\r\nHand in your homework before Thursday’s class. The lowest score will be discarded. \r\nTA class attendance/performance, 5%.\r\n3. Programming assignments and MATLAB/Scilab projects, 15%. Submit commands, results, and discussions through 北科i學園.\r\n4. Two 50-minute tests, 10% each. (20%)\r\n5. Midterm exam and final exam, 20% each. (40%)\r\n本課程原則上不接受期中撤選，請非本班同學三思後再加選，另人數不得超過教室容量。\r\n\r\nClassroom Rules (上課規範):  “尊重自己、也尊重他人學習的權益”\r\n1. 請準時上課，不遲到早退。\r\n2. 非經允許，上課時不可使用手機、平板、筆電等電子用品。手機請關機或調成靜音。\r\n3. 上課時請專心於此課程之學習，非討論時間請避與他人交談。\r\n4. 如有短暫急事，得在不影響他人上課的情形自行離開教室，並請迅速回座。\r\n5. 如有事無法出席請盡量事先請假，並須有相關證明文件。\r\n6. 習題可討論但勿抄襲。\r\n7. 違反以上規範者，將視情節輕重扣分。", "materials": "Textbook (教科書): \r\nDavid. C. Lay, Stephen R. Lay, and Judy J. McDonald, Linear Algebra and its Applications, Fifth Edition, Pearson Education Limited, 2016. （偉明書局代理）\r\nGood References (參考書):\r\n1. Introduction to Linear Algebra with Applications by J. Defranza and D. Gagliardi. \r\n2. Elementary Linear Algebra by Howard Anton. \r\n3. Linear Algebra and Its Applications by Gilbert Strang.", "foreignLanguageTextbooks": true}]