[{"name": "張素薰", "email": "shchang@ntut.edu.tw", "latestUpdate": "2020-08-24 15:22:13", "objective": "本課程利用新聞教材加強英語字彙能力及聽力技巧, \t內容採用電台、報紙、電視的時事、深度報導和全球議題以增強學生英語知識。同時, 學生亦可獲得各種有用的聽力技巧以加強英語聽力。\r\nThis course is designed to increase vocabulary power and develop listening skills in English through up-to-date news. Current events, in-depth reports as well as global issues from radio, newspapers and T.V are provided to enrich the student's English knowledge. Effective listening skills are reinforced to enhance the student's listening comprehension.", "schedule": "Journalistic English & Listening Training\r\nI.\tIntroduction:\r\nThis course is designed to fortify English listening and speaking abilities by exploring different aspects of the contemporary themes in which vocabulary build-up and its application to relevant topics are emphasized. Current events, in-depth reports as well as global issues from radio, newspapers and T.V are provided. \r\nBasic Doctrines:\r\nExpose students to cosmopolitan themes that are up-to-date, sophisticated and varied in tone, with a view to stimulating students more profoundly and to accelerating their retaining and using in the target language.\r\nThe films of contextually rich—cultural background and competent knowledge-related to the corresponding themes are provided to integrate the skills of the target language.\r\nLanguage capability and performance are equally stressed and developed.\r\nStudents’ active participation is essentially required.\r\nIndividual reflection is perceived by pair and group works, out-of-class assignments for review and research, oral reports and specific presentations.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nSyllabus for 4E1 Multimedia English Listening and Speaking,\r\n2020(1)一零九學年度第一學期\r\nWeek\tModern Family\tFTVN News\tLanguage Skills\r\n1\tIntroduction\r\n2\tPilot (1)\r\nLGBT couples reveal daily struggles they battled when living normal lives (2019/08/04)\t\r\n3\tThe Bicycle Thief (2)\r\nTaipei mayor blasted over YouBike upgrade plan (2020/06/19)\tFinding Faults\r\n4\tCome Fly with Me (3)\r\nEntrepreneurs hoping to cash in on unmanned shops (2018/07/06)\tYour Talk\r\n5\tThe Incident (4)\r\nResearchers developing wearable sensors that can detect depression (2019/04/23) \tThe Importance of Nonverbal Communication\r\n6\tCoal Digger (5)\r\nA guava a day can protect against 18 sausages (2019/11/12) \tRadio Commercial, 1.5-2ms, group work\r\n7\tRun for Your Wife (6) \r\n36% of high school seniors are severely nearsighted: study (2019/06/21)\tSelf-examination\r\n8\tEn Garde (7)\r\nNumber of China-bound high school grads grows exponentially (2018/05/23)\tOutline Delivery\r\n9\tPowerPoint Presentation concerning sale products, 2-2.5ms per person\r\n10\tGreat Expectations (8)\r\nDevelopers roll out smart speaker to help insomniacs get to sleep  (2019/05/09)\tManuscript Delivery\r\n11\tFizbo (9)\r\n‘Silent carriers’ of coronavirus less contagious than severe cases: doctor (2020/01/31)\tImpromptu Delivery\r\n12\tUndeck the Halls (10) \r\nTaoyuan International Airport holds Christmas “flash mob” performances for travelers (2017/12/18)\tAccent Presentation, 4-5ms, group work\r\n13\tUp All Night (11) \r\nMajor hospitals ordered to reduce numbers at outpatient clinics (2018/07/02)\tThe Voice\r\n14\tNot in My House (12) \r\nWHO recognizes gaming addiction as a mental health condition (2016-06/19)\tClarity\r\n15\tFifteen Percent (13)\r\nFirst phase of straw ban to start July 1 (2019/05/01)\tDubbing, 3-4ms, group work\r\n16\tMoon Landing (14)\r\nNew law allows life sentence for repeat drunk drivers who cause fatal crash (2019/05/31)\tSelf-evaluation\r\n17\tGroup PowerPoint Presentation concerning world issues, 10-12 minutes\r\n18\tFinal Report\t\tWord Meaning", "scorePolicy": "II.\tAssessment:\r\n1.\tWeekly tests and Attendance 80% (-2 for each absence, 20 points maximum deduction). \r\n2.\tOral reports and presentations. 20%\r\n\r\n\r\n\r\nIII.\tThe way to get into contact with the teacher:\r\nTeacher’s e-mail: shchang@ntut.edu.tw", "materials": "handouts", "foreignLanguageTextbooks": false}]