[{"name": "黃如瑩", "email": "vinia@ntut.edu.tw", "latestUpdate": "2020-06-15 00:07:27", "objective": "當代英美流行小說,例如:帶珍珠耳環的少女,時空旅人之妻,姊姊的守護者,暮光之城系列等等,主題推陳出新,內容扣人心弦,有的反應當前的文化議題,有的表現出創新的文學想像,在在都激發著同學們閱讀原文小說的興趣.又由於小說的書寫語言為當今英語世界所使用,沒有年代隔閡,所以原文流行小說也是優良的英語學習材料.在字彙,片語,句型,段落及文章結構,到故事情節發展與深入探討主題的每個層面上,都提供了豐富的素材,供同學們學習觀摩.因此,本課程將挑選不同類型之時下英美流行小說,規劃進度,在課堂上進行導讀與討論,並加強字彙,句型,與文章結構上的分析,幫助同學們在英語書寫,閱讀技巧,跨文化了解與思辨能力上,獲得最大的進步!\r\nContemporary popular novels originally written in English, such as the Girl with a Pearl Earring, the Time Traveler's Wife, and the Twilight, have a strong appeal to readers worldwide, but non-native English speakers often enjoy these works in translated versions or film adaptations.  To encourage our students to read these popular English novels in the original language, the instructor will choose four novels of various subject matters and use them as effective teaching materials in the classroom. The objectives are (1) to enrich students' cultural background knowledge of the English speaking world today, (2) to cultivate students' life-long reading habit of keeping up contemporary materials, and (3) to strengthen their critical thinking as well as language skills, especially reading and writing, through line-by-line close readings in the context and guided discussions on the narrative structures of the whole fiction.", "schedule": "I. Required text: The Goldfinch\r\nII. Syllabus :\r\nWeek 1: Introduction, the Best Offer \r\nTheme One: Going through the labyrinth \r\nWeek 2: The Giver  by Lois Lowry \r\nWeek 3: The Maze Runner  by James Dashner\r\nWeek 4: The Hunger Games  by Suzanne Collins\r\nWeek 5: The City of Amber  by Jeanne DuPrau\r\nTheme Two: Solving the Mystery  \r\nWeek 6: Sherlock Holmes and John Watson  by Authur Conan Doyle\r\nWeek 7: The Girl with the Dragon Tatoos  by Stieg Larsson\r\nWeek 8: The Girl with the Pearl Earring by Tracy Chevalier\r\nWeek 9 (Mid-term exam week): Gone Girl  by Gillian Flynn\r\nTheme Three:  Looking for the Self \r\nWeek 10: The Perks of Being a Wallflower  by Stephen Chbosky\r\nWeek 11: The Help  by Kathryn Stockett\r\nWeek 12: Alice in the Wonderland by C. S. Lewis\r\nWeek 13: The Golden Compass by Philip Pullman\r\nWeek 14: The Kite Runner  by Khaled Hosseini\r\nTheme Four: Love and Passion\r\nWeek 15: Stardust  by Neil Gaiman\r\nWeek 16: The Book Thief  by Markus Zusak\r\nWeek 17:  The Time Traveler's Wife  by Audrey Niffenegger\r\nWeek 18 (Final examination week): Wrapping up", "scorePolicy": "1. Presence and participation in classroom discussion: 40%\r\n2. Homework and tests: 30%\r\n3. In-class oral presentation: 15%\r\n4. Final paper: 15%", "materials": "I. The main text: The Goldfinch\r\nII. Basic reference books:\r\n(1)一生必讀的英文小說:經典與大眾小說導讀賞析. 陳超明 著. 台北: 聯經 出版, 2011年.\r\n(2)一本讀通世界文學名著. 王淑絹 譯.台北: 商周出版社, 2010年.\r\n(3)小說的五十堂課. 大衛.洛吉 著.  李維拉 譯. 台北: 木馬, 2006年\r\nIII. General reference books:\r\n1. Good Chats (3rd edition),by Sandsberry, Sorenson, and Ring. Taipei: Bookman, 2008.\r\n2. Essential Idioms in English (New Edition), by Dixson. New York: Pearson Education, 1994.\r\n3. Dictionary of Idioms, by Terban.  New York:  Scholastic, 1996.\r\n4.Idioms Made Easy:  Stories of Selected English Idioms. By Tseng and Kao. Taipei: Bookman, 2004.", "foreignLanguageTextbooks": true}]