[{"name": "李志鴻", "email": "cl4e@ntut.edu.tw", "latestUpdate": "2020-06-14 20:13:54", "objective": "本課程以機械製造結合工業4.0技術為主，包括近代製造技術概論、E化製造、物聯網基本介紹、巨量資料於製程優化的應用、智慧型演算之原理與應用、機器視覺檢測應用、彈性製造系統、網宇實體系統、智能化工廠應用實例、應用APP撰寫等，增進學生對現代製造技術內容之理解、內化、與判斷應用能力，並加強工業4.0相關最新科技之介紹與應用，以期培養對應用聯網技術、大數據、雲端運算、及人工智慧於製造相關課題有技術與能力之工程師。除了課堂講解外，有將近二分之一的時數將採用Arduino套件進行實作教學法。修課學生請自備筆記型電腦。\r\nThis course is based on integration of mechanical manufacturing and industry 4.0, which is made of the modern manufacturing, the computational manufacturing,the internet of things, the optimization of manufacturing using big data, the intelligent calculation, machine vision measurement, flexible manufacturing, CPS system, smart factory, APP, etc.. This course can improve student’s knowledge of modern manufacturing, judgment, and industry 4.0, which will further create engineers with networking technology, big data, cloud calculation, and artificial intelligence in manufacturing. About half of the hours will be implemented using the Arduino kit. Students who take classes should bring their own laptops.", "schedule": "週次(堂次)\t課程主題\t內容說明\r\n1\t自動化製程與企業管理\t近代製造技術概論、電腦輔助設計/分析/製造/檢驗/規劃\r\n2\t自動化製程與企業管理\t經典製造、精實製造、電腦整合製造程序(CIM)、彈性製造系統(FMS)\r\n3\t自動化製程與企業管理\tE化製造-企業資源計畫(ERP)、製造執行系統(MES)、智慧維護系統(IMS)\r\n4\t自動化製程與企業管理\tERP與MES 導入實務探討、優劣分析與未來趨勢\r\n5\t物聯網-大數據-智慧演算\t物聯網基本介紹、通訊架構及優劣分析、雲端服務架構、網路資安問題\r\n6\t物聯網-大數據-智慧演算\t巨量資料擷取、儲存、與管理、製程優化的應用、故障診測與健康管理技術(PHM)\r\n7\t物聯網-大數據-智慧演算\t智慧型演算之原理與應用-最佳化、模糊運算\r\n8\t物聯網-大數據-智慧演算\t智慧型演算之原理與應用-決策樹、類神經網路演算、機器學習\r\n9\t期中實作測驗\t\r\n10\t機器人與機器視覺\t機器視覺系統架構與工作原理\r\n11\t機器人與機器視覺\t基礎數位影像處理與圖形識別\r\n12\t機器人與機器視覺\t工業用機器人\r\n13\t虛實融合系統\tCPS基本介紹、價值創造、限制與發展趨勢\r\n14\t虛實融合系統\t智慧產品、資料創值設計與實現、新型創價商業模式系統分析\r\n15\t業師經驗分享\t機器視覺檢測分類(矽格公司)\r\n16\t業師經驗分享\t物聯網導入生產特色分析(西門子)\r\n17\t業師經驗分享\t創新生產模式(台中精機)\r\n18\t期末專題報告", "scorePolicy": "單元測驗: 40%\r\n出席率:15%\r\n期中實作測驗: 20%\r\n期末測驗: 25%", "materials": "https://www.arduino.cc/\r\nhttps://nodered.org/\r\n電腦圖像式導師系統\r\n工業4.0理論與實務/全華\r\n工業大數據/天下", "foreignLanguageTextbooks": false}]