[{"name": "張素薰", "email": "shchang@ntut.edu.tw", "latestUpdate": "2020-08-24 15:23:57", "objective": "本課程利用新聞教材加強英語字彙能力及聽力技巧, \t內容採用電台、報紙、電視的時事、深度報導和全球議題以增強學生英語知識。同時, 學生亦可獲得各種有用的聽力技巧以加強英語聽力。\r\nThis course is designed to increase vocabulary power and develop listening skills in English through up-to-date news. Current events, in-depth reports as well as global issues from radio, newspapers and T.V are provided to enrich the student's English knowledge. Effective listening skills are reinforced to enhance the student's listening comprehension.", "schedule": "Journalistic English & Listening Training\r\nI.\tIntroduction:\r\nThis course is designed to fortify English listening and speaking abilities by exploring different aspects of the contemporary themes in which vocabulary build-up and its application to relevant topics are emphasized. Current events, in-depth reports as well as global issues from radio, newspapers and T.V are provided. \r\nBasic Doctrines:\r\nExpose students to cosmopolitan themes that are up-to-date, sophisticated and varied in tone, with a view to stimulating students more profoundly and to accelerating their retaining and using in the target language.\r\nThe films of contextually rich—cultural background and competent knowledge-related to the corresponding themes are provided to integrate the skills of the target language.\r\nLanguage capability and performance are equally stressed and developed.\r\nStudents’ active participation is essentially required.\r\nIndividual reflection is perceived by pair and group works, out-of-class assignments for review and research, oral reports and specific presentations.\r\n\r\n\r\n\r\nII.\tAssessment:\r\n1.\tWeekly tests and Attendance (20 points maximum deduction). 80%\r\n2.\tOral reports and presentations. 20%\r\n3.\tTeacher’s website: https://myweb.ntut.edu.tw/~shchang/2019/\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nSyllabus for 4E1 Multimedia English Listening and Speaking, \r\n2019(1)一零八學年度第一學期\r\nWeek\tClassification \tEnglish News\tFriends (S1)\r\n1\tIntroduction\r\n2\tHealth\t1. AI offers new promise for women who want to conceive (2019/07/17)\t1\r\n3\t\t2. Beware BPA on store receipts, physician warns (2019/05/31)\t2\r\n4\tTechnology\t3. A video camera that measures heart rate, blood pressure using only your face (2019/06/10)\t3\r\n5\t\t4. Developers roll out smart speaker to help insomniacs get to sleep  (2019/05/09)\tStage Play\r\n6\tBusiness\t5. New rules to prohibit gift certificates from carrying expiry date (2019/04/25)\t4\r\n7\t\t6. Taiwan rental index on the rise for 51 months in a row: government (2019/04/11)\t5\r\n8\tLife\t7. Michelin guide’s Bib Gourmand recognizes 24 Taipei street stalls (2019/04/03)\t6\r\n9\t\tMid-term\r\n10\t\t8. Agriculture authorities on watch for invasion of fall armyworms (2019/06/11)\t7\r\n11\tSociety\t9. New law allows life sentence for repeat drunk drivers who cause fatal crash (2019/05/31)\t8\r\n12\t\t10. Taiwan places South Korea travelers on watch list for African swine fever outbreak (2019/05/31)\t9\r\n13\tEnvironment\t11. First phase of straw ban to start July 1 (2019/05/01)\tDemonstration\r\n14\t\t12. Experimental dengue fever antibody shows promise in animal tests (2019/06/27)\t10\r\n15\tTraffic\t13. Refund hassle: Cheap airfare could be more hassle than it’s worth (2019/06/20)\t11\r\n16\t\t14. Manhole covers to get makeover to make them less slippery (2019/06/19)\t12\r\n17\t\tPowerpoint Presentation\r\n18\tFinal Report\r\nEvaluation:\r\n1.\tWeekly Tests and appearance, one absence being reduced two points. 80%\r\n2.\tPresentations and Reports. 20%", "scorePolicy": "II.\tAssessment:\r\n1.\tWeekly tests and Attendance 80% (-2 for each absence, 20 points maximum deduction). \r\n2.\tOral reports and presentations. 20%\r\n\r\n\r\n\r\nIII.\tThe way to get into contact with the teacher:\r\n1. .\tTeacher’s e-mail: shchang@ntut.edu.tw", "materials": "handouts", "foreignLanguageTextbooks": false}]