[{"name": "杜敏誠", "email": "mtu@ntut.edu.tw", "latestUpdate": "2020-09-10 17:33:17", "objective": "多數人類聚落皆與大河為鄰，故疏濬河道以減少洪水之機率與強度為傳統治水之一重點。然而，傳統水泥化之治水方式，除了破壞景觀之外，也嚴重破壞河道原來所能提供之生物棲地。生態工法為一新興之學門，期能以自然之材質配合河道之自然水文變化趨勢，達成防洪，造景，休憩，與生態維護之多重目的。本課程將先從歷史的角度切入簡述各國之河川整治工程演進。接著，由於河溪生態工法必須配合河川水文之自然變化趨勢，河川地貌學(fluvial geomorphology)將在課程中被討論。在學生具有上述基礎概念之後，由於河溪生態工法為一新興學門，本課程將繼續介紹河溪生態工法之各種思維，執行方式，與執行步驟。最後，世界各國與台灣地區的數個河溪生態工法案例將被介紹給學生，以供學生對河溪生態工法能有適當之實踐概念。\r\n\r\n本課程之書寫語言將以英文材料為主。所有授課與口頭溝通將混合英文與中文進行。\r\n\r\nMost human settlements were close to rivers. Therefore, modifying river channels to reduce the chance and magnitude of floods has been the main focus of conventional ways to tame rivers. However, the traditional ways of cementing river channels destroy natural habitats and are not aesthetically pleasing. Fluvial ecological engineering is a new field, which achieves the purposes of flood prevention, landscaping, recreation, and ecological conservation by using natural materials and following natural hydrological trends of rivers. The course will first introduce the evolution of river engineering throughout history. Because ecological engineering has to conform with the natural trend of river evolving, principles of fluvial geomorphology will be then introduced in the class. After students have these basic understandings, the course will continue on introductions of concepts, methods, and procedures. Field cases of fluvial ecological engineering in Taiwan as well as other countries will be introduced to students.\r\n\r\nThe written language of the course will be mainly English. All lecturing and oral conversation will be a mixture of English and Mandarin.", "schedule": "以下進度為預測，可能與實際不同。\r\nWeek 1 (9/16-17): 教師與學生自我介紹，介紹課程，釋疑，河川整治之歷史\r\nWeek 2 (9/23-24): 河川整治之歷史\r\nWeek 3 (9/30-10/1): 河川地貌學，中秋假期\r\nWeek 4 (10/7-10/8): 河川地貌學\r\nWeek 5 (10/14-10/15): 河川地貌學\r\nWeek 6 (10/21-22): 河川地貌學，生態工法類型與執行方式\r\nWeek 7 (10/28-29): 生態工法類型與執行方式\r\nWeek 8 (11/4-5): 生態工法之設計步驟，第一次口頭報告\r\nWeek 9 (11/11-12): 第一次口頭報告\r\nWeek 10 (11/18-19): 簡報技巧，生態工法設計步驟\r\nWeek 11 (11/25-26): 生態工法設計步驟\r\nWeek 12 (12/2-3): 世界案例介紹\r\nWeek 13 (12/9-10): 世界案例介紹\r\nWeek 14 (12/16-17): 台灣案例介紹\r\nWeek 15 (12/23-24): 期末測驗，期末報告\r\nWeek 16 (12/30-31): 期末報告\r\nWeek 17 (1/6-7): 期末報告，期末彙整\r\n\r\nTentative schedule:\r\nWeek 1 (9/16-17): Self-introductions, Introduction to the course, Q&A, History of river improvements\r\nWeek 2 (9/23-24): History of river improvements\r\nWeek 3 (9/30-10/1): Fluvial geomorphology, Mid-autumn break\r\nWeek 4 (10/7-10/8): Fluvial geomorphology\r\nWeek 5 (10/14-15): Fluvial geomorphology\r\nWeek 6 (10/21-22): Fluvial geomorphology, Types and procedures of fluvial ecological engineering\r\nWeek 7 (10/28-29): Types and procedures of fluvial ecological engineering\r\nWeek 8 (11/4-5): Design procedures of fluvial ecological engineering, the first oral report\r\nWeek 9 (11/11-12): The first oral report\r\nWeek 10 (11/18-19): Presentation skills，Design procedure of fluvial ecological engineering\r\nWeek 11 (11/25-26): Design procedure of fluvial ecological engineering\r\nWeek 12 (12/2-3): Case studies worldwide\r\nWeek 13 (12/9-10): Case studies worldwide\r\nWeek 14 (12/16-17): Taiwanese case studies \r\nWeek 15 (12/23-24): Final exam, Final report\r\nWeek 16 (12/30-31): Final report\r\nWeek 17 (1/6-7): Final report, Review of the semester", "scorePolicy": "教學方式: 本課程之進行方式將混合傳統課堂授課，短片，課堂討論，小組計畫，與小組口頭報告。課堂討論之表現作為期末加減分數之依據，故上課前請做好準備開口的準備。\r\n\r\n小組計畫: 同一組學生將於本課程中完成一小組計畫(project)，並於期末口頭報告其完成之計畫。小組計畫之題目將由學生自選，其可能為1) 檢討一已完成之河溪整治工程(無論成功或失敗)，並提出以生態工法為基礎之具體建議，2) 以一尚未整治之河溪為基礎，建立以生態工法為基礎之具體整治計畫。同組學生之小組計畫相關得分基本上將相同(於學期末同組組員間亦將互評作為分數調整之參考)。\r\n\r\n口頭報告: 分為兩階段。第一階段為學期中報告資料蒐集結果，第二階段為期末總報告。\r\n\r\n書面報告: 請模仿MDPI期刊格式撰寫書面報告，以中文或英文撰寫皆可。書面報告不限頁數亦不限字數，但撰寫者應確保內容之詳實度。內容段落可自由發揮，但至少應包括1) 河溪簡介，含水文，地質，歷史，人類活動，與周圍環境介紹等。2) 詳述對本計畫所作之資料收集結果及資料收集手段。3) 明述計畫之目標。4) 分析結果及建議，請包含必須之工程計算。5) 預算。估算可用任何資料庫之數字加以適當修改，但所有估算之數字皆須提供適當之依據或合理之論述。6) 結論，須具體討論本計畫建議之內容能為該河溪帶來何種正面效果，及其他未包含在計畫中之可改進項目。以上各項資訊亦應適當包含在於期末口頭報告中。\r\n\r\n期末測驗: 除一張A4大小之筆記紙(上面可預先寫好任何資訊)及工程用計算機(不可攜帶手機）之外，期末測驗為關書考試。\r\n\r\n5%\t組員名單與計畫簡介\r\n20%\t資料蒐集結果之口頭報告 (8%資料完整度，8%資料蒐集手段，4%報告技巧)\r\n25%\t期末測驗\r\n25%\t期末口頭報告 (5%版面設計，10%內容完成度，10%報告技巧)\r\n20%\t期末書面報告 (5%版面與繕打，5%財務估算與工程計算，10%內容論述完整度)\r\n5%\t不定時點名\r\n\r\nLecturing Style: The class will be taught by the combination of traditional lecturing, short movies, in-class discussions, team projects, and team oral presentations. In-class discussion will be the basis to add/subtract final grade, so please be prepared to participate in the discussions.\r\n\r\nTeam project: Students of each team will finish a team project and present their project at the end of the semester. Students have the freedom to choose their own projects, which can be 1) Review of a finished river improvement project (whether successful or not) and provide suggestions based on ecological engineering 2) Based on a river that has not been worked on, provide an improvement plan based on ecological engineering. Students of the same team will receive basically the same final grade for this part, with adjustment based on peer-review results.\r\n\r\nOral Presentation: Two steps. The first step is a presentation about data collection results in the middle of the semester, and the second step is the final presentation.\r\n\r\nWritten Report: Please draft the report using the MDPI journal format using either Chinese or English. There is no limit on the number of words or pages, but the students should make sure that the report contains enough details. There are no fixed requirements on sections in the report, but it should contain at least 1) Introduction to the river, including hydrology, geology, history, human activities, and environments 2) Efforts and results of data collection 3) Goal of the project 4) Results of analyses and recommendations, with necessary calculations 5) Budget, which can be modified from proper database information with proper reasoning 6) Conclusions, with predicted outcome of the project and other improvements that were not included in the project. Please include the necessary information from the above items in the oral presentation.\r\n\r\nFinal Exam: Students can bring an A4-size paper and an engineering calculator (no smartphones) to the exam, which will be close-book.\r\n\r\n5%\tSubmission of team members and project summary\r\n20%\tFirst oral report (8% Data completeness，8% Data collection efforts，4% Presentation skills)\r\n25%\t Final exam\r\n25%\tFinal oral report (5% Slide design，10% Details of contents，10%Presentation skills)\r\n20% Final written report (5% Format，5% Budget and engineering calculations，10% Completeness of contents)\r\n5%\tAttendances", "materials": "使用教師自行準備之教材\r\nMaterials prepared and summarized by the lecturer\r\n\r\n非必須: 林鎮洋，陳彥璋，吳明聖，(2004)，河溪生態工法，明文書局\r\nKnighton, D. (1998). Fluvial Forms & Processes. Hodder Education, London, UK.\r\n\r\nOptional: Lin, J. et al., (2004), Stream Ecological Engineering Methods, Mingwen Publishing.\r\nKnighton, D. (1998). Fluvial Forms & Processes. Hodder Education, London, UK.", "foreignLanguageTextbooks": true}]