[{"name": "楊元森", "email": "ysyang@ntut.edu.tw", "latestUpdate": "2020-06-12 17:16:20", "objective": "The rapid development and population of digital imaging hardware and algorithms bring high potential of computer vision and image measurement on practical applications. These applications can include but not limited to measurement, structural health monitoring, and safety identification. \r\n\r\nThis course not only introduces the theory of computer vision and image measurement, but also guides students to operate and implement structural experiments and measurement projects. Students are encouraged to bring up the concepts and theories, programming skills, experimental design and implementation, oral presentations, as well as experimental documentation and technical writing ability.", "schedule": "1. Overview: C++ basics. OpenCV installation. \r\n2. Introduction to Computer Vision and OpenCV: OpenCV samples, 2D transformation. \r\n3. General data types of images, matrices, and vectors: Row-wise format of matrix/vector. Channels of data. Memory operations in programming.   \r\n4. Basic vector and matrix operations. Matrix multiplication/inversion. Fourier transform. Normalization. \r\n5. 2D coordinate transformation. Formula. Rotation. Stretch. Warping.\r\n6. Image tracking. Template match. Optical flow. Enhanced correlation. \r\n7. Data filtering and convolution. \r\n8. 2D image analysis. Fourier transform. Edge detection. Hough transformation. \r\n9. Midterm\r\n10. 3D Coordinate transformation. 3-by-3 and 4-by-4 transformation matrix. \r\n11. Camera model and calibration. \r\n12. Point projection. \r\n13. Final project introduction.\r\n14. Final project proposal.\r\n15. Special topic 1\r\n16. Special topic 2\r\n17. Special topic 3\r\n18. Final project presentation.", "scorePolicy": "Midterm 25% +/- 5%\r\nAssignments 25%  +/- 5%\r\nFinal Presentation  25%+/- 5%\r\nFinal Report 25%+/- 5%", "materials": "Kaehler, A.; Bradski, G. (2016). Learning OpenCV 3 Computer Vision in C++ with the OpenCV Library, O'Reilly. ISBN: 978-1-491-93799-0.", "foreignLanguageTextbooks": true}]