[{"name": "洪祖全", "email": "tchung@ntut.edu.tw", "latestUpdate": "2020-09-15 22:08:34", "objective": "The students taking this lecture are preferred to have basic knowledge in thermodynamic properties, and the first and second laws of thermodynamics. By the end of the lecture, the concept of organic Rankine cycle will be emphasized herein because it can recover a certain amount of extra power from low-temperature, low-enthalpy heat by accompany of the environment temperature and appropriate using of working fluids. What the lecture will cover are:\r\n1. Brief review of Thermodynamics 2. Introduction of ORC 3. Difference from steam Rankine cycle 4. Selection in working fluid & System efficiency 5. Heat source and heat sink 6. System components design 7. ORC application 8. System optimization 9. ORC related issues of global warming, carbon tax, etc.\r\n我希望選修該課程的同學已經具備基礎熱力性質、以及熱力學第一及第二定理的基本知識。結束本課程之前，朗肯循環的觀念將會被強調，因為我們希望強調從低溫低焓熱源，搭配環境溫度以及適當流體的選用能夠產生某程度額外的動力。本課程將包括：\r\n1. 精簡熱力學複習；2. 有機朗肯循環（ORC）的介紹；3. 與蒸汽朗肯循環的區別；4. 流體的選擇與系統效率；5. 熱源與熱沉；6. 系統元件設計；7. ORC應用；8. 系統最佳化；9. 與ORC有關之溫室效應及碳稅的議題。", "schedule": "Week 1: Introduction to this class\r\nWeek 2~6: Brief review of Thermodynamics (5 weeks)\r\n  A. Briefly review the background of thermodynamic properties, first and second laws of thermodynamics.\r\n  B. Deeply figure out how Carnot cycle helps the promotion in the system performance and applications. Learn the conversion between T-s and P-v diagrams.\r\n  C. Understand Brayton gas cycle and implement the analyses by combining the concept of Carnot cycle to enhance the cycle efficiency. Similar concept can be employed in all other gas cycles.\r\n  D. Understand Rankine steam gas cycle and implement the analyses by combining the concept of Carnot cycle to enhance the cycle efficiency.\r\nWeek 7: Introduction of organic Rankine cycle (ORC) \r\nWeek 8: midterm and presenations\r\nWeek 9: Difference of ORC from steam Rankine cycle \r\nWeek 10~11: Selection in working fluid & System efficiency \r\nWeek 12: Heat source and heat sink \r\nWeek 13: System components design \r\nWeek 14: tour to related facility\r\nWeek 15: ORC application \r\nWeek 16: System optimization \r\nWeek 17: ORC related issues of global warming, carbon tax, etc.\r\nWeek 18: Final exam and presentations\r\n第1週：本課程的介紹\r\n第2～6週：\r\nA.\t基礎熱力性質、以及熱力學第一及第二定理的複習\r\nB.\t深入瞭解卡諾循環概念如何幫助與應用於系統效能之提升；T-s 與p-v圖的轉換\r\nC.\t應用卡諾循環概念於步雷登循環效率之提升\r\nD.\t應用卡諾循環概念於朗肯循環效率之提升\r\n第7週：有機朗肯循環（ORC）的介紹\r\n第8週：第一次期中測驗與口頭報告\r\n第9週：蒸汽朗肯循環與有機朗肯循環（ORC）的差異\r\n第10～11週：工作流體選擇與系統效率\r\n第12週：熱源與熱沉\r\n第13週：系統元件介紹與設計 \r\n第14週：觀摩相關設施\r\n第15週：ORC的應用\r\n第16週：系統最佳化\r\n第17週：與ORC有關之溫室效應及碳稅的議題\r\n第18週：期末測驗與口頭報告", "scorePolicy": "1. Presentations and reports\r\n2. Examinations\r\n3. Performance in the class\r\n4. Presence to the class\r\n1. 口頭報告，包括PPT與報告\r\n2. 筆試\r\n3. 課堂表現\r\n4. 出席狀況", "materials": "1. Tzu-Chen Hung, PPT lecture material \r\n2. \"Principles of Engineering Thermodynamics”– by Moran and Shapiro, John Wiley &Sons, Inc., Version 6, 2014.\r\n1. 授課教師自編PPT教材\r\n2. 書本：\"Principles of Engineering Thermodynamics”– by Moran and Shapiro, John Wiley &Sons, Inc., Version 6, 2014.", "foreignLanguageTextbooks": true}]