[{"name": "吳星佑", "email": "Andy810301@gmail.com", "latestUpdate": "2020-06-08 08:18:46", "objective": "光機系統應用極為廣泛，無論是天文、航太、軍事、醫療、半導體、加速器等高階系統，或講究快速與需價格競爭力之手機、車載、智慧監控等商品，皆仰賴札實的光學與機械知識以確立系統設計滿足需求。本課程內容特別挑選重要的光學與機械做解析外，搭配光學設計軟體、Matlab模擬以及應用實例以強化重要觀念，並使學生建立相關知解決工程問題與創新能力，並進一步確立興趣與發展方向為主要目標。\r\nOptical mechanical systems have changed the world and they will continue to do so. The course of optical machinery designed practice aims to be a solution provider for high-end customers in astronomy, aerospace, military, accelerator, and medicine. Also the knowledge can satisfy mass production industries of mobile, automobile, and machine vision. To meet that need, not only does the course introduce core knowledge in optics and mechanics but also practice modeling and case studies to enhance the capability of problem solving and innovation. The subject makes possible to initiating students’ interest in the optical mechanical industry so as to make it as their future careers.", "schedule": "18周將介紹：\r\n1. 理想系統，2. 現實像差系統，3. 鏡片與繞射元件，4. 光學玻璃材料特性、與5. 照度學，並同時補充相關實例模擬與分析，如：6. 光學評價及光學檢測、7. 光學元件製造上的限制、8. 光學元件及系統的製圖、9. 光學系統的公差分析、10. 變焦鏡頭光學設計、11. 變焦鏡頭凸輪軌跡、12. 天文望遠鏡防眩板設計、與13. 鏡頭雜散光造成的glare及flare(部分課程與林世穆老師合授)。並在後續課程視進度補充14. 雷射、15. 偏光、16. 非線性光學、17. 晶體光學等知識。第18.週期末考繳交報告與上台報告。\r\n######\r\nThis semester will introduce ：1. ideal systems, 2. real systems, 3. optical and diffraction elements, 4. optical materials, 5. photometry and radiometry. Modeling and practice courses include 6. assessment of optical systems, 7. Zoom Lens principles 8. Zoom Lens Cam 9. Telescope Baffle design 10. tolerance analysis, 11. stray light analysis. (Parts of lectures with Prof. S.M. Lin). Further time will introduce 12. Optical element drawing 13. Evaluation for optical system 14. Laser, 15. polarization, 16. nonlinear optics, and \r\n17. crystal optics . 18. Final report and oral presentation.", "scorePolicy": "(1)課程參與40%(2)提問10%(3)期末報告20%(4)期末上台報告30%。\r\nclass attendance (40%). question asking (10%). report (20%) and oral presentation(30%) for final.", "materials": "1. Malacara: Geometrical and Instrumental Optics, Academic Press 1988\r\n2. Mahajan: Optical Imaging and Aberrations\r\n3. Mouroulis/McDonald: Geometrical Optics and Optical Design Oxford 1997\r\n4. WelfordAberrations of Optical Systems, Hilger 1986\r\n5. Fischer/Tadic-GalebOptical System Design, McGraw Hill 2000\r\n6. Kingslake/Johnson: Fundamentals of optical design\r\n7. Smith: Modern Optical Engineering, Graw Hill 2000\r\n8. Goodman: Introduction to Fourier Optics,Wiley 2005\r\n9. lecture notes from University College London, University of Jena, University of Arizona, Imperial College London", "foreignLanguageTextbooks": false}]