[{"name": "郭政淳", "email": "kuojona@gmail.com", "latestUpdate": "2020-07-27 14:59:38", "objective": "本課程提供學生及職前專業人士必備之英語文語言技巧，強調電資專業領域之英文溝通能力之訓練。課程內容依學院專業內容區分並整合英語文之聽說讀寫之能力為未來全球化移動及以英語專業溝通人才培育為目標。\r\nThis course aims to provide pre-service Electrical Engineering and Computer Science students/professionals with the adequate skills of the English language and communicative competence to facilitate their current academic and future career pursuits. Students are encouraged to utilize their domain expertise to participate in professional communication in English. Centered on the training of professional use of the English language, the ESP curriculum as the crux of a highly-integrated work of domain knowledge and the English learning development embodies the indispensable credentials required for a global profession.", "schedule": "Week1    Course Introduction\r\nWeek2    What is Engineering? What is Computer (Science)?\r\nWeek3    5G gets real (Book 1, Lesson 1)\r\nWeek4    Internet Messages (Book 1, Lesson 5)\r\nWeek5    Mis/Disinformation Online (in the time of COVID-19)\r\nWeek6    Presenting Visual Aids (I): Introducing Graphs\r\nWeek7    Presenting Visual Aids (II): Describing Moves and Trends\r\nWeek8    Formal Presentation (I): Graphs\r\nWeek9    Midterm Exam-No Class\r\nWeek10   Writing Emails: Format and Organization \r\nWeek11   Writing Emails: Grammar and Key phrases\r\nWeek12   3C products: Home appliances (Book 2, Lesson 1)\r\nWeek13   3C products: PC and Parts \r\nWeek14   3D without Four Eyes (Book 2, Lesson 6)\r\nWeek15   Presentation Format: TED Talks and Three-Minute Thesis\t\r\nWeek16   Presentation Tips: Important Messages \r\nWeek17   Formal Presentation (II): Novel Ideas\r\nWeek18   Recapitulation", "scorePolicy": "Attendance: 15%\r\nHomework: 15%\r\nQuizzes: 20% \r\nExams: 30%\r\nStudent Presentation: 20%", "materials": "北科之英 ESP Series for College of Electrical Engineering and Computer Science", "foreignLanguageTextbooks": false}]