[{"name": "陳岡伯", "email": "kpchen@ntut.edu.tw", "latestUpdate": "2020-09-15 16:01:50", "objective": "本課程將帶領學生學習英文文法、型態、及段落的基本技巧。學生可以運用這些技巧來寫出關於新聞及網路時事的短評。學生在本課程中需要寫出多種英文句型正確的語句以及各種類型的短評，如其他國家、全球化、商業、政治等。學生可以運用這些技巧而獨立寫出任何主題的英文文章。\r\nIn this course students will be introduced to fundamental rules of English grammar, style, and paragraphing; students will apply those skills to short writings about current events in the news and from the internet. The course will require students to write a variety of syntactically sound English sentences and types of paragraphs about other countries, globalism, business, politics, and so on. These skills will then be useful for the student to be able independently to produce English prose on any subject.", "schedule": "Week 1 Introduction to the course\r\n             Reading: \"Green Card Lottery\" (New in Levels)\r\n\r\nTheme 1: Culture\r\n\r\nWeek 2  Reading: \"Tom Hanks on surviving coronavirus\" (The Guardian)\r\n             Writing: the paragraph and topic sentence (EAW p. 3-5)\r\nWeek 3 Reading: “Eddie Redmayne speaks out against JK Rowling’s trans tweets” (BBC News)\r\n             Grammar: run-on sentences, dependent clauses (EAW p. 20-22)\r\nWeek 4 Reading: “Chadwick Boseman: Tributes pour in for Black Panther actor” (BBC News)\r\n             Writing: unity (EAW p. 9-12)\r\n\r\nTheme 2: Politics\r\n\r\nWeek 5 Reading: “China is rewriting the facts about Covid-19 to suit its own narrative” (The Guardian)\r\n             Writing: coherence (EAW p. 12-13)\r\nWeek 6 Reading: “Pulling down statues? It’s a tradition that dates back to U.S. independence” (National Geographic)\r\n             Writing: the paragraph and the short essay\r\nWeek 7 “Hong Kong protestors flee to Taiwan to continue China resistance” (The Guardian)\r\n             Grammar: prepositional phrases and details (EAW p. 38-40)\r\nWeek 8 “Fearing Hong Kong’s Fate, Taiwan Moves to Bolster Its Military Against China” (Wall Street    \r\n              Journal)\r\n             Grammar: simile (EAW p. 40-41)\r\nWeek 9 Mid-term exam\r\nWeek 10 Reading: “The Guardian view on Facebook and democracy” (The Guardian)\r\n              Grammar: using adjectives (EAW p. 43-46)\r\n\r\nTheme 3: Sports\r\n\r\nWeek 11 Reading: “The worst way to handle the Kobe Bryant rape case” (The Washington Post)\r\n              Writing: opinion essay (EAW p. 108-112)\r\nWeek 12 Reading: “The Debate that Won’t Go Away: Equal Prize Money at Wimbledon” (Bleacher Report)\r\n              Writing: opinion essay (EAW p. 113-118)\r\nWeek 13 Film viewing: Battle of the Sexes (2017)\r\n             \r\nTheme 5: Science\r\n\r\nWeek 14  “The pioneering surgeons who cleaned up filthy hospitals” (BBC)\r\n              Grammar: expressions, connectors (EAW p. 119-121)\r\nWeek 15 Reading: “Every dog year not equivalent to seven human years, scientists find” (The Guardian)\r\n              Writing: academic style, citation, reference and how to avoid plagiarism (handouts)\r\nWeek 16 Reading: “Love of science, not Trump’s ignorance, will make America great again” (The Guardian)\r\n               Group presentation\r\n\r\nWeek 17 Group presentation\r\n\r\nWeek 18 Final exam", "scorePolicy": "Participation (20%)\r\nParticipation includes attendance and in-class performance. In-class performance includes raising questions to the instructor, answering questions in class exercises, offering comments and insights regarding class content, and responding to other students’ contribution.\r\n*points will be taken from the second absence on\r\n\r\nOral presentations (20%)\r\nThere will be one group oral presentations. There should be 4 or 5 students in each group. After the 6th week, students will be asked to choose their teammates and in the 7th class all groups will draw their topics, which include politics, business, technology, culture and sport. Each group should choose a news article related to the topic drawn and make a presentation (20-25 minute). In the presentation, each group should 1) give a summary of the article 2) explain key terms or vocabularies, and 3) raise an interesting question and present critical opinions. Adequate visual aids should be employed, such as Powerpoint slides. In each group, students should decide by themselves who will be responsible for which part of the presentation, on a basis of equal contribution. \r\n\r\nWritten assignments (20%)\r\nThere will be one written assignments: a three-paragraph opinion essay (about 300 words). Students can choose their topics freely. The topic is due in Week 11; outline in Week 13; essay in Week 16. \r\n\r\nIn-class examinations (20%)\r\nThere will only be two written exams that takes place Week 9 and Week 18. The exam will include the vocabularies covered in the reading material and the exercises covered in the writing textbook (EAW). The exams will not be difficult, so it is a great chance to enhance your final grade!\r\n\r\nJoint exam (20%)", "materials": "Savage, Alice and Patricia Mayer. Effective Academic Writing 2: The Short Essay. \r\n     Oxford UP, 2005.\r\n\r\nHandouts distributed by the instructor", "foreignLanguageTextbooks": true}]