[{"name": "陳岡伯", "email": "kpchen@ntut.edu.tw", "latestUpdate": "2020-09-15 16:03:44", "objective": "本課程著重教導學生閱讀文章，並藉由文章訓練學生字彙建構、語言解析及聽力會話、思維啟發能力。課中延展活動將閱讀內容與聽力、會話、寫作做進一步的連結，並引導學生將所學做有效的應用。\r\nThe course provides students with explicit skills-based instruction in learning how to process, and decipher the readings that serve as springboards for reading skills development, vocabulary building, language analysis, and thought-provoking discussions. The readings include a variety of viewpoints on global topics centered around social issues, the environment, psychology, business, and technology. Extension activities are designed to encourage students to go beyond the reading text, and to put what they acquire from the readings into listening, speaking and writing practices.", "schedule": "Week 1: Introduction to the course\r\n\r\nWeek 2: 1A Show your emotions\r\n             1B “Why do people smile?”\r\n             Learning from film dialogue: Inside Out (2015)\r\n\r\nWeek 3: 1C A Breath of Fresh Air\r\n              1D “I want to bring emotions back into our digital experiences”\r\n             1E The Feel-Good Factor\r\n\r\nWeek 4: 2A Getting from A to B\r\n             2B ““Urbexers: Life on the Edge of the City”\r\n             Learning from film dialogue: Runaway Jury (2003)   \r\n\r\nWeek 5: 2C Sydney on $20\r\n             2D “If you think that adventure is dangerous, try routine. It’s deadly”\r\n             2E You can't miss it\r\n\r\nWeek 6: 3A Pushing the Limits\r\n             3B “Can Sports Protect Africa’s Lions?”\r\n            Learning from film dialogue: Pride and Prejudice (2005)\r\n\r\nWeek 7: 3C Marathon Men and Women\r\n             3D How I Swam the North Pole\r\n             3E School Sports\r\n\r\nWeek 8: 4A Learning to Cook\r\n             4B “World Food Blog”\r\n             Learning from film dialogue: The Human Stain\r\n\r\nWeek 9: Midterm exam\r\n\r\nWeek 10: Film viewing: to be decided by voting (from the four films covered in previous classes)\r\n\r\nWeek 11: 4C Feed the world with…bugs?\r\n               4D Why I’m a Weekday Vegetarian\r\n              4E Future Plans\r\n\r\nWeek 12: 5A New Ways of Working\r\n               5B “A Real-Life, Crime-Fighting Superpower!”\r\n              Learning from Film dialogue: Little Women (2019)\r\n\r\nWeek 13: 5C Job Evolution\r\n               5D Why the Best Hire Might Not Have the Perfect Resume\r\n              5E Going for the Job\r\n\r\nWeek 14: Discussion of the extra article (to be decided)\r\n               Learning from film dialogue: The Two Popes (2019)\r\n\r\nWeek 15: Film viewing: to be voted by students (Little Women or The Two Popes)\r\n\r\nWeek 16: Group presentation\r\n\r\nWeek 17: Group presentation\r\n\r\nWeek 18: Final exam", "scorePolicy": "Participation (20%)\r\nParticipation includes attendance and in-class performance. In-class performance includes raising questions to the instructor, answering questions in class exercises, offering comments and insights regarding class content, and responding to other students’ contribution.\r\n*points will be taken from the second absence on\r\n\r\nOral presentations (30%)\r\nThere should be 4 or 5 students in one group. Each group have 25 minutes to introduce a film. The presentation should consist of the following three parts: \r\n1.\tBasic information, such as release date, director, main cast, and plot. \r\n2.\tWhy is the film chosen? What’s so interesting about it?\r\n3.\tSelect and introduce a scene, play the clip (from YouTube, Netflix or DVD), and do a short performance of voice acting of this scene.\r\n4.     Raise 1 or 2 interesting questions for class discussion\r\n*In each group, students should decide by themselves who will be responsible for which part of the presentation, on a basis of equal contribution. \r\n\r\nExaminations (30%)\r\nThere will be two written exams that take place in the 9th and the final weeks. The exams will include the vocabularies and grammars covered in the reading textbook. The exam will not be difficult, so it is a great chance to enhance your final grade!  \r\n\r\nJoint Examination (20%)", "materials": "Perspectives 2. National Geographic Learning.\r\n\r\nExtra handouts distributed by the instructor", "foreignLanguageTextbooks": true}]