[{"name": "李鎮宇", "email": "G.C.Li@ntu.edu.tw", "latestUpdate": "2020-09-11 02:58:55", "objective": "As 3rd year course in marketing research, this course is designed to\r\n\r\n1.\tIntroduce the role, scope, process and fundamental concepts of marketing research\r\n2.\tProvide an understanding of research methodology and its implementation (using R)\r\n3.\tSupport the student to do a real marketing research project\r\n\r\nThe course emphasizes an applied approach with practical applications of marketing research in management. The class will introduce the basic concepts, and support the students on an independent research project– like actual projects in the industry. The project is intended to be enjoyable but also a preparation for project-based work encountered the industry. It will also be a useful project experience for future job applications.\r\n\r\nThis course contains two parts. The first part covers fundamental knowledge of marketing research. Ungraded quizzes will be given out to help you check your progress along the course. The second part covers statistical tools helpful for marketing research, which you are required to use one (or more) for your research project. \r\n\r\nThe course will introduce the quantitative methods through the R language/software– you will not be examined on it but you are suggested to use it in your project too. It will be a good chance to learn the basics of the language.", "schedule": "Week\tDate\tTopic\r\n1\t9/14\t\tCourse Overview\r\n2\t9/21\t\tIntroduction to Marketing & Marketing Research \r\n3\t9/28\t\tDefining the Marketing Research Problem; Developing an Approach; Research Design \r\n4\t10/5\t\tCausal Research Design\r\n5\t10/12\tExploratory Research, Descriptive Research Design\r\n6\t10/19\tMeasurement & Scaling\r\n7\t10/26\tQuestionnaire Design \r\n8\t11/2\t\tSampling & Sample Size Determination\r\n9\t11/9\t\tExam Week\r\n10\t11/16\tStatistics Review \r\n11\t11/23\tAnalysis of Variance and Covariance\r\n12\t11/30\tCorrelation and Regression\r\n13\t12/7\t\tCourse Project Presentation and Feedback\r\n14\t12/14\tDiscriminant and Logit Analysis\r\n15\t12/21\tFactor Analysis\r\n16\t12/28\tCluster Analysis\r\n17\t1/4\t\tCourse Revision\r\n18\t1/11\t\tExam Week", "scorePolicy": "Attendance and Participation\t\t\t20 %\r\nMilestone Project Presentation (Group)\t30 %\r\nFinal Project Report (Individual)\t\t50 %", "materials": "Naresh K. Malhotra, Marketing Research: An Applied Orientation, Pearson Education, 2020.", "foreignLanguageTextbooks": true}]