[{"name": "陳俊豪", "email": "chchen6814@gmail.com", "latestUpdate": "2020-06-14 01:18:24", "objective": "本課程將介紹軟性計算的概念、特性與優點，旨在提供學生多種不同的技術解決相關問題。課程目標有二：(1) 相關軟性計算技術，包含：關聯分析、群聚分析、分類等；(2)相關軟性計算技術應用，包含：時間序列分析、M-V Model、商業資料分析與組合管理等。\r\nIn this course, concepts, properties advantages of soft computing are introduced for providing various ways for students to solve problems. The goals of this course include two parts: (1) related soft computing techniques, including association analysis, clustering, classification, etc; (2) related soft computing applications, including time series analysis, mean-variance model, business data analysis and portfolio management, etc.", "schedule": "Week 1:\tSoft Computing Overview\r\nWeek 2:\tSoft Computing Technique - Introduction to Association Analysis\r\nWeek 3:\tSoft Computing Technique - Advanced Association Analysis\r\nWeek 4:\tSoft Computing Technique - Introduction to Clustering Analysis\r\nWeek 5:\tSoft Computing Technique - Advanced Clustering Analysis \r\nWeek 6:\tSoft Computing Technique - Introduction to Classification\r\nWeek 7:\tSoft Computing Technique - Introduction to Genetic Algorithms\r\nWeek 8:\tSoft Computing Technique - Advanced Genetic Algorithms\r\nWeek 9:\tMidterm Examination\r\nWeek 10:\tTime Series Data Analysis - I (Dimension Reduction)\r\nWeek 11:\tTime Series Data Analysis - II (Association Analysis)\r\nWeek 12:\tPortfolio Management - I (M-V Model and its Optimization)\r\nWeek 13:\tPortfolio Management - II (Group Stock Portfolio Optimization)\r\nWeek 14:\tCase Discussion & Paper Study\r\nWeek 15:\tCase Discussion & Paper Study\r\nWeek 16:\tCase Discussion & Paper Study\r\nWeek 17:\tFinal Project Presentation\r\nWeek 18:\tFinal Examination", "scorePolicy": "Attendance：20％\r\nMark of usual：20％ \r\nHomework：20%\r\nPaper study：20%\r\nProject Presentation: 20%", "materials": "Python for Finance (Analyze Big Financial Data, Yves Hilpisch, O'Reilly Media, 2014.\r\nDeep Learning, Ian Goodfellow, Yoshua Bengio and Aaron Courville\r\nData Mining : Concepts and Techniques, 3/e (Hardcover), Jiawei Han, Micheline Kamber, Jian Pei, 2011.", "foreignLanguageTextbooks": false}]