[{"name": "邱晴薰", "email": "A7167@ntunhs.edu.tw", "latestUpdate": "2020-06-17 00:01:41", "objective": "生命科學概論，重心放在人體生命科學，並強化醫學的角色。此外，中西醫結合的觀點，詮釋抗老、防癌。以身心靈養生的方式，強化預防醫學。並從人類疾病的本源性病因，根本探討。當然，如何增強疫力，袪除自由基是主軸。在探究人體潛能、身心靈養生或疾病的本源性原因時，都必須重視「經絡」系統。總之生命是非常奧妙的，不僅只物質面，更要重視心靈層面，中西醫整合方向，必是廿一世紀的主流。\r\nThis course focuses on human life science and emphasizes the roles of medicine on improving the life quality of human beings. It also uses the point of view of integration traditional Chinese and western medicine to interpret how to prevent the aging of body and occurrence of cancers. This course also focuses on how to keep the body, mind and spirit in the best conditon in order to prevent the occurrence of human diseases. In addition, it deeply discusses the eseential etiology of human disease and teaches audiences how to enhance the body immunity and how to get rid of free radicals. The importance of meridian system of the human body and its relationships to human potentiality, body, mind spirit and diseses are also discussed. Life is marvelous. The completeness of life depends on the saisfaction of not only the material but also menetal and spiritual needs. Integration of the traditional Chinese and western medicine to improve the life quality of human beings is the main issue.", "schedule": "1.\t生命科學/課程介紹\r\n2.  \t近期重要的生命科學相關事件\t\r\n3.\t生命的起源與分類\r\n4. \t生命的基本單位-細胞\r\n5. \t生物的化學組成 /有機化合物\r\n6. \t生物大分子/食品與營養\r\n7. \t生物大分子/食品與營養\t\r\n8.  \t遺傳學/演化\t\r\n9.   \t期中考週－影片\r\n10. \t微生物\t\r\n11.  \t疫與疾病\r\n12. \t分子生物\t\r\n13.   生物技術\t\r\n14. \t期中評量\t\r\n15. \t分組報告\t\r\n16. \t分組報告\r\n17. \t分組報告\r\n18. \t期末考週", "scorePolicy": "1. 平時（出席，學習態度，討論） 25%\r\n2. 作業 25%\r\n3. 測驗25%\r\n4.分組報告 25%", "materials": "生命科學概論 Introduction to life science， 總校閱： 張峻維、施養佳、張小娟， 新文京開發出版股份有限公司\r\n基礎生命科學，第二版，吳慶余 編著，藝軒圖書出版社", "foreignLanguageTextbooks": false}]