[{"name": "曾添文", "email": "f10403@ntut.edu.tw", "latestUpdate": "2015-08-30 10:34:25", "objective": "介紹單位換算與有效數位，元素的原子結構、化學方程式平衡與計算，反應熱，氣體與氣體定律，大氣層與環境污染，週期表，化學鍵，化合物的分子結構，熱力學，動力學，反應機構，平衡常數，氧化與還原，酸鹼反應，電化學，混合物的分離及現代科技材料，奠定良好化學基礎。", "schedule": "1~2.氣體Gases: Gas pressure; the ideal gas law; gas stoichiometry, Dalton's Law of partial pressures, kinetic-molecular theory of gases, effusion and diffusion, real gases, characteristics of several real gases; nonideal gases.\r\n3~4.溶液Liquids: intermolecular forces, vapor pressure, change of state, critical temperature and pressure, phase diagrams, liquid crystals.\r\n5.固體Solids: Bonding in metals and semiconductors, superconductors, contemporary materials.\r\n6.溶液Solutions: Factors affecting solution formation, solubility and molecular structure, units of concentration, colligative properties and solutions, aggregative particles in aqueous solution.\r\n7~8.動力學Chemical kinetics:  Factors that affect reaction rates, reaction rete and rate laws, integrated rate law, the collision model of chemical kinetics, mechanism, catalysis.\r\n9~10.化學平衡 Chemical equilibrium: The concept of chemical equilibrium, equilibrium constant, solving equilibrium problems, controlling the products of the reactions, Chatelier's principle.\r\n11~12.酸鹼平衡 Acid-base equilibria: Molecular structure and acid-base strength, acid-base titrations, buffers, quantitative aspects of acid-base equilibria. \r\n13~14.溶解度與錯合平衡Solubility and complexation equilibria: Complex-ion formstion, solubility snd pH, qualitative analysis using seclective precipitation.\r\n15~16.熱力學Chemical thermodynamics: The first law of thermodynamics, entropy changes and third law of thermodynamics, free energy, spontaneous and equilibrium, comparing thermodynamics and kinetics.\r\n17~18. 電化學 Electrochemistry: Standard potentials, commericial galanic cells, electrochemicsl celles and thermodynamics, corrosion, electrolysis.", "scorePolicy": "共考7次小考(包括期中, 期末各一次)平均,作為學期成績.", "materials": "Chemistry: Principles, Patterns, and Applications, \r\nBruce Averill, Patricia Eldredge \r\nPearson International Edition.\r\nPearson Education, Inc., 2007.", "foreignLanguageTextbooks": false}]