[{"name": "陳偉凱", "email": "wkchen@ntut.edu.tw", "latestUpdate": "2012-12-25 22:34:26", "objective": "本課程探討應用物件導向方法從事軟體設計的過程與步驟, 透過課程專題製作, 學者將學習以UML記載分析與設計之結果, 並使用一個物件導向語言(如Java或C++)實作之. 課程內容: 1. 物件導向模型 -- UML介紹 2. 物件導向程式語言與環境 3. 物件導向軟體發展週期 3.1 物件導向分析 - 需求分析, 使用個案, 觀念模型, 有限狀態模型 3.2 物件導向設計 - 實際使用個案, 合作圖, 類別圖, 設計模板, 3.3 程式撰寫 - 設計與程式之應對 4. 專題", "schedule": "1. This course covers object-oriented modeling for developing software. Materials covered include class models, state models, and interaction models in UML, a reference process model based on Unified process, implementation issues, and software engineering principles. This course is thinking and programming-intensive. Students are required to complete a non-trivial software project in two iterations. Only object-oriented languages such as C++/Java/C# are allowed.\r\n2. There will be no exams; instead, there are 7 homework assignments and two project reviews. All assignments turned in must be typed (no handwriting will be accepted).", "scorePolicy": "Homework assignment schedule and grading policy:\r\nWeek 1\tHomework #1\tProject proposal 0%\r\nWeek 2\tHomework #2\tIteration 1: Use case\t10%\r\nWeek 4\tHomework #3\tIteration 1: Domain model\t10%\r\nWeek 5\tHomework #4\tIteration 1: Design class diagram 10%\r\nWeek 7,8\tMidterm review\tProject presentation and review; 20 minutes per team.\t20%\r\nWeek 9\tHomework #5\tIteration 1: Implementation class diagram 10%\r\nWeek 12\tHomework #6\tIteration 2: Use case and domain model 10%\r\nWeek 13\tHomework #7\tIteration 2: Design and implementation class diagram 10%\r\nWeek 16,17\tFinal review\tProject presentation and review; 20 minutes per team.\t20%", "materials": "Reference books:\r\nM. Blaha and J. Rumbaugh, Object-oriented Modeling and Design with UML, 2nd Ed., Prentice Hall, 2004.\r\nGamma, Helm, Johnson and Vlissides, Design Patterns: by Addison-Wesley, 1995.", "foreignLanguageTextbooks": false}]