[{"name": "余貞儀", "email": "cy1269@gmail.com", "latestUpdate": "2012-12-22 17:04:45", "objective": "This is a history course of western classical music, of which the definition, according to The New Harvard Dictionary of Music, is ”art” or ”serious” music. The styles of various periods will be introduced, from the Medieval, Renaissance, Classical, Romantic, and the Contemporary eras.  The goal of this course is building each student's independent and academic research ability in western art music and related fields.\r\nIn order to pursue the most accurate references and info, the major key-points and terminology used in this course will be in English or original European text.", "schedule": "1st week: Introduction to Western Art Music\r\n2nd week: The Medieval Period--folk music and church music\r\n3rd week: Renaissance--Madrigals, church music, dance music.\r\n4th week: Renaissance--the choral music from different regions.\r\n5th week: Baroque--Louis XIV and his influence on French music\r\n6th week: Baroque--Italian and French legends--Corelli, Lully and Couperin\r\n7th week: Baroque--Italian and French legends continues--Vivaldi, Scarlatti, and Rameau\r\n8th week: Baroque--Comparison between Handel and J.S.Bach\r\n9th week: Baroque--J.S. Bach in-depth--his string works, orchestral music, choral music, keyboard music, and Fugues.\r\n10th week: Classical--Gluck and the history of Vienna--the form of the Viennese School and Haydn\r\n11th week: Classical-- Mozart and Beethoven\r\n12th week: Beethoven and the beginning of Romantic era; how Schubert was influenced by Beethoven\r\n13th week: The pinnacle of Romantic era--Chopin, Schumann, Brahms, Liszt, Tchaikovsky\r\n14th week: The late Romantic era--Mahler, Scriabin, and Rachmaninoff\r\n15th week: The Contemporary Music--12-tone music (The 2nd Viennese School), Existentialism, music of Minimalism, and experimental music.", "scorePolicy": "1. Attendance \r\n2. Learning attitude\r\n3. Class notes as a part of evaluation for both mid-term and final grades, along with a final exam.", "materials": "a.) The outline of this course is designed based on the following textbooks:\r\n1. Miller M., and Cockrell D.,”HarperCollins College Outline History of Western Music”. New York: HarperCollins Publisher, 1991.\r\n2. Janson A., ”Janson's History of Art”. New York: Prentice Hall, 2006.\r\nb.) Internet research\r\n\r\nAbout Chenyi Yu (余貞儀簡歷):\r\n\r\nAssistant Professor (助理教授)\r\n\r\nDoctor of Education (Ed.D.) in College Teaching, Columbia University, Teachers College,  New York, New York  U.S.A. May, 2004\r\nMajor: Music Education  Specialization: Piano Pedagogy, Musicianship         \r\n\r\nMaster of Music (M.M.) The Boston Conservatory, Boston, Massachusetts   U.S.A.  May, 1996                                   Major: Piano Performance                                  \r\n\r\nBachelor of Music (B.M.) The Boston Conservatory, Boston, Massachusetts  U.S.A.  Dec., 1994                                 Major: Piano Performance\r\n\r\nEXPERIENCE: Private studio teaching in piano and music theory through Teachers College of Columbia University, 1996-1997.\r\n\r\nMaster classes with Janice Weber, Jonathan Bass, Michael Lewin,  Monique Duphill, and Gabriel Chodos.    \r\n\r\nNumerous performances in Boston and New York areas, including critically acclaimed performance of Goldberg Variations of J. S. Bach in Seully Hall at The Boston Conservatory, the recital debut in Steinway Hall, New York City, and many other concertos and chamber music appearances in Boston and New York with extensive repertoire.  In Dec. 2010, Chen-Yi Yu had collaborated with pianist Yi-Hsuan Lu to give a two-piano concert in the Concert Hall of Tatung University, Taipei, Taiwan. Repertory includes the famous Sonata for Two Pianos in D-Major  K. 448 by Mozart, Ma Mere L'oye by Ravel, Pictures from the East Op. 66 by Schumann, and Dolly Suite Op. 56 by Faure   In March 2012, Chen-Yi Yu has performed Images, Deuxieme livre by Claude Debussy in a faculty concert held by the Department of Music of Shih-Chien University at the National Concert Hall in Taipei.\r\n\r\n7歲開始習琴，曾受教於林公欽，陳芬芬等教授。1988年畢業於光仁中學音樂班，隨即考入美國波士頓音樂學院 (The Boston Conservatory)，師事二十世紀初英國鋼琴大師 James Friskin嫡傳弟子—Irwin Gelber，並連續兩學年獲得Alfred E. Lee獎學金。該獎學金每年頒發給一名音樂學院大學部學生，由全體鋼琴教授以共識決選出獲獎者。1994年取得鋼琴演奏學士學位後, 在Boston參與多次室內樂演出，同時舉行數次獨奏會。1995年 12 月以全場無休息的巴哈郭德堡變奏曲，獲得鋼琴演奏碩士學位。1996年進入紐約哥倫比亞大學教師學院 (Columbia University, Teachers College) 音樂與音樂教育系(Department of Music and Music Education), 就讀大學教育博士班 (Doctor of Education in College Teaching) 並跟隨俄國派鋼琴大師Ada Kopetz-Korf習琴，深入研究鋼琴觸鍵與教學。2000年於紐約 Steinway Hall舉行獨奏會。 2004年5月獲得哥倫比亞大學音樂教育博士學位，論文題目為「平台鋼琴之觸鍵與教學」(The Effect of Touch on Tone Production on a Grand Piano) 。 曾任實踐大學音樂系鋼琴組兼任助理教授, 現任台北科技大學通識中心兼任助理教授、和大同大學通識中心兼任助理教授。2010年12月, 與鋼琴家呂怡萱在大同大學音樂聽共同演出雙鋼琴音樂會, 曲目包括莫札特 著名的為雙鋼琴寫的奏鳴曲 (Sonata for Two Pianos, K. 448), 佛瑞的桃莉組曲 (Dolly Suite, op. 56) 跟拉威爾的鵝媽媽組曲 (Ma Mere L'oye)。2012年三月於台北國家音樂廳演出德布西的第二組映象(Images, Deuxieme livre) 組曲。", "foreignLanguageTextbooks": false}]