[{"name": "洪祖全", "email": "tchung@ntut.edu.tw", "latestUpdate": "2013-10-24 13:33:47", "objective": "基本概念、熱力性質、熱力學第一及第二定律、動力循環、冷凍循環。", "schedule": "授課進度及大綱:\r\n1. Basic concept: Overall picture of thermodynamics and energy; Introduction of the systems, cycles, processes, states, and properties.\r\n2. Basic concept: point (state) and path (process) functions; the knowledge of pressure, work, heat, unit conversion.\r\n3. Properties: Extensive and intensive properties; physical and thermodynamic properties; total energy and various types of energy;\r\n4. Equilibrium diagram: Saturated curve of pure substance from experiments.\r\n5. Equilibrium diagram: its relation with steam Table; Table method practice; determination of the state location.\r\n6. More practice of the Table method for determining the properties; 1st mid-term exam.\r\n7. Equilibrium diagram: Reasons to assume its ideal gas; Table method practice; concept of u = u(T).\r\n8. More practice and understanding to the ideal gas; incompressible materials.\r\n9. Conservation of Mass: General equation – the derivative.\r\n10. Conservation of Mass: concept of uniform, steady state, and transient\r\n11. fundamental concept of thermodynamic cycles\r\n12. 2Nd law of thermaodynamics and entropy\r\n13. Conversions among T-v, p-v, and T-s diagrams.\r\n14. Gas and vapor cycles", "scorePolicy": "About 2 mid-terms and 1 final examinations: Date will be determined according to the progress of the lecture.\r\nYour final points will be completely dependent of what you can show yourself in the examinations and special performance in the class. Homework will be assigned but you do not have to hand in. They will be considered in the examinations. You can freely handin your homework and would be helpful in your grade.", "materials": "1. 教科書：”Thermodynamics” – by William Z. Black and James G. Hartley\r\n2. 教材：備有講義成冊供學生拷貝\r\n3. 參考教材：”Engineering Thermodynamics” – by Moran and Shapiro.", "foreignLanguageTextbooks": false}]