[{"name": "柯萊恩", "email": "kcline@ntut.edu.tw", "latestUpdate": "2013-09-09 11:07:57", "objective": "教導學生閱讀囊括全球議題的文章，並藉由文章的內容作技巧的訓練，字彙的建構，語言的解析，及思維的啟發。課中延展活動將閱讀內容與聽力、會話、寫作做進一步的連結，並引導學生將所學做有效的應用。", "schedule": "Dr. Kurt Cline\t\t\t\t\tOffice:  406\r\nAdvanced English Reading, Listening & Speaking\tPhone:  ext. 3943\r\nNational Taipei University of Technology\t\tE-Mail: kcline@ntut.edu.tw\r\nFall, 2013\t\t\t\t\tOffice Hrs:  M, 5-6 PM; T, 1-2 PM; W, 1-3 PM\r\n\r\n\r\nSYLLABUS\r\n\r\nIn this course we will introduce and develop skills and techniques necessary for a basic understanding of English reading, listening and speaking.  The emphasis will be upon developing writing skills, oral fluidity, comprehension, retention, vocabulary, syntax and an increasing sophistication in thinking in English.\r\n\r\n\r\nSTUDENT RESPONSIBILITIES\r\n\r\n1) Presentations.  Students will give at least one oral presentation in concert with two or three classmates.  Preparation for this presentation will help you gain greater value in the class.\r\n\r\n2)  Attendance.  Frequent attendance is mandatory.  After your first two absences, each subsequent unexcused absence will cause your final grade to be reduced by five grade points.  If you are absent, it is your responsibility to find out the substance of class discussions and to make up homework.  \r\n\r\n5)  Anyone caught plagiarizing will receive a failing grade in the course.  All outside sources that you use in the production of your papers must be properly attributed using the MLA format.\r\n\r\nGRADING\r\n\r\n50%\tCoursework (+ extra credit for English Corner, TED, etc.)\r\n20%\tPresentation(s)\r\n15%\tMidterm\r\n15% \tFinal\r\n\r\n\r\n\r\nCOURSE SCHEDULE\r\n\r\nAll assignments are due next class session unless otherwise indicated.  For complete details of formal writing assignments and informal writing tasks (journal entries), please see appropriate writing assignment or journal entry schedule.\r\n\r\nWeek 1\t\tIntroduction.  ASSIGNMENT: READ Chapter One and answer questions.\r\n\r\nWeek 2\t\tReview Chapter One.  ASSIGNMENT: READ Chapter Two and answer questions.\r\n\r\nWeek 3\t\tReview Chapter Two.  ASSIGNMENT: READ Chapter Three and answer questions.\r\n\r\nWeek 4 \t Review Chapter Three.  ASSIGNMENT: READ Chapter Four and answer questions.\r\n\r\n\r\nWeek 5\t\tReview Chapter Four.  ASSIGNMENT: READ Chapter Five and answer questions.\r\n\r\nWeek 6\t\tReview Chapter Five.  ASSIGNMENT: READ Chapter Six and answer questions.\r\n\r\nWeek 7\t\tReview Chapter Six.  ASSIGNMENT: Review for midterm.\r\n\r\nWeek 8\t\tNO CLASS.  REVIEW FOR MIDTERM.  \r\n\r\nWeek 9\t\tMidterm.  ASSIGNMENT: READ Chapter Seven and answer questions.\r\n\r\nWeek 10\tReview Chapter Seven.  ASSIGNMENT: READ Chapter Eight and answer questions.\r\n\r\nWeek 11\tReview Chapter Eight.  ASSIGNMENT: READ Chapter Nine and answer questions.\r\n \r\nWeek 12\tReview Chapter Nine.  Prepare for presentations  ASSIGNMENT: READ Chapter Ten and answer questions.\r\n\t\t\r\nWeek 13\tReview Chapter Ten.  Prepare for presentations.  ASSIGNMENT: READ Chapter Eleven and answer questions.\r\n\r\nWeek 14\tReview Chapter Eleven.  Prepare for presentations.  ASSIGNMENT: READ Chapter Twelve and answer questions.\r\n\r\nWeek 15\tReview Chapter Twelve.  Presentations.\r\n\r\nWeek 16\tPresentations.\r\n\r\nWeek 17\tNO CLASS.  REVIEW FOR FINAL EXAM\r\n\r\nWeek 18\tFinal Exam", "scorePolicy": "　", "materials": "　", "foreignLanguageTextbooks": false}]