[{"name": "葛瑞斐", "email": "griffith@ntut.edu.tw", "latestUpdate": "2013-05-31 22:17:05", "objective": "研讀戲劇作品，注重作品所反映的人文與社會環境的互動。上課方式以評析和討論為主，以加強口語表達能力及文學賞析能力，並以戲劇演練提升語言學習效果。\r\n\r\nDrama covers a wide-range of art forms in Western culture. Often we think of actors performing a play on a stage before an audience; but, printed as a book, plays can also be read silently and studied like any other text. Film, too, is a form of drama that developed out of the play tradition. Moreover, drama is not just a particular style of art (like a stage play); “a dramatic moment” or a “dramatic situation” can appear in any number of genres (novels, films, even in newspapers reporting on a “real-life drama”). Drama is therefore both an important form of art and an important concept for students of Western culture and language to be familiar with – not only are some of the most important works in Western culture plays or films, but the idea of the dramatic (of the tragic, of the serious, of the passionate, of the greater-than-this-moment) is an important value in Western culture, existing in contrast to the values of the comedic, the ordinary, the immediate everyday. A word with a broad range of meaning, drama is an important word in conversations about values and about ideas in Western culture.\r\n\r\nIn this class, we will discuss performance and how the language of drama is meant to sound (as opposed to how non-dramatic, ordinary everyday English sounds); but the focus of the course will not be on preparing a live performance of an English-language stage play. Rather we will study the idea of drama and focus on exploring its significance to the English language and to Western culture.", "schedule": "　", "scorePolicy": "Grades:\r\n\r\nMidterm 50%\r\n\r\nFinal 50%\r\n\r\nAttendance: a combination of 4 absences or late days = -10 points from course grade", "materials": "　", "foreignLanguageTextbooks": false}]