[{"name": "施欣文", "email": "sharinschroeder@ntut.edu.tw", "latestUpdate": "2013-09-19 15:01:27", "objective": "COURSE OVERVIEW\r\nIn this course we will use a historical approach in order to analyze the intersection between high and popular culture. What is the purpose of popular culture? What differentiates music, art, and literature that become popular among the masses from works that do not? Who decides what popular culture is, and who decides what high culture is? We will pay particular attention to the ways in which popular culture becomes high culture and vice versa. We will analyze how similar stories recur across various time periods and geographic regions, how modernity affects our view of culture and art, and how stories change when told in different genres. Students will make presentations about aspects of popular culture that interest them, will participate in in-class writing, quizzes, and exams, and will write two formal reflection papers.", "schedule": "Week 1\r\n9/10\r\nWhat is Pop Culture?\r\n “Cull vs. Surrender,” George Orwell’s “Good Bad Books,”\r\nFrom T. S. Eliot’s “Tradition and the Individual Talent”\r\nIn-class writing\r\n\r\nWeek 2\r\n 9/17\r\nGenre: the Novel\r\nCase Study: Jane Austen’s Northanger Abbey and Pride and Prejudice (Austen in Pop Culture)\r\nRead Jane Austen’s Northanger Abbey, ch. 14\r\n\r\nWeek 3 \r\n9/24\r\nMaking Rules about Culture\r\nIn class-reading from Matthew Arnold’s Culture and Anarchy\r\nExcerpts from Matthew Arnold’s Culture and Anarchy\r\nMao Zedong’s “Talks at the Yan’an Forum on Literature and Art”\r\n\r\nBring in a picture of or a news article about a demonstration, event, or product that shows a connection between politics and popular culture. \r\nPresentation: Propaganda and Popular Culture\r\n\r\nWeek 4\r\n 10/1\r\nGender Roles (Tragedies)\r\nCenter Stage (1992)\r\nDir. Stanley Kwan. Perf. Maggie Cheung, Han Chin, and Tony Leung Ka Fai\r\nWriting the Paper: Instructions\r\n\r\nWeek 5 \r\n10/8\r\nNo class \r\nThink about your papers and presentations\r\n\r\nWeek 6 \r\n10/15\r\nGender Roles (Comedies)\r\nI Love Lucy\r\nWatch “I love Lucy” clips that I send you over e-mail. \r\n\r\nBring in an (appropriate) picture or news article about either portrayals of men in popular culture or portrayals of women in popular culture. Think about to what extent your picture/article is representative of how popular culture portrays men and women and to what extent it is an outlier. Be prepared to talk about the piece you have chosen.\r\n\r\nWeek 7 \r\n10/22\r\nSome Like it Hot (1959)\r\nDir. Billy Wilder. Perf. Marilyn Monroe, Tony Curtis, and Jack Lemmon. \r\nPresentation: Masculinities in Popular Culture\r\n\r\nWeek 8 \r\n10/29\r\n\r\nWord, Image, Tone:\r\nGender and Music Videos\r\nDiscussion of Some Like it Hot\r\n\r\nFrom Gentlemen Prefer Blondes\r\nMadonna: “Material Girl”\r\n“Video Killed the Radio Star”\r\nMichael Jackson: “Billie Jean” \r\n\r\nPEER REVIEW\r\nWatch the following Lady Gaga music videos on Youtube: \r\n“Paparazzi” and “Telephone.” \r\nYou may choose to watch others such as “Bad Romance,” and/or “Born this Way” if you like. \r\n\r\n(Note: All of Lady Gaga’s videos have disturbing elements, but “Telephone” especially does.)\r\n\r\nBring in two copies of a draft of your paper. You must have at least 1 ½ typed pages to get credit. \r\n\r\nWeek 9\r\n11/5\r\n \r\nThe Hobbit (1937) \r\n(We will read selections in class.) \r\nSnow White and the Seven Dwarfs (1937)\r\nRead from Beowulf: TBA\r\nRead from Frankenstein (e-mailed section—14 pages) \r\nOn Youtube, watch: Frankenstein 1931 “It’s Alive!” scene (1 minute)\r\nhttp://www.youtube.com/watch?v=rSCBvu_kijo&NR=1\r\nAnd the girl with flower scene: http://www.youtube.com/watch?v=MA9opHsLACk\r\nAnd Curse of Frankenstein footage (set to music): http://www.youtube.com/watch?v=dZc0ryAT_Ts\r\nOptional: The 1910 film version of Frankenstein (13 minutes): http://www.youtube.com/watch?v=TcLxsOJK9bs&feature=fvwrel\r\n\r\nWeek 10\r\n 11/12\r\nThe Fellowship of the Ring (film—2001) (Tolkien’s The Fellowship of the Ring was published in 1954.)\r\nPaper 1 due—Make sure you are on time. \r\n(600-800 words—2.5–3.5 pages + an additional Works Cited page), Times New Roman, 12-point font, 1 inch (2.54 cm) margins\r\n\r\nWeek 11 \r\n11/19\r\nThe Fellowship of the Ring (week 2) \r\n\r\nWeek 12 \r\n11/26\r\nRead The Two Towers. Book 1, Ch. 1–2 (1954)\r\n\r\nWeek 13 \r\n12/3\r\nThe Two Towers\r\nRead TT, Book 1, chapters 3–4 \r\nPresentation: Modern Monsters and portrayals of evil in popular culture\r\n\r\nWeek 14\r\n12/10\r\nThe Two Towers\r\nRead TT, Book 1, chapter 5–6\r\nPresentation: The environment in popular culture\r\n\r\nWeek 15\r\n12/17\r\nThe Two Towers\r\nRead TT, Book 2: Ch. 1–2\r\n\r\nWeek 16\r\n12/24\r\nTolkien’s reviewers: Is The Lord of the Rings high culture, popular culture, or both?\r\nRead “The Hobbit-forming World of J.R.R. Tolkien”\r\nGroup Presentations on the TT chapters we didn’t read all together\r\n\r\nWeek 17\r\n12", "scorePolicy": "GRADING PERCENTAGES\r\n\r\n10% \tParticipation—Engagement in the Classes: The student has clearly done the reading or other homework and has jotted down notes and/or questions about it. The student is willing and able to contribute fruitfully and thoughtfully in class discussions, group work, and his or her presentations. Guidelines for technology use and class presence are always followed. \r\n\r\n5%\tParticipation—English use. To get full credit in this section, the student speaks exclusively in English in class. (It’s good for you!) Instead of saying Chinese words, the student thinks of a way to rephrase what s/he wants to say in English in a way that the other student will understand. If communication fails, the student asks me for and gets permission to say a word in Chinese and then other students will try to help the student say what s/he means in English. I will give you three grace cards for any slip-ups. So long as you don’t accidentally speak Chinese more than three times, you can still get full credit in this area. After three times, you can get up to 2% in this area if I see you are really trying to speak English. If you choose not to worry about your level of English use, you just won’t earn this 5% in your final grade. \r\n\r\n20% \tIn-class Writing, Quizzes, and Informal Response Papers\r\n\r\n45%\tFormal Papers\r\n\r\n20%\tPresentations\r\n\r\nI may modify these percentages at my discretion.\r\n\r\nGrading Criteria:\r\n\r\nA\tSuperior work. Achievement that is outstanding relative to the level necessary to meet course requirements.\r\nB\tAchievement that is significantly above the level necessary to meet course requirements.\r\nC \tAchievement that meets the course requirements in every respect. \r\nD \tAchievement that fails to meet fully the course requirements. \r\nF \tAchievement that is not worthy of credit. The only way to outright fail this course is through lack of effort and/or plagiarism. The student may not participate in classroom work. Assignments are either (a) completed but not completed at a level of achievement that is not worthy of credit; (b) frequently late, thereby lowering the grade too significantly to give the student a chance to pass; or (c) never completed at all.", "materials": "TEXTS\r\nJ. R. R. Tolkien’s The Two Towers (or the full set of The Lord of the Rings)\r\nCourse Packet and E-mailed readings (Please print these.)\r\nOther Readings, Films, TV, and Music TBA.", "foreignLanguageTextbooks": false}]