[{"name": "柯萊恩", "email": "kcline@ntut.edu.tw", "latestUpdate": "2013-09-04 10:10:26", "objective": "本課程旨在藉由各種文化媒體（如文學作品，書報雜誌，期刊論文，電影等影音文字）引導學生選擇性地認識英國、愛爾蘭、美國、加拿大、非洲、澳洲、紐西蘭、印度、巴基斯坦、新加坡、香港、菲律賓、加勒比海等國家或地區的文學與文化。藉由認識上述這些國家或地區的英語文學與文化，擴展學生英語文應用的宏觀視野，並使之具備促進異國情感及文化交流的能力。", "schedule": "Dr. Kurt Cline\t\t\t\t\t\t\tOffice:  406\r\nWorld English Literature and Culture\t\t\t\tPhone:  3943\r\nNational Taipei University of Technology\t\t\t\te-mail:  kcline@ntut.edu.tw  \r\nFall, 2013\tOffice Hours:  M 5-6 PM, T 1-2PM, W 1-3 PM\r\n\r\n\r\n\r\nWe will examine literatures of the world—focusing most particularly on Hoodoo inspired early African-American, African, Caribbean and Irish myths stories and poems.  We will also attempt to discern what relationship there might be between such literatures and  various musics of the world, particularly rural American blues, ancient Celtic ballads, reggae, and jazz.  Anticipated films include:  Percy Henzell’s The Harder They Come, Marcel Camus’ Black Orpheus and The Cry of Jazz which features early performances by the Sun Ra Archestra.  Through exposure to poetry, art, song, film, history, mythology, literary theory and consciousness studies, students will be able to acquire a more sophisticated, nuanced view of culture in its aesthetic expression, and a greater appreciation for the manner in which art and culture continually shape and reshape one another.\r\n\r\nSTUDENT RESPONSIBILITIES\r\n\r\n1)  Journals.  Students must keep a journal on an ongoing basis containing responses to the works they are examining and share these writings with the rest of the class.  To receive full credit, you must bring your journal entry to class and read it aloud on the day that it is due.  I will not accept late or e-mailed journal entries or writing assignments.\r\n\r\n2) Presentations.  Students will give an oral presentation in concert with two or three classmates.  Preparation of these presentations will lead to development and refinement of your understanding of literature, and will provide a meaningful context for discussion in the class.\r\n\r\n3)  Attendance.  Frequent attendance is mandatory.  After your first two absences, each subsequent unexcused absence will cause your final grade to be reduced by one grade point.  If you are absent, it is your responsibility to find out the substance of class discussions and to make up homework.  \r\n\r\n4)  Anyone caught plagiarizing will receive a failing grade in the course.  All outside sources that you use in the production of your papers must be properly attributed using the MLA format.\r\n\r\n\r\nCOURSE SCHEDULE\r\n\r\nSeptember 15\tINTRODUCTION:  Oral versus written forms of cultural expression \r\n\r\nSeptember 22\tHoodoo, Voodoo and the Blues:  Robert Johnson and Lucille Bogan\r\n\r\nOctober 29\tZora Neale Hurston’s Folk Tales and Uncle Remus\r\n\r\nOctober 6\tCaribbean Culture:  Kamau Brathwaite\r\n\r\nOctober 13\tRastafarianism and Reggae\r\n\r\nOctober 20\tIndigenous Cultures:  Native American and Mexican \r\n\r\nOctober 27\t Indigenous Cultures:  Hawaii, Taiwan\r\n\r\nNovember 3\tAfrican Culture and Ifa Divionation\r\n\r\nNovember 10\tContemporary Anglo-Nigerian Literature:  Obotunde Ijimere.\r\n\r\nNovember 17\tMIDTERM EXAM  \r\n\r\nNovember 24\tCeltic Mythology I\r\n\r\nDecember 1\tCeltic Mythology II\r\n\r\nDecember 8\tIrish Literature I\r\n\r\nDecember 15\tIrish Literature II\r\n\r\nDecember 29\tGROUP PRESENTATIONS\r\n\r\nJanuary 5\tGROUP PRESENTATION\r\n\r\nJanuary 12\tFINAL PAPER DUE (No e-mails, please.)\r\n\r\n\r\n*Presentation proposal (which should be completed for both presentation A and presentation B) may be in rough or outline form, but should contain the main points that you will be covering in your presentation.  Power point presentations should be limited to pertinent visual {or perhaps sound) images only: no words, no reiterations of your outlines, no recitations of your presentation itself. Your proposal should be 2-3 pages in length but you should edit this for speaking purposes so that it does not exceed 15 minutes in actual floor time.", "scorePolicy": "GRADING\r\n\r\n25%\tMidterm Exam\t\t\t\t\t25%\tParticipation\r\n25%\tJournal Assignments\t\t\t\t25%\tFinal Exam", "materials": "　", "foreignLanguageTextbooks": false}]