[{"name": "施欣文", "email": "sharinschroeder@ntut.edu.tw", "latestUpdate": "2013-09-19 15:03:29", "objective": "教導學生閱讀囊括全球議題的文章，並藉由文章的內容作技巧的訓練，字彙的建構，語言的解析，及思維的啟發。課中延展活動將閱讀內容與聽力、會話、寫作做進一步的連結，並引導學生將所學做有效的應用。", "schedule": "FALL 2013 \r\nGeneral Outline (Our exact pace will vary, but we will do six units during the first semester and six in the second. I may modify this syllabus at my discretion.) \r\nWeek\r\n\r\n1 \r\n9/11–12\r\nOrientation \r\nUnit 1\r\n\r\n2\r\n9/18–19\r\nUnit 1—This Land is Your Land!\r\nThurs: No class\r\n\r\n3\r\n9/25–26\r\nUnit 1\r\n\r\n4\r\n10/2–3\r\nUnit 2—Never at a Loss for Words!\r\n\r\n5\r\n10/9–10\r\nNo class—group work on own. \r\nNo class \r\n\r\n6\r\n10/16–17\r\nUnit 2\r\n\r\n7\r\n10/23–24\r\nUnit 3—Big Business\r\n\r\n8\r\n10/30–31\r\nUnit 3 and midterm review\r\n\r\n9\r\n11/5\r\n(Tues.)\r\nMidterm exam and Proficiency Test on TUESDAY at 10:10. Don’t forget to bring your ID card. If you are twenty minutes late or more, you will not be able to take the exam and will receive a zero. (No class on Wednesday or Thursday.) \r\n\r\n10\r\n11/13–14\r\nUnit 4—Celebrity\r\n\r\n11\r\n11/20–21\r\nUnit 4\r\n\r\n12\r\n11/27–28\r\nUnit 5—Love is. . .?\r\n\r\n13\r\n12/4–5\r\nUnit 5\r\n\r\n14\r\n12/11–12\r\nUnit 6—Newspeak\r\n\r\n15\r\n12/18–19\r\nUnit 6 \r\n\r\n16\r\n12/25–26\r\nChristmas—Culture Class on the Holiday\r\nOral or TBA\r\n\r\n17\r\n1/1–2\r\nNo school—New Year’s. \r\nOral or TBA\r\n\r\n18\r\nFinal exam and Proficiency Test on TUESDAY at 10:10. Don’t forget to bring your ID card. If you are twenty minutes late or more, you will not be able to take the exam and will receive a zero. (No class on Wednesday or Thursday.)\r\n\r\nEnglish Plus Program: You may be able to receive extra credit by attending English Corner and other English Plus activities. For more information, see the English department website: http://www.eng.ntut.edu.tw/bin/home.php or googling “English Plus NTUT.”", "scorePolicy": "GRADING CATEGORIES\r\nHomework: 25%\r\nQuizzes/Tests: 25%\r\nParticipation: 10%\r\nSkits, and Presentations: 10%\r\nMidterm: 15% (Note the midterm test has changed. We will be using TOIEC tests this year.) \r\nFinal: 15%\r\n\r\nI may modify these grade percentages at my discretion. The midterm and final will always be worth 30% of your grade. \r\n\r\n\r\nACTIVITIES\r\nIn class we will do many activities involving listening, speaking, reading, and writing. Be prepared to speak in front of the class. In some weeks I may assign skits and/or oral presentations in addition to the homework from American Headway. I may also have you write short paragraphs in class. Depending on the purpose of this writing activity, I may or may not have you turn in your writing activity. (I do not tell you in advance whether I will collect a writing activity.) Please show yourself trustworthy in all areas by always doing your own work.\r\n\r\nPARTICIPATION\r\nYour participation is what makes or breaks this course. When you participate, everyone learns more and has more fun. Someone with a high grade in participation is engaged with class activities; takes academic honesty seriously and does all homework individually; stays focused and on task; takes notes; speaks exclusively, frequently, and thoughtfully in English; knows when to listen and when to speak; reads with expression and enthusiasm; is creative, enthusiastic, and audible during skits and presentations; is trustworthy; and interacts positively, helpfully, and tactfully with other class members. Remember, it’s okay to make mistakes. The goal is communication, and your questions and comments help other students. \r\n\r\nCLASS POLICIES\r\n‧\tSpeak English. If you speak only in English, your participation grade will be high. If you speak mostly English, your participation grade will be passing. If you speak more Chinese than English, you will not receive a passing grade in participation. \r\n‧\tPlease do not use any electronic devices in class. Electronic translators are okay (but not cell phones) provided you are only using them for translation. If you have your cell phone out or are using a computer or electronic device inappropriately, you will be marked absent. \r\n‧\tIf you have a cell phone in your bag, make sure it is turned off.  \r\n‧\tPlease by prompt. Lateness equals ½ absence. \r\n‧\tStudents who have six unexcused absences (the equivalent of three weeks), twelve tardies, or the equivalent combination of absences and tardies, cannot pass the course. \r\n‧\tPlease be present in both body and mind. Non-participation may lead to being marked absent. (If you are asleep, you will be marked absent.) Failure to bring course materials may lead to being marked absent and losing participation points.\r\n‧\tYou are always responsible for knowing what happens during all class meetings. If you miss a class session, telephone or email a member of the class, and ask him/her what you missed and what you need to be ready for at the meeting to come. If it’s an excused absence, make sure to give me the proper form.", "materials": "　", "foreignLanguageTextbooks": false}]