[{"name": "王河洛", "email": "wanghool01223@hotmail.fr", "latestUpdate": "2013-09-24 21:27:38", "objective": "本課程旨在有效提升學生運用英文於工程實務之技巧與能力。主要包括： 一、撰寫個人英文履歷及簡歷。 \r\n     二、閱讀通俗科技文章的能力(含心得報告)。 \r\n     三、使用英文進行簡報的技巧與能力。 \r\n     四、撰寫英文簡報資料的技巧與能力。 \r\n     五、撰寫工作報告的技巧與能力。\r\n本課程授課包括約三分之一的時間在語言教室練習職場英語。", "schedule": "四電二丙/ 工程英文實務 與 演練   English Practice and Training for Engineers \r\n\r\nCourse Description: \r\nThis Engineering English course introduces students to prepare and to develop their communication skills and vocabulary required to work confidently and to be successful professional contexts.  Teacher will cover topics common to all types of engineering field.   \r\n* Students will have to access to a wide range of real materials and books related to engineering industry.  Teacher will help students discover and develop a language skills required in field and students will use their own knowledge of Industrial Engineering to shape their course.   \r\n\r\nRequired Texts:  \r\nTexts to read:  Student will be informed to prepare various scientific/technical magazines, materials each week.    \r\n  \r\nSeptember 18 :   Ha-Joon Chang  (Cambridge Professor ): 23 Things They Don’t tell you about Capitalism” – Thing 4: The Washing machine has changed lives more than the Internet”  (誠品:台大店)\r\n\r\n \r\n  Weeks 1-4  \r\n1.\tOral presentation : self- introduce, interests, goal to engineering career. \r\n2.\twriting : Curriculum Vitae and resume / autobiography  \r\n3.\tmaking a speech  ( To summarize one from the top 10 speeches )\r\nReference: \r\n*TED  ( 各界傑出人物的演講   )    http://www.ted.com/ \r\n*YouTube EDU (影音網站高較網站 )  http://www.youtube.com/edu \r\n*Speeches and Transcripts  (美國 University of Albany 圖書館提供   )   http://library.albany.edu/referecne/speeches.html  \r\n\r\nWeeks 5-8: \r\n  Students will practice language for presentations, problem solving and telephoning in a context relevant to future career. Students will try to write and edit presentation material(s) by English  \r\n\r\n  Weeks 9-12 \r\nWe focus on construct and writing a concise report by English.", "scorePolicy": "1.group discussion:                                                10%\r\n2.famouspeeches,cv&autobiograpy,oralrepresentation25%                 3.  mid-term:                                          20% \r\n4.  Final exam:                                        20%  5.Technicalpaper:                                                                           15%                        \r\n6 Attendance/ improvement:           10%     \r\n_______________________________+__________+___________+__________+___\r\n                                                                                                                                      100%", "materials": "1). textbook:   ISBN 13: 9789866507519  \r\n     工程科技英文: 實務與演練 (作者: 董紫儀  白硃玉) 2009/09/01\r\n\r\n2). articles from EE journals, EE related periodicals \r\n3). Reference: \r\n*TED  ( 各界傑出人物的演講   )    http://www.ted.com/ \r\n*YouTube EDU (影音網站高較網站 )  http://www.youtube.com/edu", "foreignLanguageTextbooks": false}]