[{"name": "柯萊恩", "email": "kcline@ntut.edu.tw", "latestUpdate": "2013-09-09 10:57:20", "objective": "本課程主要在培養各類型段落、短文的撰寫能力，包括描寫、敘述、說明及議論性質文章。", "schedule": "Dr. Kurt Cline\t\t\t\t\tOffice:  406\r\nAdvanced Writing I\t\t\t\tPhone:  ext. 3943\r\nNational Taipei University of Technology\t\tE-Mail: kcline@ntut.edu.tw\r\nFall, 2013\t\t\t\t\tOffice Hrs:  M, 5-6 PM; T, 1-2 PM; W, 1-3 PM\r\n\r\n\r\nSYLLABUS\r\n\r\nIn this course we will introduce and develop skills and techniques necessary for the preparation of a research paper.  Students will read and discuss primary and secondary sources from Eastern and Western wisdom traditions and compose four short (3-5 page) papers and one medium length (5-8 page) essay based on these works.  Today, the first day of class, you will be given a primary text which will hopefully lead each of you into ever deeper fields of investigation.  You should look at your initial text as a sort of clue in a larger mystery, for which, however, there is no single denouement.  Although your research assignment must draw upon your primary text, it will be your responsibility to find more research materials--books, articles, films, interviews, musical compositions, poems, stories, works of art of all sorts--on your topic.  It will also be up to you to find an angle on your material: perhaps it will be a study of the culture, mythology, religion, or lifestyle from which your original source is drawn. Perhaps it will be a comparative work—examining beliefs from more than one culture, or focusing on the beliefs of a particular one.  As long as your final result includes the initial (p[rimary] text you selected, in some significant manner, you will have accomplished the task I am assigning.\r\n\r\n\r\nSTUDENT RESPONSIBILITIES\r\n\r\n1) Peer Evaluation.  A significant portion of the class will be given over to peer evaluation of essays.  The purpose of this is at least threefold:  1) to offer student writers criticism from peers, so that they may improve their work; 2) to cause each class member to articulate his or her critical concerns; and 3) to encourage the formation of a community of writers.  For peer evaluation you must be prepared to make multiple copies of your written work for other students in the class, AND YOU MUST BRING YOUR WORK AND THREE COPIES IN TO CLASS ON THE DAY THEY ARE DUE.  All peer evaluation activities--not only your having your paper evaluated, but also your active, cheerful participation in the critique of essays by your fellow classmates—are absolutely mandatory and count towards participation points in the class that cannot be made up.\r\n\r\n2)  Journals.  Students must keep a journal on an ongoing basis containing responses to the works they are examining and share these writings with the rest of the class.  The essays that you write will be drawn from these journal entries.  To receive full credit, you must bring your journal entry to class with one additional copy (for the instructor) and read it aloud on the day that it is due.  I will not accept late or e-mailed journal entries or writing assignments.\r\n\r\n3) Presentations.  Students will give two oral presentations in concert with two or three classmates.  Preparation of these presentations will lead to development and refinement of your final essay topic, and will provide a meaningful context for discussion in the class.\r\n\r\n4)  Attendance.  Frequent attendance is mandatory.  After your first two absences, each subsequent unexcused absence will cause your final grade to be reduced by one grade point.  If you are absent, it is your responsibility to find out the substance of class discussions and to make up homework.  \r\n\r\n5)  Anyone caught plagiarizing will receive a failing grade in the course.  All outside sources that you use in the production of your papers must be properly attributed using the MLA format.\r\n\r\nGRADING\r\n\r\n25%\tMidterm Paper\t\t\t\t25%\tJournal Writing\r\n25%\tFinal Paper\t\t\t\t25%\tParticipation and Presentation\r\n \r\nRESEARCH\r\n\r\n“RE-SEARCH N. [MF RECHERCHE fr. RECHERCHER to go about seeking] Studious inquiry or examination: esp : investigation or experimentation aimed at the discovery and interpretation of facts, revision of accepted theories or laws in the l", "scorePolicy": "　", "materials": "　", "foreignLanguageTextbooks": false}]