[{"name": "施欣文", "email": "sharinschroeder@ntut.edu.tw", "latestUpdate": "2013-09-19 15:09:22", "objective": "COURSE OVERVIEW\r\n\t \r\nThis course aims at providing students with the fundamental knowledge and competence that they will need in doing research and writing research papers using the MLA style. Its main purpose is to familiarize students with methods, procedures, and techniques that are applicable to quantitative and qualitative research as well as to improve their ability to write research papers. The main topics for instruction include: the research process; major research methods; and the structure of a research paper. The research methods primarily studied include the experimental method, descriptive research, ethnography, case study, observation, survey research (questionnaire and interviews), content analysis/documentary analysis, and critical approaches to literature.", "schedule": "COURSE CALENDAR\r\n(SUBJECT TO CHANGE)\r\n\r\nWeek 1\r\n9/12\r\nAn Introduction to Research\r\n“How to Write a History Paper”\r\nAdvice from “Writing your Dissertation in Fifteen Minutes a Day” \r\n\r\nRead WRP Proposal: p. 7, Establishing a Schedule: p. 8–9\r\n\r\nWeek 2\r\n 9/19\r\nChoosing A Topic &\r\n“Dealing with Distractions”\r\nRead Chapter 2: Finding a Topic, Drafting the Research Proposal, pp. 10–17, pp. 25–30\r\nDo #1 on WRP p. 30 and either #2, #3, or #4.  Type up your results with the question #s labeled. \r\n\r\nWeek 3 \r\n9/26\r\nIdentifying and Using Library Sources & Important Websites\r\nRead the “Avoiding Cut-and-Paste Plagiarism” research tip on p. 43. \r\nRead “Using Keywords and Boolean Expressions, pp. 49–52. \r\nRead the “Avoiding Unintentional Plagiarism” Research Tip on pp. 56–57. \r\nRead pp. 68–72 (starting with 4k).\r\n\r\nWeek 4\r\n 10/3\r\nReading and Evaluating Sources \r\n “Preparing an Annotated Bibliography and Review of Literature” WRP p. 135–43.\r\nGroup projects: WRP p.  97–106, 120–27, 127–34,\r\nRead Gathering Sources in the Library, p. 73–75, \r\nRead “Paraphrasing a Passage to Avoid Plagiarism” p. 84. \r\n\r\nWeek 5 \r\n10/10\r\nNational Day—No class\r\n\r\nWeek 6 \r\n10/17\r\n “Taking Notes”\r\n“They Say/I Say”\r\nRead “Piles, Stacks, Folders”\r\nRead Writing Effective Notes and Creating Outlines, WRP pp. 145–157\r\n\r\nNTUT/Tai Da Library and Database Project Due\r\n\r\nWeek 7 \r\n10/24\r\n MLA style\r\nGroup Projects: WRP p. 183–88, p. 188–94, pp. 194–99, 200–07. \r\n\r\nWeek 8\r\n10/31\r\nDrafting the Paper/Making an Argument\r\n\r\nLogical Fallacies\r\nRead ch.1 of Proofiness (“Phony Facts, Phony Figures”)\r\nGroup Projects on WRP Chapter 10: Drafting the Paper in an Academic Style pp. 166–72, pp. 172–77, pp. 178–82\r\n\r\nWeek 9\r\n11/7\r\nWriting the Paper\r\n\r\nSignal Phrases\r\nRead WRP, Ch. 12: Writing the Introduction, Body, and Conclusion, pp. 208–26\r\n\r\nResearch Proposal with Annotated Bibliography Due\r\n\r\n\r\nThis syllabus may be modified at my discretion.", "scorePolicy": "GRADING AND OTHER POLICIES\r\n\r\nGrade Percentages:\r\nPresentation: 20%\r\nQuizzes: 20%\r\nAssignments: 30%\r\nProposal and Annotated Bibliography: 20%\r\nParticipation: 10%\r\n\r\nI may modify these grade weights at my discretion. If I do so, I will let you know. \r\n\r\nGrading Criteria:\r\n\r\nA\tSuperior work. Achievement that is outstanding relative to the level necessary to meet course requirements.\r\n\r\nB\tAchievement that is significantly above the level necessary to meet course requirements.\r\n\r\nC \tAchievement that meets the course requirements in every respect. \r\n\r\nD \tAchievement that fails to meet fully the course requirements. \r\n\r\nF \tAchievement that is not worthy of credit. The only way to outright fail this course is through lack of effort. The student may not participate in classroom work. Assignments are either (a) completed but not completed at a level of achievement that is not worthy of credit; (b) frequently late, thereby lowering the grade too significantly to give the student a chance to pass; or (c) never completed at all.", "materials": "TEXTS\r\n\r\n‧\tLester, James D. and James D. Lester, Jr. Writing Research Papers: A Complete Guide.14th ed. Boston: Pearson, 2012. Print. \r\n‧\tCourse Packet and/or e-mailed readings and handouts. Please print these. \r\n\r\nSUPPLIES\r\n‧\tA journal, pens, and loose-leaf paper for in-class writing and quizzes\r\n‧\tA dry-erase marker and a cleaning cloth", "foreignLanguageTextbooks": false}]