[{"name": "黃品堯", "email": "parergonalite@gmail.com", "latestUpdate": "2013-09-06 11:47:51", "objective": "The main purpose of this course is to keep students from thinking architecture solely as an economic or aesthetic problem. Given the fact that this discipline exercises huge impacts on lives as well as built and natural environments, each question must be examined in terms of what is morally right or wrong at the same time. The progression of this semester will be structured by topics in environmental ethics and divided into three parts: A. Basic concepts, B. Environmental ethics as applied ethics, and C. Theories of environmental ethics. Meanwhile, the course aims also at preparing students for ethical difficulties they will come across at work and enhance their sense of responsibility. Different moral dilemmas that architects encounter generally in professional practice will be regularly proposed and discussed in class. The case studies will be taken from five categories: 1. General obligations, 2. Obligations to the public, 3. Obligations to the client, 4. Obligations to the profession, 5. Obligations to colleagues.\r\n\r\n本課程的主要目標是期待學生不再單純把建築視為一個經濟的或美學的問題。鑒於這個領域對人造以及自然環境的巨大影響，所有問題都應同時由道德上的對與錯這個角度來進行審視。本學期的進度將由環境倫理學的議題所構成，並分為以下三大部分：一、基本概念，二、作為應用倫理學的環境倫理學，三、環境倫理學理論。這門課同時希望協助同學處理未來會在職場上遇到的倫理困境並提高其責任感。課堂上將固定地提出建築師一般會在實務中遇到的各類道德兩難，並讓同學討論。案例取自五個範疇：一、基本責任，二、公共責任，三、對客戶的責任，四、職業道德，五、對同事的責任。", "schedule": "Week1. Science, Politics, and Ethics\r\nWeek2. Ethical theories and the environment (1)\r\nWeek3. Ethical theories and the environment (2)\r\nWeek4. Ethical theories and the environment (3)\r\nWeek5. Ethical theories and the environment (4)\r\nWeek6. Ethics and economics: Managing public lands\r\nWeek7. Sustainability and responsibilities to the future\r\nWeek8. Responsibilities to the natural world: From anthropocentric to \r\n             non-anthropocentric ethics\r\nWeek9. Midterm exam\r\nWeek10. Biocentric ethics and the inherent value of life\r\nWeek11. Wilderness, ecology and ethics\r\nWeek12. The land ethics\r\nWeek13. Deep ecology and ecofeminism\r\nWeek14. Environmental justice and social ecology\r\nWeek15. Pluralism, pragmatism and sustainability\r\nWeek16. Presentation (1)\r\nWeek17. Presentation (2)\r\nWeek18. Final exam", "scorePolicy": "Midterm exam 30%\r\nFinal exam 30%\r\nPresentation 40%", "materials": "Desjardis, J. R., 2013, Environmental Ethics. An Introduction to Environmental   \r\n    Philosophy. Boston, Wadsworth.\r\nFisher, T., 2010. Ethics for Architects: 50 Dilemmas of Professional Practice. New \r\n    York, Princeton Architectural Press.", "foreignLanguageTextbooks": false}]