[{"name": "徐健達", "email": "atatsu@seed.net.tw", "latestUpdate": "2008-10-28 22:01:25", "objective": "本課程以與學生日常生活相關的情境為主題，協助學生建立自然、流利的英語溝通技巧。語程側重訓練學生下列語言能力；(1)重音、縮音、連音、及語調等發音基礎訓練；(2)聆聽大意及特定資訊之能力；(3)熟悉英語人士日常生活情境及與學生將來就業環境相關之會話及適當之應對方式。本課程使用語言教室視聽器材實施教學。除聆聽錄音教材、配對練習、角色扮演、演說、表演短劇、及小組討論外，並佐以錄影教材，以加強實際演練與師生互動。", "schedule": "Course Objective\r\nThe major purpose of Oral-Aural Drills in English is to help you become a more competent and confident speaker in English by training your proficiency in the essential expressions and conversation skills for daily communications. Close attention will also be directed to the productive uses of learning tools and related online resources with the hope to expand the one-semester course into a sustainable pursuit for ongoing improvement of your English conversation ability.\r\nCourse Description\r\nThe course adopts an interactive approach to language learning by providing you with ample opportunities for actual listening and speaking practices based both on the textbook lessons and in-class activities like Bingo game and interviews. An optional course project will be announced after the mid-term examination; students are encouraged to grasp the opportunity to earn extra (bonus) grades. The instructor also places considerable emphasis on exploring together with you some effective ways and tools for learning English and improving one’s English conversation and listening abilities.\r\nCourse Schedule\r\nSeptember 10 / Course Orientation – I AM Learning English\r\nSeptember 17 / Introduction to Online English Learning Resources\r\nSeptember 24 / Using English-English Dictionaries – Why and How\r\nOctober 1\t / Unit 1: Relationships\r\nOctober 8\t / Unit 2: Identity\r\nOctober 15 / Unit 3: Advice\r\nOctober 22 / In-Class Presentations\r\nOctober 29 / Mid-Term Course Review\r\nNovember 5 / Mid-Term Examination\r\nNovember 12 / Bingo Game – Course Project\r\nNovember 19 / Unit 4-1: Family\r\nNovember 26 / Unit 4-2: Family\r\nDecember 3 / Unit 5-1: Decisions\r\nDecember 10 / Unit 5-2: Decisions\r\nDecember 17 / Unit 6-1: Language\r\nDecember 24 / Unit 6-2: Language\r\nDecember 31 / Final Course Review\r\nJanuary 7\t / Final Examination\r\n", "scorePolicy": "Course Requirements\r\nYour instructor teaches the course with the basic assumption that you are taking the course because you have a strong desire to improve your English speaking ability. The most crucial course requirement is therefore for you to constantly demonstrate that desire to the instructor, and one of the best ways to do that is for you to come to the class fully prepared to TALK.\r\nIn addition to the above course introduction, please read through the following important notes about Oral-Aural Drills in English to confirm your drop-and-add decision:\r\nI.\r\nLectures on the instructor’s part will be primarily in English followed by Chinese synopsis (that is, approximately 60% in English and 40% in Chinese).\r\nII.\r\nThe instructor will do his best to create a relaxed and friendly learning ambience to facilitate your class participation which is a must for this course. Any failure to raise questions, answer questions or enter discussions will seriously jeopardize your grade. Please keep in mind this rationale (underlying principle) of your instructor’s teaching: “It you do not talk, then why should I?!”\r\nIII.\r\nIn the case of unavoidable absence, you are required to inform the instructor of the reason (prior to the absence, if possible) by e-mail. Students found absent without any previous notice are top candidates for class failure.\r\nGrading Criteria\r\nMid-Term Examination: \t30%\r\nFinal Examination: \t30%\r\nQuizzes and Assignments:\t20%\r\nAttendance & Participation:\t20%\r\nCourse Project:\t\tExtra Bonus\r\n", "materials": "Harsch, Kenton and Kte Wolfe-Quintero. Impact Listening - Book 3. Hong Kong, Longman Asia ELT, 2007.\r\nBreaking News English (http://www.breakingnewsenglish.com/)\r\nCalifornia Distance Learning Project (http://www.cdlponline.org/)\r\nELL – English Listening Lounge (http://www.englishlistening.com/)\r\nLiteracynet Learning Resources (http://www.literacynet.org/cnnsf/)\r\nRandall’s ESL Cyber Listening Lab (http://www.esl-lab.com/)\r\nTakako’s Great Adventure (http://international.ouc.bc.ca/takako/)\r\nYolango – Video English Lessons (http://www.yolango.com/)", "foreignLanguageTextbooks": false}]