[{"name": "柯萊恩", "email": "kcline@ntut.edu.tw", "latestUpdate": "2008-09-18 17:47:24", "objective": "In this course we will introduce and develop skills and techniques necessary for the preparation of a research paper.  Students will read and discuss primary and secondary sources from Eastern and Western wisdom traditions and compose four short (3-5 page) papers and one medium length (5-8 page) essay based on these works.  Today, the first day of class, you will select a primary text at random from those I have available.  Your research topic for this semester will be derived from this original source, but it will be your responsibility to find more research materials--books, articles, films, interviews, musical compositions, poems, stories: anything that can be documented-- on your topic.  It will also be up to you to find an angle on your material: perhaps it will be a study of the culture, mythology, religion, or lifestyle from which your original source is drawn. Perhaps it will be a comparative work—examining beliefs from more than one culture.  Perhaps it will be an examination of music, art or literature contemporaneous with your source text As long as your final result includes the first text you selected in some significant manner, you will have accomplished the task I am assigning.", "schedule": "All assignments are due next class session unless otherwise indicated.  For complete details of formal writing assignments and informal writing tasks (journal entries), please see appropriate writing assignment or journal entry schedule.\r\n\r\nSeptember 12\tIntroduction\r\nASSIGNMENT: Journal Entry (JE) #1\r\n\r\nSeptember 19\tDiscuss Journal Entry #1\r\n\r\nSeptember 26\tDiscuss Journal Entry #1/ MLA Format\r\n\t\tASSIGNMENT:  JE#2\r\n\r\nOctober 3\tDiscuss JE#2\r\n\r\nOctober 17\tDiscuss JE#2/ discuss MIDTERM PAPER\r\n\r\nOctober 24\tDraft MIDTERM PAPER (with three extra copies) DUE\r\n\r\nOctober 31\tMIDTERM PAPER DUE\r\n\t\tAssignment:  JE#3\r\n\r\nNovember 7\tDiscuss JE#3/ Prepare for Presentations\r\n\r\nNovember 14\tDiscuss JE#3/ Prepare for Presentations\r\n\t\tAssignment:  JE#4\r\n\r\nNovember 21\tDiscuss JE#4/ Prepare for Presentations\r\n\r\nNovember 28\tDiscuss JE#4/  Group Presentations I\r\n \r\nDecember 5\tGroup Presentations II/ Discuss Final Paper\r\n\t\tAssignment:  Collect Together Everything Written So Far; Begin Writing Rough Draft\r\n\r\nDecember 12\tGroup Presentation III/ Conferences I\r\n\r\nDecember 19\tConferences II\r\n\r\nDecember 26\tDRAFT (WITH THREE EXTRA COPIES) OF FINAL PAPER DUE\r\n\r\nJanuary 2\tDRAFT (WITH THREE EXTRA COPIES) OF FINAL PAPER DUE\r\n\r\nJanuary 7\tFINAL PAPER DUE\r\n", "scorePolicy": "25%  Midterm Paper\r\n25%  Journal Writing\r\n25%  Final Paper\r\n25%  Participation and Presentation\r\n\r\n", "materials": "　", "foreignLanguageTextbooks": false}]