[{"name": "楊韻華", "email": "yhyang@ntut.edu.tw", "latestUpdate": "2008-09-22 09:00:33", "objective": "Course Description: The course is designed for English-major students who wish to increase their knowledge in business-related issues and expertise in future business practice.  All students enrolled in this course are expected to be equipped with an advanced level of English proficiency as well as basic knowledge of effective business communication as it continues where Business English Writing left off.  This course covers fundamental business concepts, important current business events, essential business terms, and comprehensive language used in business practice. Articles and commentaries selected from various issues of Harvard Business Review will be the primary course materials, providing extensive professional field contents to illuminate the complexity of today’s business world. During the semester, a series of video forums on economy and modern business management will be viewed and discussed during the class. Also, students are required to read the current issues of several prestigious business publications, including but not limited to, Fortune, The Economist, BusinessWeek, Wall Street Journal and the New York Times. \r\nCourse Objectives:  This course centers its focus on understanding business context in English, and it aims to help the students:\r\n(1)\tlearn about business through the medium of English \r\n(2)\tpromote high level of awareness of the business climate \r\n(3)\timprove reading comprehension of articles relating to business\r\n(4)\tdevelop functional business language in English \t\r\nCourse requirements:\r\nEach student must complete the following requirements:  \r\n1)\tattendance* noted for grading details\r\n2)\tpresenting course unit as assigned * noted for panel assignment    \r\n3)\tparticipating in video forum and article discussions\r\nStudent Assignments and Class Activities:\r\n\t\t\t\t(A) Students are obligated to \r\n1)\tpresent course units as assigned with annotated handouts with full-length translation as well as extensive notes on vocabulary, phrases and terms. \r\n2)\tprepare a short bilingual summary for weekly video forum and extensive notes on vocabulary, terms and essential background knowledge.\r\n3)\tparticipate in group discussions and business simulations and problem-solving activities.\r\n (B) compile a dossier with all extended materials in preparation of unit presentation, notes and feedbacks provided by course instructor and fellow students, and a short critique regarding the current unit article. The dossier is required to be submitted two weeks after the presentation, both in hardcopy and on a compact-disc. \r\n", "schedule": "As Scheduled. \r\n", "scorePolicy": "Grading Policy:\t\t\r\nDiscussion / Presentation Sessions (Harvard Business Review) \t20%\tAs assigned \r\nIn-Class Oral Test \r\n* Students will be asked about questions regarding the previous presentation content of both the business reading and video. \r\n*Approximately 3-5 students will be appointed to take the oral test in each class session. Each question will require students to answer analytically and concisely. Duration of time for each anticipated answer of talk will be no more than one minutes.\t20%\tNo test make-up will be considered w/o official approval beforehand or medical statement(issued by public hospitals) in case of illness \r\n\r\nWeekly Video Forum / Article Briefing \t20%\tAs assigned\r\nFinal Exam (Format TBD) \t20%\tWeek 18 \r\nAttendance \t20%\t5% reduction for each unexcused absence\r\nSemester Grade \t100%\t\r\n", "materials": "Required Text:    (1) Harvard Business Review               \r\n(2) Selected video series (Commanding Heights: the Battle for the World Economy, PBS Frontline Series) \r\n(3) Selected business journal articles", "foreignLanguageTextbooks": false}]