[{"name": "楊韻華", "email": "yhyang@ntut.edu.tw", "latestUpdate": "2008-09-22 09:05:00", "objective": "本課主旨在設計課程，提供練習，俾使學生嫻熟各式的英語測驗，如全民英檢、托福測驗、TOEIC 測驗或類似性質的測驗，希冀能夠藉由本課程的修習，提升學生不斷的學習外國語的興致，並且，藉由通過考試取得證照，增加未來職場的競爭力。\tCourse Description:\tThis course is designed for university-level students with a high intermediate to advanced ability in English as a second language to prepare for the TOEIC (Test of English for International Communication) as well as to facilitate their English communication ability for future career success.  The course emphasizes listening and reading comprehension skills within the context of business, technology, international trade, diplomacy, and important global economic and political issues.", "schedule": "As Scheduled. N/A", "scorePolicy": "Course Requirements & Evaluation:\r\n\tStudents will be evaluated by the following 5 components. \r\n1)\tclass participation & attendance      (30%)\r\n2)\tFinal Exam_ TOEIC Mock Test \t   (40%)\r\n3)\tIn-class monthly partial TOEIC mock tests (30%) \r\nQuizzes & Assignments: 1) Three to four in class partial TOEIC mock tests shall be expected throughout the semester. The test will be based on the in-class materials and other TOEIC-related content, and administered by course TAs. \r\n2) A complete TOEIC mock test will be administered at the end of the semester. \r\nAttendance Policy:\tClass attendance is mandatory in this class. Students can be legitimately excused from one class session (2 hrs) and will not be penalized. After that, each absence will result in a grade reduction of 5%. \r\nExtra Credit Policy: (1) Students are highly encouraged to present verbal reports on related topics or serve as an assistant teacher in this class. Each verbal report or assistant teaching generates extra credits and 5-10 bonus points.\r\n\t(2) Students who participate in the official TOEIC exam and achieve above 750 (with official test report) can be granted a waiver of the final exam. \r\n", "materials": "Compiled Handouts", "foreignLanguageTextbooks": false}]