[{"name": "楊韻華", "email": "yhyang@ntut.edu.tw", "latestUpdate": "2008-09-22 09:05:48", "objective": "本課程旨在訓練學生公開表達之能力，內容包括語言表達基本原則與技巧、肢體語言與演講要領，備題演講及即席演講演練。\t\t\tCourse Description: \tThis course aims to establish the foundation for English-major students to deliver public speeches in English. Students learn to select topics, collect essential information, analyze the audience, organize materials, improve delivery skills, distinguish different types of speeches, and further to evaluate their own and others’ speeches. Each student is expected to deliver at least 3-4 individual speeches, and 2-3 debates. Speech topics will be assigned to students. Any modifications of the speech topics will have to be approved by the instructor. All student speech sessions must be videotaped.(*1)\r\nCourse Requirements: \tStudents’ responsibilities in this class include:\r\n(1)\tAttending class regularly and to arrive on time: a sign-in sheet to record attendance / a grade reduction of 5% of the semester grade for each class session missed absence\r\n(2)\tAll presentations assigned\r\n(3)\tDelivering speeches as scheduled:\r\ni.\tStudents are required to present their speeches on the day scheduled;\r\nii.\tMake-up speech will be allowed only when the failure to perform is due to an officially excused absence at the instructor’s discretion.\r\niii.\tThe ideal time duration for each speech is 4 to 6 minutes. The minimum length of speech time is 3 minutes, and the maximum 6 minutes. Violation of the time limit (less than 3 and more than 6) will create a 10-point deduction. The time length for debates will vary due to the different formats employed.\r\n(4)\tSubmitting to the instructor a speaker’s dossier with inclusion of the outlined speech as well as its full-length version, the self-evaluating commentary of previous presentation(s) and also blank A-4 size lined sheets for notes and feedbacks (see Appendix 1) when presenting the speech. Failure to submit will generate a penalty of 20 points (out of 100) in each speech. Students who fail to comply with the outline format requirements (sampled and specified below) will forfeit the opportunity to deliver the current speech / debate.\r\n(5)\tDistributing the current speech outline(s) to fellow students at the beginning of each class session\r\n(6)\tEvaluating one’s own speech: all speeches have to be videotaped by the student speaker. Student speakers are required to watch their own videotaped performance, observe their own speeches, and later submit a self-evaluating commentary to the instructor a week after the speech presentation. Students are strongly advised to use their own videotaping devices. A complete portfolio needs to be established and submitted at the semester end.\r\n(7)\tOffering constructive opinions and feedbacks of the fellow students as speakers: Students are encouraged to give verbal / oral commentary of the fellow students’ speeches, and with the objectively constructed criticism, the student evaluators will earn 3% grade points to their semester grades.\r\n", "schedule": "Public Speaking and Debate_ Weekly Schedule, Fall 2008\r\nWeek_ Date\tSession Task \tSession Administrator(s)\tNote\r\n1_0908\tOrientation \tDr. Yang\r\n2_0915\tGeneral Public Speaking Guidelines\tDr. Yang\r\n3_0922\tIntroductory Speech \tDr. Yang & Students \tImpromptu (2-3 mins)\r\n4_0929\tGuidelines for Informative / Persuasive Speech\tDr. Yang & Students\r\n5_1006\tDelivery of Informative Speeches (1)\tDr. Yang & Students\tExtemporaneous (3-4 mins)\r\n6_1013\tDelivery of Informative Speeches (2)\tDr. Yang & Students\tExtemporaneous (3-4 mins)\r\n7_1020\tDelivery of Persuasive Speeches_ General Human Interest (1)\tDr. Yang & Students\tMemorized\r\n(4-5 mins)\r\n8_1027\tDelivery of Persuasive Speeches_ General Human Interest (2)\tDr. Yang & Students\tMemorized\r\n(4-5 mins)\r\n9_1103\tDelivery of Analytical Speech_ Social / Public Concerns (1)\tDr. Yang & Students\tMemorized\r\n(4-5 mins)\r\n10_1110\tDelivery of Analytical Speeches_ Social / Public Concerns (2)\tDr. Yang & Students\tMemorized\r\n(4-5 mins)\r\n11_1117\tGuidelines for Debate\tDr. Yang\r\n12_1124\tPreparing for Debate (Standard)\tDr. Yang & Students\r\n13_1201\tDebate 1-1 (Standard)  \tDr. Yang & Students\r\n14_1208\tDebate 1-2 (Standard)\tDr. Yang & Students\r\n15_1215\tPreparing for Debate (Cross-Ex.) \tDr. Yang & Students\r\n16_1222\tDebate 2-1 (Cross-Ex.)\tDr. Yang & Students\r\n17_1229\tDebate 2-2 (Cross-Ex.)\tDr. Yang & Students\r\n18_0105\tFinal Debate Match (Lincoln-Douglas)\tDr. Yang & Students\r\n*The above weekly schedule is subject to necessary modifications as the class proceeds.\r\nSpeech Topics: Choose ONE for the following topics\r\n(A)\tIntroductory Speech Topics\r\n1.\tWill I ever go from rags to riches?\r\n2.\tThings That Trouble Me Most in My College Life\r\n3.\tHow Misery Loves Company: My Story\r\n4.\tEvery Cloud Has a Silver Lining: My Story\r\n5.\tHow many baskets do you have to hold all your eggs? Which basket(s) will you ever put all or most of them in?\r\n(B)\tInformative Speech Topics\r\n1.\tHow inflation rate eats up our earnings?\r\n2.\tThe Comparison of Presidential System and Parliamentary System\r\n3.\tHow is the U.S. President elected? (The U.S. Presidential Election Process)\r\n4.\tThe Republican Party vs. the Democratic Party\r\n5.\tJohn McCain vs. Barack Obama\r\n(C)\tPersuasive Speech Areas: Develop your own topic from the following areas\r\n1.\tEnergy & Food Crisis\r\n2.\tEnvironmental Sustainability\r\n3.\tHomosexuality\r\n4.\tCriminal Justice\r\n5.\tDietary & Nutritional Balance\r\n6.\tLiteracy\r\n(D)\tAnalytical Speech: Choose a publicly and socially controversial topic, which raises concerns and debates, in the local and international community. Submit the topic for the instructor’s approval by Oct. 20 to ensure you have ample time for preparation.\r\n", "scorePolicy": "Component\tGrade Percentage\r\nAttendance *2)\t20% (full attendance) (*2)\r\nIndividual Introductory Speech (extemporaneous )*3 \t5%\r\nIndividual Informative Speech (extemporaneous w/visual aids)\t10% (peer evaluated)\r\nIndividual Persuasive Speech_ Human Interest / Life & Leisure Topics (memorized)\t10% (peer evaluated)\r\nIndividual Analytical Speech_ Social /Public Concerns\t10% (peer evaluated)\r\nIntroduction to General Speech Skills / Informative / Persuasive Speech \t5%\r\nGroup Debate 1 (Standard format) \t15%\r\nGroup Debate 2 (Cross-Examination format) \t15%\r\nFinal Debate Match (Lincoln-Douglas format / impromptu)*4\t10%\r\nSpeech Assessment Portfolio (Speech outlines, scripts audios, commentary notes and peer evaluation entries) \tRequired (*5)\r\n", "materials": "Notes:\r\n*1) Student speakers need to videotape their speeches each time and submit the digital recordings at the end of the semester.\r\n* 2) Students are obligated to attend all class sessions. Each absence will generate 5% point deduction of the semester grades on the 100% scale.\r\n*3) All extemporaneous speeches allow speakers to deliver the speech with its outline / note card. Speech delivery with full-length script will result in the total loss of the component grade.\r\n*4) The implementation of the final debate match will likely to be subject to certain contingent occurrences as the class proceeds. Exact date, format and related matters will have to be discussed and determined later in the semester.\r\n* 5) Students are required to submit the speech assessment portfolio at the end of the semester. Failure to submit the portfolio will override the grades received in other grading components and thus results in a failing grade.\r\n", "foreignLanguageTextbooks": false}]