[{"name": "陳雅玫", "email": "ymchen@ntut.edu.tw", "latestUpdate": "2008-09-18 14:44:20", "objective": "This is an introductory course aiming to familiarize students with basic concepts of translation, including qualifications of good translators, the procedure of translation, use of references & electronic tools and the idea of translation equivalence. Also, the relevance of contrastive studies between English and Chinese to translation will be introduced. A guided application of the linguistic knowledge to practical work will be provided, in the interest of assisting students in formulating suitable and appropriate translation strategies and techniques. This course is intended to prepare students for more specialized translation training.", "schedule": "Week 1: course introduction\r\nWeek 2: lecture on “what makes a good translator?”; exercises\r\nWeek 3: oral report; lecture on: (1) procedure of translation;\r\n(2)  references & electrical tools\r\nWeek 4: oral report; lecture on translation equivalence\r\nWeek 5: oral report; lecture on contrastive studies of lexicon & translation (1)\r\nWeek 6: oral report; lecture on contrastive studies of lexicon & translation (2)\r\nWeek 7: oral report; lecture on contrastive studies of verbs &\r\ntranslation\r\nWeek 8: oral report; lecture on contrastive studies of nouns and pronouns & translation\r\nWeek 9: Mid-term exam\r\nWeek 10: oral report; lecture on contrastive studies of prepositions and articles & translation \r\nWeek 11: oral report; lecture on contrastive studies of adjectives and adverbs & translation \r\nWeek 12: oral report ; lecture on contrastive of conjunctions and negative constructions & translation\r\nWeek 13: oral report; lecture on contrastive studies of word order & translation (1)\r\nWeek 14: oral report; lecture on contrastive studies of word order &\r\ntranslation (2)\r\nWeek 15: oral report; lecture on idioms & translation\r\nWeek 16: oral report; lecture on cultures & translation\r\nWeek 17: wrap up\r\nWeek 18: Final exam\r\n", "scorePolicy": "(1) attendance & participation: 15%\r\n(2) presentation: 15%\r\n(3) assignment: 25%\r\n(4) mid-term exam: 20%\r\n(5) final-exam: 25%\r\n", "materials": "Teaching materials:\r\n  (1) instructor’s lecture handouts\r\n  (2) selected readings from the following books: \r\n     (a) main textbook: 英漢比較與翻譯（陳定安）\r\n     (b) supplementary reference: 文體與翻譯 （劉宓慶）\r\n         翻譯教程：翻譯的原則與方法 (Peter Newmark)\r\n         英漢翻譯理論與實踐\r\n\r\nPre-readings: \r\n(1) Week 3: (a) 翻譯教程：第二章 翻譯操作的過程\r\n            (b) 翻譯教程：第十六章 工具書的用法\r\n(2) Week 4: (a) 文體與翻譯：1.1 論直譯與意譯 p. 20-29\r\n            (b) 英漢翻譯理論與實踐：第三章 翻譯的基本概念和問題\r\n(3) Week 5: (a) 第四章：一、關於英漢詞彙若干特點的比較\r\n            (b) 第四章：二、英漢詞彙互譯的一些方法 \r\n(4) Week 6: (a) 第四章：三（二）詞或詞組的重複\r\n            (b) 第四章：三（三）專業詞的翻譯\r\n            (c) 第一章：八、英漢詞義比較     \r\n(5) Week 7: (a) 第二章：二、英漢動詞的差別\r\n            (b) 第二章：十二（二）英漢被動式的比較與翻譯\r\n(6) Week 8: (a) 第二章：一、英漢名詞的差別\r\n            (b) 第二章：五、英漢代詞的差別\r\n(7) Week 10: (a) 第二章：六、英漢介詞的差別\r\n             (b) 第二章：十、關於英語冠詞\r\n(8) Week 11: (a) 第二章：三、英漢形容詞的差別\r\n             (b) 第二章：四、英漢副詞的差別\r\n(9) Week 12: (a) 第二章：七、英漢連詞的差別\r\n             (b) 第二章：十二（三）英漢否定式的比較與翻譯\r\n(10) Week 13: 第三章 英漢詞序比較\r\n(11) Week 14: (a) 英漢翻譯教程：第五章第三節名詞從句的譯法\r\n              (b) 文體與翻譯：1.22 修飾語的前置與後置\r\n(12) Week 15: 第五章 英漢成語的比較與翻譯\r\n\r\nRequirements & Rules:\r\n1. Please turn off your cell phone during the two-hour class period.\r\n\r\n2. Absence: Students are expected to attend the class ON TIME. \r\n(1) Being late for more than TWENTY minutes equals one hour unexcused absence. One hour UNEXCUSED absence results in 2 points deduction, whereas one hour EXCUSED absence results in 1 point deduction.  \r\n(2) For an absence to be excused, students need to submit compelling evidence of the gravity or unforseeability of the event causing the absence within ONE WEEK. \r\n(3) Students missing more than TEN hours excused or unexcused will have a fail.\r\n(4) Absence from a class is no excuse for not knowing the assignment and what has been discussed in that class. There will be NO MAKE-UP EXAM unless you have valid and official reasons for absence BEFOREHAND.\r\n\r\n3. Assignment: \r\n  (1) Translation assignments will be given periodically throughout the course. All translation assignments have to be typed. Further details concerning the format will be provided in WEEK 3. \r\n(2) Each assignment goes through the following stages: (a) submission of the first draft by due date, (b) discussion of assignment in class, and (c) submission of the second draft, which will be evaluated. \r\n(3) All assignments must be submitted via e-mail by 5pm Saturday. For late assignments, 20% of the assignment mark will be deducted each day. Assignments more than THREE days late will not be accepted\r\n\r\n4. Pre-readings and PowerPoint presentations\r\n(1) All students are expected to complete the assigned pre-readings before classes. All articles covered by the pre-readings are included for the mid-term or final exams.\r\n(2) Students will be divided into several groups. Each group (around 3-4 persons) takes turns making PowerPoint presentations of the articles covered by the pre-readings. \r\n(3) Guidelines for the oral reports are given below: \r\n(a) PowerPoint presentations must be made in ENGLISH.\r\n(b) E-mail the PowerPoint slides to the instructor by 5 pm Sunady. \r\n(c) Each PowerPoint presentation should be 12-15 minutes long. Members of every group must take turns making presentation within each oral presentation\r\n\r\n", "foreignLanguageTextbooks": false}]