[{"name": "周素鳳", "email": "sfchou@ntut.edu.tw", "latestUpdate": "2008-09-08 20:44:12", "objective": "This course aims to enhance students’ competence in English through reading short essays. The reading will cover a wide range of topics selected from books, newspaper and magazines.  Special emphasis will be put on vocabulary development, text summarization, and critical comprehension skills, such as identifying the main ideas and supporting details, recognizing context clues, drawing inferences and making critical judgments.\r\nObjectives:\r\nStudents who ultimately achieve the learning goals of the course should be able to\r\n• read challenging texts\r\n• grasp the main ideas and supporting material\r\n• formulate a personal response.\r\n• analyze materials critically\r\n•draw valid inferences and conclusions.\r\n", "schedule": "Readings\r\n1.\tThe Booming Era for the Celebrity Pitchman\r\n2.                  ”\r\n3.       America Needs Its Nerds\r\n4.       Daring to Seek Silence, and Ideas, in the Wired World’s Din\r\n5.       Live Each Moment for What It’s Worth\r\n6.       Three Passions I Have Lived For\r\n7.       Review and Discussion\r\n8.       Midterm Exam\r\n9.       A Struggle to Be an All American Girl\r\n10.\tCyberface: New Technology That Seems to Capture the Soul\r\n11.             ”\r\n12.\tThe Minnie Mouse Kitchen\r\n13.\tCredits Become Casualty of Internet Age\r\n14.\tPass the Popcorn, Please\r\n15.                 ”\r\n16.\tThe Decline of Neatness\r\n17.      Final Exam\r\n18.      Discussion\r\n", "scorePolicy": "Grading:\r\n1.\tMidterm and Final: 50%\r\n2.\tOral Test: 10%\r\n3.\tIn-class practice: 20%\r\n4.\tQuiz: 20%\r\n", "materials": "Requirements:\r\n1.Your regular attendance is required to pass this course.\r\n3 unexcused absences from class will result in failing for this\r\ncourse.  Excused absences require that I be notified on or before\r\nclass date, or official documentation shortly after the absence.\r\nOne unexcused absence will result in an automatic final score\r\nreduction of 3 points.  If you are more than 20 minutes late to\r\nthe class, it will be counted as an absence.  One late attendance\r\nmeans a 1 point reduction from your final score.\r\n2.  In addition to the vocabulary quiz given after each selected\r\ntext, there will be in-class activities (group discussion, or in-    class writing). If you fail to take the test or submit the\r\nassignment by the end of the class, there is no way to make it\r\nup (no exceptions).  However, two of your lowest score will be\r\ndropped—so, save these for the unexpected occasions when you\r\nmight be sick or miss class for other reason.\r\n3.  Every student will be arranged to take an individual oral test.\r\nYou will be asked to summarize the texts covered in class and\r\nanswer questions.  Every week, 8 students will be assigned to\r\ntake the oral test, while all the other students will be given\r\ngroup activities, in-class practices in writing or translation\r\nwork.\r\n", "foreignLanguageTextbooks": false}]