[{"name": "范書愷", "email": "morrisfan@ntut.edu.tw", "latestUpdate": "2019-01-04 17:07:54", "objective": "使學生瞭解全面品質管理的意義、理念、重要性、範圍、實施條件、方法、品管工具，品管工具以外的管理工具、方法，實施全面品管遭遇到的問題，實施全面品質管理的預期成效。\r\nThis course examines concepts, tools, and techniques used in the management and measurement of quality, productivity, and competitiveness in an international environment.  It focuses on how firms add value and compare with quality.  Topics include total quality control and management, employee involvement in quality, team building for quality, quality circles, relation between quality, productivity and competitiveness, and statistical process control.  The course also emphasizes the development of decision-making skills through the use of case-study, consultation with local organizations, and other experimental activities.", "schedule": "Introduction\r\nQuality as Strategy\r\nFrom Product Inspection to Process Control\r\nWhat is TQM?\r\nThe Traditional Cost-of-Quality Model\r\nThe Emerging Cost-of-Quality Model\r\nContinuous Improvement: Graphic Tools\r\nContinuous Improvement: Numeric Data Summarization\r\nThe Seven-Step Method for Continuous Improvement\r\nStatistical Process Control:  The Red Beads Experiment\r\nControl Charts for Attributes\r\nOut-of-Control Patterns\r\nControl Charts for Variables\r\nStatistical Process Control:  The Funnel Experiment\r\nThe KJ Method (Affinity Diagrams)\r\nProcess Capability and Six Sigma Quality\r\nTaguchi’s Loss Function\r\nRelationship Between the Loss Function and Process Capability\r\nDesign of Experiments (Full Factorial Designs)\r\nTaguchi’s Orthogonal Arrays (Partial Factorial Designs)\r\nProduct Improvement by Application of Taguchi Methods\r\nQuality Function Deployment\r\nThe Product Development Process:  Defining the Product\r\nDeveloping the Product\r\nQuality Engineering (System Design, Parameter Design, and Tolerance Design)\r\nConcurrent Engineering\r\nReengineering and TQM", "scorePolicy": "The final grade will be based on the following items:\r\n\r\n\t10%\tClass presentation\r\n\t20%\tHomework\r\n\t30%\tMidterm exam\r\n\t40%\tFinal exam or term project", "materials": "Rao, A., L. P. Carr, I. Dambolena, R. J. Kopp, J. Martin, F. Rafii, and P. F. Schlesinger, Total Quality Management:  A Cross Functional Perspective, John Wiley & Sons", "foreignLanguageTextbooks": true}]