[{"name": "朴維鎮", "email": "eugenepark993@gmail.com", "latestUpdate": "2018-12-28 15:36:21", "objective": "This course aims to introduce students to some fundamental principles and knowledge of statistics. Studying this subject also helps develop students’ ability to compile statistical data, carry out simple statistical calculation and understand the elements of probability and probability distributions. Applications of statistical techniques are emphasized to solve practical problems in science and engineering.", "schedule": "Week 1\tIntroduction to probability distribution, sampling distribution, and estimation\r\nWeek 2\tDecision making for a single sample – Estimation, hypothesis testing, inference on the mean of a population\r\nWeek 3\tDecision making for a single sample – Inference on the variance of a normal population, inference on a population proportion, goodness of fit test\r\nWeek 4\tDecision making for two samples – Inference on the means of two populations, paired t-test\r\nWeek 5\tDecision making for two samples – Inference on the ratio of variances of two normal populations, inference on two population proportions\r\nWeek 6\tSimple linear regression\r\nWeek 7\tMultiple linear regression\r\nWeek 8\tOther aspects of regression\r\nWeek 9\tMidterm exam (In-Class, 1 Cheat Sheet, Calculator)\r\nWeek 10\tFactorial design, replication, center points\r\nWeek 11\tBlocking, confounding, fractional factorial designs\r\nWeek 12\tResponse surface methods and designs\r\nWeek 13\tFactorial experiments with more than two levels\r\nWeek 14\tIntroduction to control charts\r\nWeek 15\tX-bar and R control chart\r\nWeek 16\tControl charts for individual measurements, process capability, control chart performance\r\nWeek 17\tAttributes control charts, measurement systems capability\r\nWeek 18\tFinal exam (In-Class, 1 Cheat sheet, Calculator)\r\nNot covers all parts of the course, but covers only what has been discussed after the second midterm.", "scorePolicy": "1. Midterm exam: 30 points – Test of covered topics\r\n2. Final exam: 35 points – Test of covered topics\r\n(Exam: The days and general contents of each of the two exams will be announced at least one week prior to the exams. The schedules of exams are given in tentative course schedule table. If you have an emergency or conflict, please notify me ASAP. Also, all works must be shown to receive full or partial credit. A missed exam will be assigned a grade of zero, unless a student has a university-approved excuse)\r\n3. Quiz: 30 points\r\n(Quizzes: Short, announced or non-announced in-class quizzes will be given at the beginning of some classes, to check your basic understanding of class material. No makeup quizzes will be given.)\r\n4. Attendance: 5 points\r\n(Attendance: You are expected to be present each class period except when special hardships occur, e.g. illness or emergency. For any medical issues please see the NTUT website for university policies. If there is an appropriate reason to miss class it is expected that the individual will email or discuss in person with the instructor at least one week in advance. And, students need to provide evidence for missing class (doctor’s note). If evidence is provided, the missed class is considered as an excused class. If no evidence is provided, the missed class is counted as an absence. Regular attendance is essential to the successful completion of this course and missing class can cause you to fall behind, which you definitely do not want to. If you miss a class, be sure to get the notes from another student and kindly provide me with an explanation for your absence. Attendance and class participation also affect your learning of the material as well as performance on assignments, quizzes, and exams. I expect you to arrive to class on time, pay close attention and take notes, and actively participate. An important part of class participation is asking questions if you are unsure about anything. Do not hesitate to ask me questions if you have them. I reserve the right to lower your course grade by half a letter grade (5%) if you have more than 3 absences. More than 5 absences will mean an attendance point zero.)", "materials": "Engineering Statistics (3rd Ed., Wiley) by Montgomery, Runger, and Hubele (ISBN: 978-0-324-59433-1)", "foreignLanguageTextbooks": true}]