[{"name": "黃如瑩", "email": "vinia@ntut.edu.tw", "latestUpdate": "2018-12-24 01:26:28", "objective": "Objectives: The treasure of literature, especially suitable and meaningful for children and teenagers, will be explored in a variety of learning activities in the class, including reading, discussions, role plays, creating picture books, and analyzing film adaptations with the aim to cultivate students’ full language skills and to enrich their cultural literacy in order to build a sound foundation for their future studies. \r\n目標:本課程的主旨在針對兒童文學與青少年文學的經典之作，給予同學們閱讀與分析上的訓練，並培養學生對不同文學主題和寫作風格的鑑賞能力。經由課堂上的學習活動(包括:閱讀,討論,角色扮演,繪本撰寫與製作,以及分析改編電影)來提升同學們整體的聽說讀寫英語能力,並增進對英語世界的文化辨識力,為未來的學業實力打下深厚的基礎.", "schedule": "I. Required Text:\r\n(1) Norse Mythology by Neil Gaiman  \r\n(2) A Monster Calls by Patrick Ness\r\nII. Syllabus\r\nWeek 1: \r\n(1) Introduction to the classical fairy tales and myths\r\n(2) Presentation on Norse mythology (Example: Thor I, II)\r\nUnit One: Mythology and Cultural Literacy\r\nWeek 2. \r\n(1) Presentation on Celtic mythology (Example: King Author)\r\n(2) A comparison among the gods and heroes in Norse myth, Celtic myths, and Greek myths, including Hercules, Theseus, Perseus, Achilles, and Odysseus\r\nWeek 3. \r\n(1) Presentation on modern adaptations of Greek mythology I (Example: Percy Jackson and the Olympians Series by Rick Riordan)\r\n(2) Norse Mythology, pp. 1-50 \r\nWeek 4. \r\n(1) Presentation on the modern adaptations of Greek mythology II (Example: Percy Jackson and the Olympians Series by Rick Riordan)\r\n(2) Norse Mythology, pp. 51-100\r\nWeek 5. \r\n(1) Presentation on Indian mythology and the modern adaptations (Example: the Life of Pi by Yan Martel)\r\n(2) Norse Mythology, pp. 101-150\r\nWeek 6. \r\n(1) Presentation on Beowulf \r\n(2) Norse Mythology, pp. 151-200\r\nWeek 7. \r\n(1) Presentation on the Hobbit by JRR Tolkien\r\n(2) Norse Mythology, pp. 201-250\r\nWeek 8. \r\n(1) Presentation on the Lord of the Rings by JRR Tolkien, Part I\r\n(2) Norse Mythology, pp. 251-283\r\nWeek 9 Midterm (written) exam\r\n(1) Presentation on the Lord of the Rings by JRR Tolkien, Part II\r\n(2) Written exam on Norse Mythology  by Neil Gaiman  \r\nUnit Two: Monsters and adventure\r\nWeek 10. \r\n(1) Presentation on A Monster Calls  by Patrick Ness\r\n(2) The interplay between the novel and the film adaptation\r\nWeek 11.\r\n(1) Tales of “Peter Rabbit and “Benjamin Bunny” by Beatrix Potter \r\n(2) Presentation on Miss Potter\r\n(3) A Monster Calls, Chapters 1-4\r\nWeek 12. \r\n(1) Presentation on the Wizard of Oz by L. Frank Baum\r\n(2) A Monster Calls, Chapters 5-8\r\nWeek 13.\r\n(1) Presentation on Alice in the Wonderland by Lewis Carroll\r\n(2) A Monster Calls, Chapters 9-12\r\nWeek 14.\r\n(1) Presentation on Spirited Away by Miyazaki Hayao\r\n(2) A Monster Calls, Chapters 13-16\r\nWeek 15.\r\n(1) Presentation on the Chronicles of Narnia by C.S. Lewis\r\n(2) A Monster Calls, Chapters 17-20\r\nWeek 16.\r\n(1) Presentation on the Harry Potter Series by J. K. Rowling \r\n(2) A Monster Calls, Chapters 21-25\r\nWeek 17.\r\n(1) The trilogy of Inkeart, Inkspell, and Inkdeath by Cornelia Funke\r\n(2) A Monster Calls, Chapters 26-30\r\nWeek 18. Final (written) exam\r\nWritten exam on A Monster Calls", "scorePolicy": "II. Percentile distribution for final grades:\r\n1. Weekly exams: 15 X 3% =45%\r\n2. Participation in the classroom discussion: 15%\r\n3. Midterm exam: 15%; Final exam: 15%", "materials": "Reference books:\r\n(1) The 20th-Century Children's Book Treasury. By Janet Schulman. New York: Alfred A. Knopf., 1998.\r\n(2) The 20th-Century Children's Poetry Treasury. Selected by Jack Prelutsky. Illustrated by Meilo So. New York: Alfred A. Knopf., 1999.\r\n(3) Beatrix Potter: The Complete Tales.  Authorized Edition by Frederick Warne. London: Penguin, 2002.\r\n(4) The Family Storybook Treasury:  Tales of Laughter, Curiosity, and Fun. New York: Houghton Mifflin Harcourt, 2011.\r\n(5) Jan Brett’s Snowy Treasury. By Jan Brett. New York: Penguin, 2007.\r\n(6) The Quentin Blake Treasury. By Quentin Blake.  London: Jonathan Cape, Random House, 2012.", "foreignLanguageTextbooks": true}]