[{"name": "羅梅君", "email": "mcl@mail.she.edu.tw", "latestUpdate": "2019-04-07 02:07:36", "objective": "本課程將介紹程式設計的基礎，透過腳本式語言及基礎程式語言的應用，培養學生程式設計的基本能力。本課程除加強技術開發能力外，也將導引學生，如何透過獨立思考來面對問題及分析問題，並透過程式的撰寫來解決問題。\r\nThis lecture starts as a set of tutorials for university level multimedia students. It’s presented in a non-threatening way that will ease students into programming and teach them to craft their own digital artwork and webpage/mobile apps and even combine works with hardware—no prior programming experience required. The Processing language will be used to visualize the concepts through the production of computer graphics that illustrate the coding principles while being artworks in their own right.\r\nOver the course, students will learn the basics by drawing/designing simple shapes, move on to photo/image editing and video manipulation, and ultimately affect the physical world by using Processing with multimedia.", "schedule": "第1週\t(Hello)The Beginning: Pixels, Processing and Interaction\r\n第2週\tStarting to Codes: Your First Program; Show; Save and New; Share\r\n第3週\tDraw: Display Window; Basic Shapes; Draw Order; Shape Property; Draw  Modes; Color; Custom Shape; Comments; Robot 1/Draw\r\n第4週\tVariables: First Variables; Making Variables; Processing Variables; Little Math; Repetition; Robot 2/Variables\r\n第5週\tResponses: Once and Forever; Follow; Modifying Global Variables; Click; Location; Type; Map; Robot 3/Responses\r\n第6週\tTranslate/Rotate/Scale: Translate; Rotate; Scale; Push and Pop; Robot/Translate, Rotate, Scale\r\n第7週\tHoliday (no lecture)\r\n第8週\tMid-Term\r\n第9週\tMedia: Images; Fonts; Shapes; Robot 5/Media\r\n第10週\tMotions: Frames; Speed and Direction; Tweening; Random; Timers; Circular; Robot 6/Motions\r\n第11週\tFunctions: Function Basics; Make a Function; Return Value; Robot 7: Functions\r\n第12週\tObjects: Fields and Methods; Define a Class; Create Objects; Robot 8/Objects\r\n第13週\tLists: From Variables to Lists; List Operations; Repetition and Lists; Lists of Objects; Robot 9/Lists\r\n第14週\tData and Dictionaries (I): Data Summary; Dictionaries; CSV Files; JSON; Network Data and APIs; Robot 10/Data\r\n第15週\tData and Dictionaries (II): Data Summary; Dictionaries; CSV Files; JSON; Network Data and APIs; Robot 10/Data \r\n第16週\tExtend I: Sound; Image and PDF Export; Hello Arduino\r\n第17週\tExtend II: Sound; Image and PDF Export; Hello Arduino\r\n第18週\tFinal-Exam (Project)", "scorePolicy": "平時成績(出席率、上課表現和作業):40%  期中成績:25%   期末考:35%\r\n上課表現包括:熱心教導同學,學習大進步,態度積極進取。 \r\n特別必須注意者：每周所交代規定之作業(Homework)若未繳交 (包含未完成基本該有的進度和功能，亦視同未繳交；就算是當周缺席未到課，仍然得繳交當周所交代的作業)\r\n另外:上課當中非經同意，嚴禁使用手機，只要每一次被發現使用手機，學期總成績即倒扣1分(累扣制)。更重要者，上課未帶規定的教科書者，則視同缺席1小時。\r\n曠課12 小時扣考 (以老師點名記錄為主，就算學校點名系統關閉之後的曠課時數也在計算在內)。", "materials": "1.\tAllison Parrish, Ben Fry, and Casey Reas, Make: Getting Started with Processing.py, MAKER MEDIA, 2016.\r\n2.\tCasey Reas & Ben Fry, Make: Getting Started with Processing, MAKER MEDIA, 2015.\r\n3.\tLauren McCarthy, Casey Reas & Ben Fry, Make: Getting Started with p5.js, MAKER MEDIA, 2016.\r\n4.\tCasey Reas and Ben Fry, Processing: A Programming Handbook for Visual Designers, Second Edition, The MIT Press. December 2014.\r\n5.\tDerek Runberg, The SparkFun Guide to Processing, No Starch Press, 2015.\r\n6.\tDaniel Shiffman, Learning Processing, Second Edition: A Beginner's Guide to Programming Images, Animation, and Interaction, Morgan Kaufmann, August 2015.\r\n7.\tCasey Reas and Ben Fry, Make: Getting Started with Processing, Second Edition, Maker Media, September 2015.\r\n8.\tDaniel Shiffman, The Nature of Code: Simulating Natural Systems with Processing, December 2012.\r\n9.\tHartmut Bohnacker, Benedikt Gross, Julia Laub, and Claudius Lazzeroni,Generative Design: Visualize, Program, and Create with Processing, Princeton Architectural Press, August 2012.\r\n10.\tJeffrey L. Nyhoff, Larry R. Nyhoff, Processing: An Introduction to Programming,  CRC Press, May 2017.\r\n11.\tIra Greenberg, Dianna Xu, Deepak Kumar, Processing: Creative Coding and Generative Art in Processing 2, friends of ED, April 2013.\r\n12.\tAndrew S. Glassner, Processing for Visual Artists: How to Create Expressive Images and Interactive Art, A K Peters, August 2010.\r\n13.\tPenny de Byl, Creating Procedural Artworks with Processing A Holistic Guide, CreateSpace Independent Publishing Platform, May 2017. \r\n14.\tNikolaus Gradwohl, Processing 2: Creative Coding Hotshot, PACKT, May 2013.\r\n15.\tJan Vantomme, Processing 2: Creative Programming Cookbook, PACKT, September 2012.\r\n16.\thttps://processing.org/\r\n17.\thttp://learningprocessing.com/examples/           \r\n18.\thttp://learningprocessing.com/exercises/\r\n19.\thttp://learningprocessing.com/videos/\r\n20.\thttp://learningprocessing.com/resources/\r\n21.\thttps://www.youtube.com/user/shiffman              \r\n22.\thttps://www.youtube.com/user/shiffman/videos  \r\n23.\thttp://happycoding.io/tutorials/processing/          Processing Tutorials\r\n24.\thttp://happycoding.io/tutorials/  \r\n25.\thttps://en.wikipedia.org/wiki/Processing_(programming_language)\r\n26.\thttp://happycoding.io/teaching/", "foreignLanguageTextbooks": true}]