[{"name": "謝承諭", "email": "chesterhugues@gmail.com", "latestUpdate": "2019-03-15 15:15:43", "objective": "本課程主要在培養進階寫作能力，採用功能導向的方式，諸如書函，文章／書本摘要，評論，創作，學術專技報告等專項進行演練。\r\n\r\nThis course aims to provide students with an overview of the basic knowledge and skills essential to academic writing in English. Topics including academic vocabulary, basics of English writing, and principles of composing different parts of a research article will be discussed in class. Students will familiarize themselves with the content and relate it to their own academic experience by reading materials, listening to lectures, watching videos, doing activities, engaging in group work and accomplishing assignments. After this class, students are expected to be able to apply these skills to the writing of their senior project.", "schedule": "Tentative Schedule\r\nW\tDate\tContent\tAssignment due\tRemarks\r\n01\t02/18\tCourse Orientation / Self-introduction / Review \tIn-class writing\t\r\n02\t02/25\tUnit One: An Approach to Academic Writing\r\nOnline Writing Resources\t\t\r\n03\t03/04\tUnit Two: General-Specific and Specific-General Texts\tA writing plan\t\r\n04\t03/11\tUnit Three: Problem, Process, and Solution\t\tGP1\r\n05\t03/18\tUnit Three: Problem, Process, and Solution \tEssay 1 (PS text) (IA)\t\r\n06\t03/25\tIndividual Writing Conference (I)\t\t\r\n07\t04/01\tUnit Four: Data Commentary \tEssay 1 Revision\tGP2\r\n08\t04/08\tUnit Five: Writing Summaries\t\tGP3\r\n09\t04/15\tUnit Five: Writing Summaries\tEssay 2 (summary) (GA)\t\r\n10\t04/22\tGroup Writing Conference\tSelf-evaluation 1\t\r\n11\t04/29\tUnit Seven: Constructing a Research Paper I \tEssay 2 revision\tGP4\r\n12\t05/06\tUnit Seven: Constructing a Research Paper I \t\t\r\n13\t05/13\tUnit Eight: Constructing a Research Paper II\t\tGP 5\r\n14\t05/20\tUnit Eight: Constructing a Research Paper II \t\t\r\n15\t05/27\tWriting an Abstract \t\t\r\n16\t06/03\tWriting an Abstract \tAbstract (IA)\t\r\n17\t06/10\tIndividual Writing Conference (II)\tSelf-evaluation 2\t\r\n18\t06/17\tClass Wrap-up\tAbstract revision", "scorePolicy": "1. Attendance and participation (20%)\r\n2. Essay/abstract drafts and revisions (60%)\r\n3. Group presentation (10%)\r\n4. Self-evaluations (10%)", "materials": "Swales, J. M., & Feak, C. B. (2012). Academic Writing for Graduate Students: Essential Tasks and Skills. Ann Arbor, MI: University of Michigan Press.", "foreignLanguageTextbooks": true}]