[{"name": "楊韻華", "email": "yhyang@ntut.edu.tw", "latestUpdate": "2019-02-19 08:27:39", "objective": "Course Title:\t\tPresentations in English \r\nCredit Hours:\t\t2\r\nInstructor’s Name:\tDr. Yun-Hua Yang\r\nContact E-Mail:\tyhyang@ntut.edu.tw\r\nOffice: \tGeneral Education Building Rm.805 / Extension:3941\r\nTerm Offered:\t\tSpring, 2019\r\nCourse Description: \tThis course aims to enhance English-major students’ communicative competence with special emphasis on business presentations and meetings.  By developing effective skills, strategies and tactful language use, students with high-intermediate proficiency level of English will be able to prepare as well as present verbal reports to achieve career goal. It is also important for students to develop the ability of visual communication. \r\n\r\nCourse Requirements: \tStudents’ responsibilities in this class include:\r\n(1)\tWeekly in-class presentations: Students will be arranged randomly and/or voluntarily to give presentations in class. Absence and failure to present will be penalized. \r\n(2)\tRecorded presentations: Students can also choose to record at most 3 presentations in addition to the required in-class ones. \r\n(3)\tNotes, feedbacks and comments on peer presentations: Students are required to take notes, give feedbacks and comments on presentations. \r\n(4)\tAll presentation materials (PPT and others) need to be uploaded a week prior to in-class session. \r\n\r\n\r\nPresentation Guidelines (also referring to the required texts):\r\n1)\tA packet of materials will be provided. Students, however, are required to do additional research for the presentations. \r\n2)\tThere is no time limit for presentations. However, it is the presenter’s and meeting attendee’s responsibility to consider effectiveness and efficiency, preferably 8-10 minutes. \r\n3)\tFor presentations, follow the topic areas and select your own topic. Materials and documents, on which the presentations are based, MUST be submitted a week prior to the scheduled presentations, and make available to the class online. \r\n4)\tVisual elements are essential components in all presentations. Data visualizations particularly critical. Various charts, graphs, diagrams and exhibits need to be used as visual facilitators. \r\n5)\tNo scripts are allowed. \r\n6)\tAll in-class presentations MUST be recorded as entries for semester portfolio.", "schedule": "Topic Areas: Select from the following topic areas for presentations (both in-class and recorded). Each topic has a maximum number of presentations allowed. \r\nA)\tTHREE Presentations: Women at Work (UN Women, McKinsey, Goldman Sachs, Wharton, etc)\r\nB)\tTHREE Presentations: The World in 2019 (The Economist)\r\nC)\tTWO Presentations: A Fortune 500 Company 2018\r\nD)\tTWO Presentations: The Global Competitiveness Report 2018 / WEF Agenda issues\r\nE)\tTWO Presentations: Attending a top university (degree programs & prospects): what, why and how\r\nF)\tONE Presentation: Any topic of interest", "scorePolicy": "Grading Policy:\t(1) Academic honesty is prioritized in this class. Students should learn that plagiarism will not be tolerated. Students will fail the course without contention once an incident of plagiarism is identified in their submitted writing or presented speech.  \r\n(2) The grading components are as follows:\r\n(i) Attendance: Obligatory (unrewarded) \t\t\r\n(ii) Presentations 80% \r\n(i)\t8 in-class presentations 80%\r\n(Absence and failure to present results in 15% deduction of the semester grades on the 100% scale.)\r\n(ii)\tRecorded presentation 10%\r\n(iii)\tComments & Feedbacks 10%\r\n(iv)\tPortfolio (Failure to submit overrides all points earned in the above categories.)", "materials": "Required Text:  (1) Guide to Persuasive Presentations by Harvard Business Review \r\n              (2) Visualizations That Really Works by Harvard Business Review \r\n(3) The Quick and Dirty on Data Visualization by Harvard Business Review\r\n(4) How to Give a Stellar Presentation by Harvard Business Review", "foreignLanguageTextbooks": true}]