[{"name": "黃榮堂", "email": "jthuang@ntut.edu.tw", "latestUpdate": "2019-02-18 13:22:53", "objective": "製造聯網整合技術配合感測器、控制器、網路系統等，讓人、機器人、原物料、零組件、重要物品或設備，取得人、機、料、法、環的訊息，透過大數據分析與人工智慧，執行各種事前診斷預防、維護、事發處置及事後重建與改善的動作。本課程著重於製造聯網整合技術與實施方法，特別在智能工廠技術包含IoT、感測器設計與選擇、機電整合、數據分析、預防診斷與維修、智慧適應控制等。\r\nThis course provides a practical guide that lets you discover the technologies and the use cases for the industrial IoT. Taking you through the implementation of industrial processes, specialized control devices, and protocols, it covers the process of identification and connection of different industrial data sources gathered from different sensors. You will be able to connect these sensors, such as AWS IoT, Azure IoT, OEM IoT platforms, and Google IoT, to the cloud network, and extract this data from the cloud itself to your devices.\r\nOver time, you will gain the knowledge to obtain the hands-on experience necessary for using open source Node-RED, Kafka, Cassandra, and Python. You will develop streaming and batch-based machine learning algorithms. By the end of this book, you will have mastered the features of Industry 4.0 and will be able to build strong, faster, and more reliable IoT infrastructure within your industry.", "schedule": "Week 1 Introduction to Industrial IoT\r\nWeek 2 Understanding the Industrial Process and Devices\r\nWeek 3 Industrial Data Flow and Devices\r\nWeek 4 Implementing the Industrial IoT Data Flow\r\nWeek 5 Applying Cybersecurity\r\nWeek 6 Performing an Exercise Based on Industrial Protocols and\r\n                  Standards\r\nWeek 7 Developing Industrial IoT and Architecture\r\nWeek 8 Implementing a Custom Industrial IoT Platform\r\nWeek 9 Midterm\r\nWeek 10 Understanding Industrial OEM Platforms\r\nWeek 11 Implementing a Cloud Industrial IoT Solution with AWS\r\nWeek 12 Implementing a Cloud Industrial IoT Solution with Google Cloud\r\nWeek 13 Performing a Practical Industrial IoT Solution with Azure\r\nWeek 14 Understanding Diagnostics, Maintenance, and Predictive\r\n                    Analytics\r\nWeek 15 Implementing a Digital Twin – Advanced Analytics\r\nWeek 16 Deploying Analytics on an IoT Platform\r\nWeek 17 Deploying Analytics on an IoT Platform\r\nWeek 18 Final project (oral report)", "scorePolicy": "Participation 10 %\r\nMidterm Exam  40%\r\nFinal Project 50%", "materials": "Authors: Giacomo Veneri, Antonio Capasso\r\nHands-On Industrial Internet of Things\r\nCopyright c 2018 Packt Publishing\r\n\r\nSome technical papers may be offered for reference", "foreignLanguageTextbooks": true}]