[{"name": "黃少妤", "email": "phsophia@gmail.com", "latestUpdate": "2019-02-18 18:20:39", "objective": "由於九零年代後，城市急速擴張與超越領域性(de-terrorization)的連結等新興狀態萌生，基礎設施(infrastructure)的定義逐漸開始難以精確認定，而身為城市興衰論述的經常主體，基礎設施自身的論述與再定義卻在空間學門中成為那缺落的一塊。\r\n\r\n基於此，本課程期望透過幾項特定學門角度，提供一個對於基礎設施為研究主題的論述框架，進而連結建築學門與相關空間學門間對於當代全球城市論述中之縫隙，能在跨學門田野研究中提出他種可能性(alternatives)。 本課程將以兩種方項進行基礎設施當代性的\"實踐\"; 部分課程內容將邀請德國杜賓根大學台灣研究中心，以空間社會學角度提供授課交流。另一部分將透過雙邊學生，以共同主題進行台北與德國城市的實際田野調查並以比較分析的方式進行合作討論。課程架構則以建築學與空間社會學為主軸剖析，分為五個部分:全球城市與多尺度論述，當代基礎設施與建築/地景對話，社會基礎設施的物質性與再生產，看不見的基礎設施與田野調查為總結。預計學生能透過不同學門角度的切入、於不同文化背景學生間合作討論、多種教學方式的引導，培養基礎辯證思考之能力並進一步對當代都市基礎設施的空間性研究之興趣。\r\n”[T]he distinction between infrastructure and sociality is fluid and pragmatic rather than definitive.” However, “…[infrastructure] is never a story of which infrastructure is itself the subject but a narrative about growth, decay or the end of the city, in which infrastructure happens to play a leading role.” (Graham and McFarlane, 2014, P33-39)\r\nIn the contemporary word, especially in globalized cities, infrastructure is hard to define for many reasons: it is built and endures over long periods of time, often over a range of geographic scales; it has physical, technological, social and economic aspects; it is composed of systems, institutions, individuals, behaviors and culture; it often takes new forms in new settings and situations; and it has many consequences in cities, both intended and not. At some points, infrastructure is also often invisible to its users, since most people have rarely considered, if ever, where their energy, water, food, or materials come from.\r\nThis class will therefore seek to rethink the subject of infrastructure from particular perspectives which frame the structure of this module. To explore the richness and extend the discussion of this subject, we proposed a join-class with Taiwan study centre at University of Tübingen, Germany for more interdisciplinary debates and teaching possibilities as well. There will be two academic discourses-Architecture and sociology involved and formed into five sessions; multiascalar cities, landscape and architecture as infrastructure, social infrastructure in materiality and reproduction, unseen infrastructure and fieldwork in cities. In so doing, it will focus on firstly by reading theory; secondly, by examining specific case studies that illustrates how these theories manifests themselves; and thirdly, by considering how these infrastructures may be changing the understanding of contemporary globalized cities and reproducing urban networks in different fields and countries.", "schedule": "Time Table \r\n1. 02.18-22  Course Introduction  \r\nSession: Urban-spatial Infrastructure  \r\n2. 02.25-03.01  Global Urbanism, Scale, Urban conditions [lecture] \r\n3. 03.04-08  Trans-architecture- dialogue amongst landscape and infrastructure [lecture]\r\n4. 03.11-15  Materiality 01- Brutalism and Socio-technical cities [lecture]\r\n5. 03.18-22  Materiality 02-Mobility, Hpyerlocality, Assemblage [lecture]\r\n\r\nSession: Fieldwork in Cities \r\n6. 03.25-29  05 Essay subject/Fieldwork discussion (Taipei) \r\n7. 04.01-04. Redding week- (Essay draft hand in)\r\n8. 04.09  Methodology in urban-social practice \r\n9. 04.15-19 TP Field work report \r\n\r\nSession: Social Infrastructure \r\n10. 04.22-26 Prof. Tseng lecture (TSC, TU)(Essay submit) \r\n11. 04.29-05.03 Unseen Infrastructure- Everyday life, Morphology, Heterotopia  \r\n12. 05.06.-10 Prof. Tseng lecture (TSC, TU)\r\n13. 05.13-17  Prof. Tseng lecture (TSC, TU) \r\n14. 05.21 Visiting Speaker- Ms.Tsaiher Cheng (Red Light City author)\r\n15. 05.27-31 Informal and network urbanism\r\n\r\nSession: Collaborative work \r\n16.06.03-07  Field work Presentation- German students \r\n17.06.10-14 Fieldwork review and amendment  \r\n18.06.17-21 Field work Presentation- Taiwan students", "scorePolicy": "Essay (Individual work) 30%\r\nFinal Report (group work) 40%\r\nWriting Assignment 10%\r\nAttendance  20%", "materials": "Waldheim, Charles (2006). The landscape urbanism reader. New York: Princeton Architectural Press. \r\nGraham, Stephen (2001). Splintering Urbanism: Networked Infrastructures, Technological Mobilites and the Urban Condition. London; New York: Routledge. \r\nBurdett, Richard and Deyan Sudjic et al. (2010). The endless city, 2nd, London: Phaidon. \r\nGuggenheim, Michael and Ola Soderstrom (eds.) (2010). Re-shaping cities: how global mobility transforms architecture and urban form. London; New York: Routledge. \r\nGomez-Ibanez, J. A. (2006). Regulating Infrastructure: Monopoly, Contracts, and Discretion. Harvard University Press.\r\nMarkard, J. (2011). Transformation of Infrastructures: Sector Characteristics and Implications for Fundamental Change. Journal of Infrastructure Systems.\r\n\r\nBerger, Alan. 2006. Drosscape: Wasting Land in Urban America. New York: Princeton Architectural Press.\r\nEasterling, Keller. 2014. Extrastatecraft: The Power of Infrastructure Space. London; New York: Verso.\r\nKrzysztof Iniewski; Carl McCrosky; Daniel Minoli. 2008. NETWORK INFRASTRUCTURE AND ARCHITECTURE. Hoboken, N.J: Wiley-Interscience.\r\nLarry Ray. 2007. Globalization and Everyday Life. 1st ed. Taylor & Francis.\r\nMarco Graber, Thomas Pulver, ed. 2009. Spatial Sequences and Urban Infrastructure: Graber Pulver at ETH Zurich. Bilingual edition. Scheidegger and Spiess.\r\nMasanori Hamada, ed. 2014. Critical Urban Infrastructure Handbook. CRC Press.\r\nMIT Center for Advanced Urbanism. 2016. Scaling Infrastructure. edited by Sonja Beeck; Meredith Baber. New York : Princeton Architectural Press.\r\nRobertson, Susan. 2007. “Visions of Urban Mobility: The Westway, London, England.” Cultural Geographies 14(47).\r\nScott Lloyd, Katrina Stoll, ed. 2011. Infrastructure as Architecture: Designing Composite Networks. Jovis .\r\nStephen Graham, Colin McFarlane, ed. 2014. Infrastructural Lives: Urban Infrastructure in Context. Abingdon : Routledge.\r\nTimothy Moss; Simon Marvin; Simon Guy, ed. 2016. Urban Infrastructure in Transition: Networks, Buildings and Plans. Routledge.", "foreignLanguageTextbooks": true}]