[{"name": "楊韻華", "email": "yhyang@ntut.edu.tw", "latestUpdate": "2017-02-22 16:08:58", "objective": "本課程以語言教學目標為橫軸，以分析公司會議及簡報的技術層面為縱軸。課程內容包括會議程序及演練，同意、結束會議，反對、請求說明，提出方案等技巧。簡報則著重了解目的，分析聽眾與場合，確定具體目標，調查研究，構思取材，搭配視聽器材以演練方式實施。\r\nCourse Title:\t\tMeetings and Presentations in English \r\nCredit Hours:\t\t2\r\nInstructor’s Name:\tDr. Yun-Hua Yang\r\nContact E-Mail:\tyhyang@ntut.edu.tw\r\nOffice: \tGeneral Education Building Rm.805 / Extension:3941\r\nTerm Offered:\t\tSpring, 2017\r\nRequired Text:  (1) Guide to Persuasive Presentations by Harvard Business Review \r\n(2) Guide to Making Every Meeting Matter by Harvard Business Review \r\n(3) The Quick and Dirty on Data Visualization by Harvard Business Review\r\n(4) How to Give a Stellar Presentation by Harvard Business Review\r\nCourse Description: \tThis course aims to enhance English-major students’ communicative competence with special emphasis on business presentations and meetings.  By developing effective skills, strategies and tactful language use, students with high-intermediate proficiency level of English will be able to prepare as well as present verbal reports to achieve career goal. It is also important for students to develop the ability of visual communication. Students will also be expected to participate in and conduct meetings productively.", "schedule": "Course Requirements: \tStudents’ responsibilities in this class include:\r\n(1)\tIn-class presentations and mock meetings\r\n(2)\tRecorded presentations/meetings open for all students enrolled \r\n(3)\tEvaluating peer presentations and meetings: Students are required to write a short evaluation on at least FIVE presentations and TWO meetings respectively. \r\n(4)\tTwo types of presentations /meetings:\r\n(i)\tIndividual and project-based presentations\r\n(ii)\tSmall team meetings (2-4 participants) and cross-departmental meetings (6-8 participants) \r\n(iii)\tStudents are encouraged to give as many presentations / meetings as possible on a voluntary basis, yielding percentage points. This will in return be rewarded as part of semester grades. It is advised that students should seek to undertake presentation tasks in a professional and conscientious manner.\r\nPresentation / Meeting Guidelines (also referring to the required texts):\r\n1)\tThere is no time limit for presentations and meetings. However it is the presenter’s and meeting attendee’s responsibility to consider effectiveness and efficiency. \r\n2)\tFor presentations, all topics are allowed, preferably in regard to business activities, social and global concerns. Materials and documents, on which the presentations are based, MUST be submitted a week prior to the scheduled presentations, and make available to the class. For meetings, set the agenda (items to be discusses), layout the meeting plan and submit for approval. A complete meeting pack, including the agenda, documents, and a full-script, needs to be submitted a week prior to the scheduled session. \r\n3)\tVisual elements are essential components in all presentations. Data visualizations particularly critical. Various charts, graphs, diagrams and exhibits need to be used as visual facilitators. \r\n4)\tNo scripts are allowed. \r\n5)\tAll in-class presentations / meetings MUST be recorded as entries for semester portfolio.", "scorePolicy": "Grading Policy:\t(1) Academic honesty is prioritized in this class. Students should learn that plagiarism will not be tolerated. Students will fail the course without contention once an incident of plagiarism is identified in their submitted writing or presented speech.  \r\n(2) The grading components are as follows:\r\n(i) Attendance 30%\t\t\r\n(ii) Presentations 40%: 10% x 3 individuals + project-based 10%\r\n(iv)\tMock meetings 30%: 15% x 2 meetings \r\n(v)\tPortfolio + Evaluations (Failure to submit overrides all points earned in the above categories.)", "materials": "Required Text:  (1) Guide to Persuasive Presentations by Harvard Business Review \r\n(2) Guide to Making Every Meeting Matter by Harvard Business Review \r\n(3) The Quick and Dirty on Data Visualization by Harvard Business Review\r\n(4) How to Give a Stellar Presentation by Harvard Business Review", "foreignLanguageTextbooks": true}]