[{"name": "蔡榮發", "email": "jftsai@ntut.edu.tw", "latestUpdate": "2016-12-28 08:39:33", "objective": "本課程之目的在尋求以數量模式求出相關作業問題之最佳解，並探討如何運用科學與系統化的方式解決管理上的問題。整個過程包括：資料蒐集與問題分析、數量模式的建構、問題求解、成本效益分析、系統規劃設計與執行等步驟。課程內容主要以應用案例說明為主，讓同學瞭解理論如何與實際問題結合，也會介紹最佳化計算軟體來求解數學模式並輔助說明所得數據之意涵。\r\nThe purpose of this course is talking about how to utilize scientific and systematical approaches to solve management problems. The solution process includes data collection and problem investigation, model formulation, optimal solution derivation, cost and efficiency analysis, system implementation and execution etc. This course mainly contains various application cases. Accordingly, participants can understand how to apply theoretical methods on solving real problems. Computational software is also utilized to solve the formulated models and analyzed and interpreted the obtained solutions.", "schedule": "Schedule:\r\nW1 Introduction to Management Sciences\r\nW2 Linear programming: application problems\r\nW3 Linear programming: application problems\r\nW4 Linear programming: application problems\r\nW5 Linear programming: application problems solved with Lingo (Homework 1 due)\r\nW6 Simplex method (Quiz 1)\r\nW7 Duality and sensitivity analysis\r\nW8 Duality and sensitivity analysis\r\nW9 Midterm exam\r\nW10 Transportation models\r\nW11 Goal programming\r\nW12 Integer linear programming\r\nW13 Integer linear programming: application problems\r\nW14 Integer linear programming: application problems\r\nW15 Integer linear programming: application problems  (Homework 2 due)\r\nW16 Decision analysis (Quiz 2)\r\nW17 Decision analysis\r\nW18 Final exam", "scorePolicy": "Quizzes and Homework: 30%\r\nMidterm: 30%\r\nFinal: 30%\r\nPresent situation: 10%", "materials": "Textbook:\r\n1. Hamdy A. Taha, Operations Research- an introduction, 2007, Prentice Hall.\r\n2. Selected application problems\r\nReferences:\r\n1. Optimization Modeling with Lingo, 1999, LINDO System INC.\r\n2. Wayne L. Winston, Operations Research- Applications and Algorithms, 2004, Thomson.", "foreignLanguageTextbooks": true}]