[{"name": "勞維俊", "email": "lolouis@graduate.hku.hk", "latestUpdate": "2016-12-27 19:57:52", "objective": "多元英文系列課程以強化英語文實務及溝通能力為目標，提供不同主題內容及學習任務之課程。本系列課程整合語言技巧之訓練、專業內容主題之教授、及功能性之實務英文應用。課程設計主軸包括任務導向教學、主題式教學、及互動式語言訓練並導入多樣性之語言素材。修習課程前應詳細了解個別課程內容並評估個別英語應用之需求。", "schedule": "Course Aims:\r\n\r\nThe course provides students with skill-based instructions in learning how to read literary and cultural texts. Desired learning outcomes include reading skill development, vocabulary building, language analysis, and critical thinking. Reading materials encompass a variety of viewpoints on global topics centered on social issues, the environment, psychology, business, and technology. Extended activities are designed to encourage students to go beyond the assigned materials, and to put what they have acquired from the readings into listening, speaking and writing practices.\r\n\r\nFocus for Spring 2017: Art and Life (Tuesday)\r\n\r\nWeek 1: Introduction: Keats, ‘This Living Hand,’ Borges, ‘Borges and I’\r\nWeek 2: Public holiday (no class)\r\nWeek 3: Rope (dir. Hitchcock)\r\nWeek 4: Rope \r\nWeek 5: Ibsen, The Master Builder \t\t\t\t\r\nWeek 6: Ibsen\t\t\t\t\t\r\nWeek 7: Public holiday (no class) \r\nWeek 8: Nietzsche + Mid-term examination\t\t\t\t\r\nWeek 9: Conference break (no class)\r\nWeek 10: Screening of Terrorizers (dir. Edward Yang)\t\t\t\t\r\nWeek 11: Terrorizers\t\t\r\nWeek 12: Terrorizers\t\r\nWeek 13: The Story of the Stone (Chapter 1) \r\nWeek 14: Conference break (no class)\t\t\t \r\nWeek 15: University holiday (no class)\r\nWeek 16: Freud, ‘Creative Writers and Day-Dreaming’\t\t\t\t \r\nWeek 17: Final examination\t\t\t\t\t\t\r\nWeek 18: Voluntary guided tour: (TBA)", "scorePolicy": "Teaching Approach:\r\n\r\nStudents are required to read all the assigned texts, including literary, filmic and theoretical works. They should attend lectures, participate in discussions in tutorials, take a mid-term examination, give a group presentation, and write an essay. \r\n\r\nAssessment:\r\n\r\nParticipation and Quizzes\t\t\t10%\r\nGroup Presentation\t\t\t\t\t20%\r\nMid-term exam\t\t\t\t\t        30%\r\nFinal exam\t\t\t\t\t\t30%    \r\n\t\t\t\t\t\t\t      100%", "materials": "Bibliography \t\r\n\r\nBorges, Jorge Luis.  ‘Borges and I.’ Labyrinths. Trans. James E. Irby. New Directions Publishing Corp. 1962. \r\nButler, Judith. Precarious Life: The Powers of Mourning and Violence. London and New York: 2004. \r\nCalvino, Italo. ‘Why Read the Classics?’ Trans. Patrick Creagh. The New York Review of Books 33.15 (9 October 1986).\r\nFreud, Sigmund. ‘Creative Writers and Day-Dreaming.’ 20th Century Literary Criticism. Trans. James Strachey et al. Ed. David Lodge. London and New York: Longman, 1972. 36-42.\r\nIbsen, Henrik. ‘The Master Builder.’ The Master Builder and Other Plays. Harmondsworth: Penguin, 1958. 121-212.\r\nKeats, John. ‘This Living Hand, Now Warm and Capable....’ John Keats: The Major Works. Oxford: Oxford University Press, 2008. 331.\r\n---. ‘Why the Novel Matters.’ 20th Century Literary Criticism. Ed. David Lodge. London and New York: Longman, 1972. 131-185.\r\nRope. Dir. Hitchcock. Writ. Hume Cronyn and Patrick Hamilton. Perf. James Stewart, John Dall and Farley Granger. 1948. Warner Bros. Pictures, 2006. DVD. \r\nThe Terrorizers. Dir. Edward Yang. Writ. Edward Yang and Hsiao Yeh. Perf. Cora Miao, Bao-ming Gu, and Wang An. 1986. Central Motion Pictures. DVD.", "foreignLanguageTextbooks": true}]