[{"name": "楊韻華", "email": "yhyang@ntut.edu.tw", "latestUpdate": "2017-02-17 14:36:57", "objective": "本課程旨在透過時事新聞，提高學生之英文閱聽能力。教材將取自新聞報紙（如New York Times與 The Guardian）、雜誌（如Times）與網路新聞（如CNN Student News）等。透過對多元主題之新聞英文的解析，讓學生瞭解單字用法、句形結構、特殊術語、慣用俚語等，以提升其閱讀技巧與能力，同時拓展對世界的認識。另外亦藉由播放實際新聞英語內容，並配合聽力技巧的學習，以達成理解能力的提升。\r\nCourse Description: \tThis course aims to enhance Non-English-major students’ understanding of global issues by reading and listening to news in English produced by mainstream media across the globe. Both international and local news will be included. This course centers its focus on several major news genres/ topics and core vocabulary specific to each respectively.", "schedule": "Course Title:\t\tEnglish News: Reading and Listening  \r\nCredit Hours:\t\t2 /3 \r\nInstructor’s Name:\tDr. Yun-Hua Yang\r\nContact E-Mail:\tyhyang@ntut.edu.tw\r\nOffice: \tGeneral Education Building Rm.805 / Extension:3941\r\nTerm Offered:\t\tSpring, 2017\r\nRequired Text:    N/A; Various English News Sources\r\nCourse Requirements: \tStudents’ primary course responsibilities in this class include:\r\n(1)\tPresenting news updates (pair work) \r\n(2)\tPreparing annotated notes for each selected news article/video clip/ \r\n(3)\tAttend class as scheduled. \r\n(a)\tEach unexcused absence will result in 10% semester grade deduction. \r\n(b)\tAt the sole discretion of the instructor, absence penalty may be waived with valid proof and just cause. Penalty waiver request will only be accepted in two weeks after the date of absence. It is important to know that generally only ONE- time penalty waiver will be considered.  \r\n(c)\tLateness to class: Any arrival to class after the instructor finishes the second-round roll call is considered lateness. Each occasions of lateness will, in effect, incur a penalty of 5% semester grade deduction.", "scorePolicy": "Grading Policy:\r\nFinal grades will be determined by a point system (X out of 100 total points). Students will be evaluated by their presentations, handouts, full-length text translations, in-class exams, and attendance. (Adjustments will be made if necessary.) \r\n(1)\tPPT Presentation /Study Guide (annotated notes) 20%\r\n(2)\tExams (Midterm & Final) 50-60% \r\n(3)\tAttendance 20-30%", "materials": "Compiled Handouts and News Video Clips / Various English News Media", "foreignLanguageTextbooks": false}]