[{"name": "陳文學", "email": "wschen@ntut.edu.tw", "latestUpdate": "2021-02-16 16:36:26", "objective": "This course intends to introduce the mathematical principles and practices that today\\'s engineers need to know. The course contents are: Ordinary Differential Eqs: 1st order, 2nd order and higher order ODEs. Laplace transform, series solution, special function, vector analysis, Fourier analysis and partial differential equations.\r\n本課程將介紹工程上、物理上系統解析的相關數學工具，內容包括：\r\n一 常微分方程式：一階、二階及高階常微分方程，拉譜拉斯轉換，特殊函數\r\n二 級數解\r\n三 向量幾何與分析\r\n四 傅立葉級數\r\n五 偏微分方程式", "schedule": "Week 1 Introduction; Vector Functions of One Variable, Velocity and Curvature\r\n第1週\t課程介紹；單變數之向量函數、速度、曲率\r\nWeek 2 The Gradient Field, Divergence and Curl\r\n第2週\t梯度場、散度及旋度\r\nWeek 3 Line Integrals, Green’s Theorem\r\n第3週\t線積分、格林定理\r\nWeek 4 Independence of Path and Potential Theory\r\n第4週\t與積分路徑無關之線積分及位能定理\r\nWeek 5   Surface Integrals, Applications of Surface Integrals, Gauss’s Divergence Theorem, Stokes’s Theorem\r\n第5週\t面積分、面積分的應用；高斯散度定理、史托克定理\r\nWeek 6  Fourier Series on [–L, L], Fourier Sine and Fourier Cosine Series\r\n第6週\t區間–L～L的傅立葉級數、傅立葉正弦與餘弦級數\r\nWeek 7  Compensatory Holiday for Sports Day (Staffs and Students)\r\n第7週\t運動會補假(教職員工及學生)\r\nWeek 8 Properties of Fourier Coefficients, Phase Angle Form, Complex Fourier Series\r\n第8週\t傅立葉係數、相角型式的傅立葉級數、複數型的傅立葉級數\r\nWeek 9 ※The Fourier Integral, Fourier Cosine and Sine Integrals, ※The Fourier \r\nTransform; Mid-term Exam.\r\n第9週\t傅立葉積分、傅立葉正弦與餘弦積分式、傅立葉轉換；期中考試\r\nWeek 10 Diffusion Problems in a Bounded Medium\r\n第10週\t有界介質的擴散問題\r\nWeek 11 The Heat Equation with a Forcing Term F(x, t) and on the Real Line\r\n第11週\t具有強迫項F(x, t)與實數線上的熱傳方程式\r\nWeek 12 The Two-Dimensional Heat Equation\r\n第12週\t二維度的熱傳方程式\r\nWeek 13 Wave Motion on a Bounded Interval\r\n第13週\t有界區間之波的運動\r\nWeek 14 Wave Motion in an Unbounded Medium\r\n第14週\t無界介質之波的運動\r\nWeek 15 The Wave Equation with a Forcing Term K(x, t)\r\n第15週\t具有強迫項K(x, t)的波動方程式\r\nWeek 16 The Dirichlet Problem for a Rectangle and Disk\r\n第16週\t矩形與圓盤之Dirichlet的問題\r\nWeek 17 The Dirichlet Problem for a Rectangle and Disk\r\n第17週\t矩形與圓盤之Dirichlet的問題\r\nWeek 18 Final Exam.\r\n第18週\t期末考試", "scorePolicy": "1. Homework 作業  20%\r\n2. Attendance 出席  20%\r\n3. Mid-term exam.  期中考試  30%\r\n4. Final exam.  期末考試  30%", "materials": "Textbook: Advanced Engineering Mathematics   8th SI Custom Solutions Edition\r\n           Peter V. O’Neil \r\nReference Book：Differential Equations with Boundary-Value Problems 7th Ed.\r\n               Dennis G. Zill and Michael R. Cullen", "foreignLanguageTextbooks": true}]