[{"name": "吳南葳", "email": "nwwu@mail.ntut.edu.tw", "latestUpdate": "2021-02-25 10:54:02", "objective": "本課程主要在教導學生對西方(歐洲及西亞)認識歷史建築之演進過程與思考涵構，並使學生具備西方文化歷史與思想的相關知識，其主要授課內容如下：1.在範圍上--自古埃及、西亞、而收至古典建築、基督教建築、中世紀的大教堂時代以至文藝復興及17、18世紀的建築歷史。2.在思想上--自希臘的文化與哲學思想談起，以至各時代之政治、宗教與社會文明之演進，瞭解歷史涵構及其對建築的表現。3.在建築上─針對每一時期的建築表現，瞭解其構造方法、材料應用及相關細部特徵。", "schedule": "第一週（2月26日）、課程介紹：歷史的觀念＆史前文明、古埃及建築（金字塔）\r\n第二週（3月5日）、古埃及建築（陵墓與神廟）＆西亞建築\r\n第三週（3月12日）、希臘建築：克里特島與邁錫尼文明\r\n第四週（3月19日）、希臘建築：希臘神廟與古典柱式\r\n第五週（3月26日）、奧林匹亞與特耳菲 [本週登記期中報告題目]\r\n第六週（4月2日）、兒童節補假\r\n第七週（4月9日）、希臘建築：雅典衛城與希臘化時期\r\n第八週（4月16日）、羅馬建築之共和與帝國時期，劇場、圓形競技場及馬車競賽場\r\n第九週（4月23日）、（期中考週照常上課）羅馬建築之哈德連皇帝與萬神殿\r\n第十週（4月30日）、羅馬建築之羅馬浴場與帝國晚期 \r\n第十一週（5月7日）、中世紀之早期基督教、拜占庭、仿羅馬\r\n第十二週（5月14日）、中世紀之哥德\r\n第十三週（5月21日）、文藝復興之布內勒奇、亞伯提與達文西\r\n第十四週（5月28日）、文藝復興之布拉曼德、米開朗基羅與帕拉底歐 [本週繳交期中報告]\r\n第十五週（6月4日）、文藝復興在歐洲其他地方與矯飾主義\r\n第十六週（6月11日）、巴洛克與柏尼尼 [最後繳交課堂筆記日期]\r\n第十七週（6月18日）、巴洛克之布羅米尼＆期末考前複習\r\n第十八週（6月25日）、（期末考週）期末考", "scorePolicy": "出席成績\t\t20%（使用zuvio點名，或隨堂即時問答）\r\n課堂參與\t\t20%（期中考前後（2月26日第1週到4月16日第8週間，4月30日第10週到6月11日第16週間），各擇一次課堂繳交當天在北科i學園plus上傳翻拍筆記。\r\n期中報告\t30%（2~3人一組，3月25日第5週上課前一天跟羅元柏助教 (moonbird3333@gmail.com) 登記報告標的建築，報告標的不可重複，逾期沒有登記者，視同放棄期中報告繳交！5月28日第14週上課前繳交word, page或Indesign排版之紙本報告。）\r\n期末考試\t\t30%（缺席者本項成績以零分計）\r\n\r\n•\t期中報告標的建築列表\r\n蒐集資料並參觀體驗一棟指定列表中之日治時期西洋歷史風情建築。報告內容應包括：1. 該建築本身基本資料（平立面與照片）(30%)；2. 陳述該建築之西洋歷史風情之符碼(30%)；3. 參觀後心得（該建築風格等有何啟發）(20%)；4. 報告同學本人與參觀建築物之合照(10%)；5. 參考文獻(10%)。（圖面數量不限，文字至少1000字）引用圖面、照片，請註明出處；引用專家說法請以引號標註，否則視為抄襲，若發現抄襲網路文章，期中成績以零分計。（抄襲標準：九個字中有七個字重複即視為抄襲）\r\n期中報告可選擇之案例包括：國立臺灣博物館、淡水紅毛城、國立臺灣師範大學禮堂、臺北自來水博物館、淡水基督長老教會、臺北市紅樓劇場、臺北二二八紀念館、台大醫院舊館、國立臺灣大學校史館、國立臺灣博物館土銀展示館、臺北濟南基督長老教會、北投溫泉博物館、國立臺灣大學傅園、新竹火車站、臺北北投基督長老教會、臺灣總督府交通局鐵道部（國立臺灣博物館鐵道部園區）、臺北中山基督長老教會、臺灣銀行總行大廈、台南地方法院、台中火車站、前清淡水關稅務司官邸(小白宮)、臺灣總督府專賣局（含廳舍、臺博南門園區）、高雄玫瑰聖母聖殿主教座堂、國立臺灣文學館", "materials": "傅朝卿，2009，《圖說西洋建築發展史話》\r\n霍普金斯、畢爾德，謝孟蓉譯，2011，《羅馬大競技場的故事》\r\n金恩，吳光亞譯，2002，《圓頂的故事：文藝復興建築史的一頁傳奇》\r\n徐明松，2003，《古典、違逆與嘲諷： 從布魯涅列斯基 到帕拉底歐的文藝復興建築》\r\n米勒，鄭明萱譯，2010，《聖彼得大教堂建築的故事》\r\n傅朝卿，2009，《圖說台灣建築文化資產日治時期篇》\r\n黃士娟，2012，《建築技術官僚與殖民地經營1895-1922》\r\nMusgrove, John (ed.) (1987). Sir Banister Fletcher’s A History of Architecture. London: Butterworths.\r\nPevsner, Nikolaus (1960). An Outline of European Architecture. Baltimore, Mayland: Penguin Books.\r\nWatkin, David (ed.) (1986). A History of Western Architecture. London: Laurence King.Allsopp, Allsopp, Bruce (1970). The Study of Architectural History. London: November Books.", "foreignLanguageTextbooks": true}]