[{"name": "曾俊儒", "email": "ktseng@pddlab.org", "latestUpdate": "2020-12-18 16:29:53", "objective": "設計素描課程目標為教導學生熟悉設計領域中描述性繪圖的基本技能和要素。學生將熟悉目標繪圖過程和媒體的基本詞彙和案例，同時強調增強的感知意識和設計素描技能。\r\nDesign Drawing introduces students to the basic skills and elements of descriptive drawing in design field. Students will become familiar with the basic vocabulary and conventions of objective drawing processes and media while emphasizing an enhanced perceptual awareness and eye/hand motor skills.", "schedule": "To successfully complete this course, students will sufficiently develop and demonstrate their capacities for the following:\r\n\tHaving a broadened awareness of drawings not only as objects, but as the by-products of creative processes. \r\n\tUnderstand the elemental components of composition.\r\n\tBe familiarized with the major subject matter genres that characterize representational (referential) imagery. \r\na.\tIncluded will be still-life. \r\nb.\tIncluded will be sculpture. \r\nc.\tIncluded will be product.", "scorePolicy": "A. FINAL PORTFOLIO/PROJECT GRADES - 60% of semester grade.\r\nEvaluating art work always presents certain subjective difficulties. Seeking attention in class, consultations during office hours and critiques are a student’s opportunities to have an ongoing dialogue regarding the artistic merits of their work. For grading purposes, the final judge of aesthetic value must be the instructor. However, students should never underestimate the influence and value of their own input in this process. Healthy debate, constructive criticism and an ongoing exchange of ideas is not only welcome, but should be expected on the parts of both student and teacher. The following criteria are considered in the grading of all work:\r\n1. Demonstration of a working process utilizing techniques covered in class.\r\n2. Level of involvement in the process.\r\n3. Strength of design (includes presentation/craftsmanship).\r\n4. Response to and use of critical suggestions in an effective manner.\r\n5. Adherence to assigned parameters.\r\n6. Artistic merit.\r\n\r\nNOTE: Grades on all drawings are advisory in nature. Students are given the opportunity to rework any and/or all drawings for resubmission the week prior to the final critique. At this time all resubmitted work will be re-evaluated for a permanent grade. This policy allows students the opportunity to rework previously graded drawings in order to maximize their final grade. Advisory grades on all work not resubmitted the week prior to the final critique will become permanent at that time. This opportunity does not apply to drawings which were not submitted for their original deadline (i.e., a work not submitted on its initial due date will not be accepted anytime thereafter and will receive zero (0) points.).\r\n\r\nB. SKETCHBOOK/JOURNAL - 20% of semester grade.\r\n\r\nC. LEARING ATTITUDE/PARTICIPATION - 20% of semester grade.\r\nTo avoid all bias, class participation is a completely numerical calculation based on indicators of performance appropriate to a pre-professional course of study. The following provides the point value of these indicators:", "materials": "Handout and documentation provided by tutor", "foreignLanguageTextbooks": false}]