[{"name": "李志鴻", "email": "cl4e@ntut.edu.tw", "latestUpdate": "2020-12-30 12:08:34", "objective": "介紹電腦輔助工程和有限元素分析的基本原理。講授分析軟體ANSYS的操作方法和技術。指導學生練習平面應力或傳熱問題的有限元素分析。培養學生進行獨立有限元素分析的能力。培養學生以正確的態度使用有限元素分析。介紹工程分析，有限元素模型構建，高級模塊技術，實體模型構建，一維元素分析，二維元素分析，三維元素分析和高級範例。\r\nIntroduce the basic principles of computer-aided engineering and finite element analysis.\r\nTeaching the operation methods and techniques for the analysis software ANSYS.\r\nGuide students to practice finite element analysis of plane stress or heat transfer problems.\r\nDevelop students with the ability to perform independent finite element analysis.\r\nCultivate students with the correct attitude of using finite element analysis.\r\nIntroduction to engineering analysis, finite element model building, advanced module techniques, solid model building, one-dimensional element analysis, two-dimensional element analysis, three-dimensional element analysis, and advanced examples.", "schedule": "第1週 電腦輔助工程和有限元素方法概論：數值分析，有限差分，牛頓-拉夫森等。\r\n第2週 電腦輔助工程和有限元素方法概論：力學問題的數學建模，能量方法等。\r\n第3週 電腦輔助工程與有限元素方法概論：有限元方法，多部分多項式。\r\n第4週 電腦輔助工程和有限元素方法概論：各種邊界條件，位移和力條件。\r\n第5週 1. ANSYS結構； 2. ANSYS介面； 3.在線幫助系統； 4. ANSYS系統； 5. ANSYS命令語言。\r\n第6週 1.平面應力分析導論； 2.問題分析； 3，元素選擇和屬性；4，實體造型；5，有限元素建模；6.計算機實驗室實踐\r\n第7週 1.分析類型和選項； 2.邊界條件； 3.解決方案； 4.後處理器和結果顯示； 5.結果查詢； 6.結果驗證； 7.計算機實踐；8.作業\r\n第8週 1.座標系； 2.移動和旋轉工作平面； 3.選擇功能； 4.零件和組裝； 5.電腦教室練習\r\n第9週 期中考試\r\n第10週 高級實體建模技術：1自下而上的建模； 2拉伸或延伸線; 3布爾運算; 4複製，移動，修改和鏡像實體模型； 5導入其他CAD文件並縮放實體模型; 6列出實體模型的屬性； 7電腦教室練習\r\n第11週 有限元素建模技術：1多個元素屬性； 2控制元素大小； 3鏡射網格； 4拉伸和掃掠; 5.複製，移動，修改，鏡像，縮放和合併有限元模型； 6.直接創建節點和元素； 7，硬點；8.電腦教室練習\r\n第12週 高級邊界條件和求解器：1.集中力負荷； 2.慣性載荷；3，節點座標系; 4.邊界條件的符號； 5，解決方案；6，多種邊界條件的求解方法；7.ANSYS文件位置； 8.電腦教室練習；9.作業\r\n第13週 後期處理 1.多次加載的結果，2.路徑圖，3.錯誤評估，4.向量圖，5.結果座標系，6.結果監控器，7.電腦教室練習。\r\n第14週 平面應力分析：托架分析示例\r\n第15週 傳熱示例：1.ANSYS傳熱分析； 2.問題分析； 3.啟動ANSYS元素類型定義； 4.模型構建和網格劃分； 5.邊界條件和解決方案； 6.後處理； 7.熱應力； 8。電腦教室練習； 9.作業\r\n第16週 傳熱示例：一維/二維傳熱分析；複合材料的傳熱\r\n第17週 軸對稱問題：\r\n第18週 期末考試\r\nWeek 1 Introduction to the Computer-Aided Engineering and the Finite Element Method: numerical analysis, finite difference, Newton-Raphson, etc.\r\nWeek 2 Introduction to the Computer-Aided Engineering and the Finite Element Method: mathematical modeling of mechanics problems, the energy method, etc.\r\nWeek 3 Introduction to the Computer-Aided Engineering and the Finite Element Method: finite element method, multi-section polynomials.\r\nWeek 4 Introduction to the Computer-Aided Engineering and the Finite Element Method: various boundary conditions, displacement and force conditions.\r\nWeek 5：\r\n1. ANSYS Structure; 2. ANSYS Interface; 3. On-line Help System; 4. The ANSYS System; 5. ANSYS Command Language.\r\nWeek 6:\r\n1. Introduction to the Plane Stress Analysis; 2.Problem analysis; 3.Element Selection & Attributes; 4.Solid Modeling; 5.Finite Element Modeling; 6. Computer Lab Practices\r\nWeek 7:\r\n1. Analysis Type and Options; 2.Boundary Conditions; 3.Solution Options and Solving; 4. Post-Processor & Result Displays; 5. Result Query; 6. Result Verification; 7.Computer Practices 8.Assignment\r\nWeek 8:\r\n1. Coordinate System; 2. Move and Rotate of Working Plane; 3. The Select Function; 4. Component and Assembly; 5. Computer Lab Practices\r\nWeek 9 mid-term examination\r\nWeek 10 Techniques of Advanced Solid Modeling:1.Bottom-Up Modeling; 2.Extrude or Extend a Line; 3.Boolean Operations; 4.Copy, Move, Modify, and Mirror of a Solid Model; 5.Import Other CAD files and zoom of Solid Model; 6.List Properties of Solid Model; 7. Computer Lab Practices\r\nWeek 11 Techniques of Finite Element Modeling:1. Multiple Element Attributes; 2.Control of Element Size; 3. Mapped Mesh; 4.Extrude and Sweep; 5. Copy, Move, Modify, Mirror, Zoom, and Merge of a Finite Element Model; 6. Create Nodes and Elements Directly; 7.Hardpoint; 8. Computer Lab Practices\r\nWeek 12 Advanced Boundary Conditions and Solvers: 1.Concentrated Force Load; 2.Inertia Load; 3.Nodal Coordinate System; 4.Symbols of Boundary Conditions; 5.Solvers; 6.Method for Solving Multiple Boundary Conditions; 7.ANSYS File Locations; 8. Computer Lab Practices, 9.Assignment\r\nWeek 13 Post-processing, 1.Results of multiple loads, 2. path map, 3. error evaluation, 4. vector diagram, 5. result coordinate system, 6. result monitor, 7. practice.\r\nWeek 14 Plane Stress Analysis: An Example of Bracket Analysis\r\nWeek 15 Heat transfer examples: 1.A", "scorePolicy": "/作業或測驗：30％\r\n/期中考試：30％\r\n/期末考試：30％\r\n/出勤率：10％\r\n/homework or quiz: 30%\r\n/mid-term examination:30%\r\n/final examination:30%\r\n/attendance:10%", "materials": "教科書: 教師筆記\r\n參考書目:\r\nMoaveni, Finite Element Analysis, Theory and Application with ANSYS, Prentice Hall, 1999.\r\n康淵、陳信吉，ANSYS入門，全華圖書 2009 ISBN 978-957-21-5845-6\r\nTextbook: Teacher’s notes\r\nReference book:\r\nMoaveni, Finite Element Analysis, Theory and Application with ANSYS, Prentice Hall, 1999.\r\n康淵、陳信吉，ANSYS入門，全華圖書 2009 ISBN 978-957-21-5845-6", "foreignLanguageTextbooks": false}]