[{"name": "陸元平", "email": "yuan@ntut.edu.tw", "latestUpdate": "2020-12-22 14:01:42", "objective": "本課程為本校「智慧鐵道學程」的進階基礎課程。課程開授之目標，是希望藉由先進智慧鐵道系統的介紹，使修課學生能夠清楚瞭解鐵道產業的未來發展方向，並引領學生積極投入各種先進智慧鐵道應用系統之研究。本課程是以同時段合院授課的方式、針對選讀學程之學生、邀請智慧鐵道系統相關、學有專精的技術研發人員、以業師的身份共同參與授課。本課程會要求修課同學於期末報告時進行實作系統的展示，並邀請鐵道產業專家擔任評審。修習本課程前，不同學系之學生須先修習的課程清單另訂定之。\r\nThis course is one of the advanced core courses for the Intelligent Railway Curriculum. The aim of this course is, via the introduction of advanced intelligent rail system, to have the students realize thoroughly the development trend of futuristic rail industry, and subsequently, to encourage the students into the research and development of various application systems for intelligent railway. This course is a joint lecture among departments inside our college with synchronized class hours. The industrial instructors to our participant students include R&D experts from relevant fields in intelligent rail industry. In their term reports, the students will have to demonstrate the prototypes of their projects and to be reviewed by the invited senior professionals from rail industry. The prerequisites for taking this course will be determined based on the background of students with different majors.", "schedule": "課程進度謹供參考：\r\n第一週     課程簡介\r\n第二週     工業4.0九大前瞻技術\r\n第三週     工業物聯網（IIoT）\r\n第四週     軟體定義一切的智慧型大眾運輸系統\r\n第五週     建築資訊模型（BIM）\r\n第六週     產品生命週期管理（PLM）\r\n第七週     擴增實境（AR）輔助系統創新應用\r\n第八週     故障診斷、預測與健康管理（PHM）系統\r\n第九週     先進列車控制系統（ERTMS、CBTC、PTC）\r\n第十週     整合票證與旅客服務資訊系統\r\n第十一週 智慧設計與先進製造技術\r\n第十二週 鐵道智慧巡檢PHM系統實作\r\n第十三週 鐵道號誌系統之演進\r\n第十四週 台鐵號誌系統\r\n第十五週 捷運號誌硬體設備\r\n第十六週 號誌與行車控制系統RAMS實務\r\n第十七週 期末分組報告\r\n第十八週 (期末考週)", "scorePolicy": "■平時成績：40％  ■課堂報告與作業：50％  ■學期考試：10％\r\n\r\n翹課一次扣總成績10分、請假第二次開始扣總成績1分、遲到早退一次扣總成績1分、學期缺課次數過多將增加總扣分數、作弊一律以不及格論", "materials": "1. 自編講義\r\n2. 軌道工程學，作者：黃漢榮，高立出版社，出版日：2016/09/01。\r\n3. 軌道機電系統概論，作者：林仁生，高立出版社，出版日：2003/12/01。", "foreignLanguageTextbooks": false}]