[{"name": "葛瑞斐", "email": "griffith@ntut.edu.tw", "latestUpdate": "2020-12-18 19:11:37", "objective": "通過每週的閱讀和課堂討論，本課程將幫助發展學生的英語會話和閱讀技能。 在練習這些技能的過程中，我們將集中於理解西方語言和文化的中心思想，從而著眼於理解西方文化的人們（他們的價值觀，動機，原則）的中心思想。 [本課程的過去主題包括：Monsters and the Human; Comedy and Humor; The Nature of Good and Evil; The Hero in the West; Baseball and Society; The Idea and the Importance of Beauty; Exploration and Discovery]。 在審查圍繞這一主題的文章和電影時，我們將考慮這個重要的想法對西方社會及其人民的啟示。\r\nThrough weekly readings and class discussion, this course will help develop students’ English conversation and reading skills.  In the course of practicing such skills, we will focus on an idea central to understanding the language and the culture of the West, and thus an idea central to understanding the people (their values, motivations, principles) of Western culture.   [Past topics for this course include: Monsters and the Human; Comedy and Humor; The Nature of Good and Evil; The Hero in the West; Baseball and Society; The Idea and the Importance of Beauty; Exploration and Discovery].   Examining essays and films centered around such a topic, we will consider what the significant idea tells us about Western society and its people.", "schedule": "Week 1                       \t     Introduction\r\nWeek 2-4                          Unit 1\r\nWeek 5-8                           Unit 2\r\nWeek 9\tClass Midterm\r\nWeek 10-13                       Unit 3\r\nWeek 13-17                       Unit 4\r\nWeek 18          Class Final", "scorePolicy": "Grades: \r\n\t \tMidterm  50%\r\n\t\tFinal\t    50%", "materials": "Attendance:   \r\n\ta combination of 3 absences or late days or classwork zeroes =  -10 points from course grade\r\n\ta combination of 4 absences or late days or classwork zeroes =  failing course grade", "foreignLanguageTextbooks": true}]