[{"name": "許益瑞", "email": "ijuihsu@ntut.edu.tw", "latestUpdate": "2020-12-10 18:07:17", "objective": "結晶學已經是成為當今科學研究領域的一門重要知識與技術。至目前為止至少有20位諾貝爾獎得主其貢獻都與結晶學有關。在這課程，我們將闡述結晶學的相關基本知識，例如: 晶格、對稱、原子散射、結構因子及解結構。此外，這門課程也將涵蓋實際操作解結構。所有基礎知識與實作，涵蓋單晶繞射與粉末繞射。也將涵蓋部分蛋白質結晶學的基本知識。\r\nCrystallography has become an important field in scientific knowledge and technique in physics, chemistry, materials, and biology, which has been recognized by more than 20 winners of Nobel prize. In this course, we will illustrate the fundamental knowledge about crystal lattice, symmetry, atomic scattering, structure factor, and structure determination. In addition, the course also includes practices in structure determination by single crystal x-ray diffraction and powder x-ray diffraction. All fundamental knowledge and practices are mainly in small molecular cases, but part of knowledge of protein crystallography will also be included.", "schedule": "1. Introduction to X-ray \r\n2. Diffraction of X-ray\r\n3. Crystals, Symmetry, and Space Groups\r\n4. Intensity Data Collection and Data Reduction\r\n5. Theory of Structure Factors and Fourier Syntheses\r\n6. Phase Problem-Direct Methods, Patterson Methods, and Heavy Atom Methods\r\n7. Refinement and Results\r\n8. Modern ab initio structure determination from powder x-ray diffraction.", "scorePolicy": "Midterm 30% Final 30% Homework 40%", "materials": "1. G. H. Stout and L. H. Jensen, X-ray Structure Determination-A practical guide, 2nd Ed.", "foreignLanguageTextbooks": true}]