[{"name": "林懷恩", "email": "linhe@ntut.edu.tw", "latestUpdate": "2021-02-20 10:49:30", "objective": "本課程主要分為四部分：\r\n第一、\t奈米製造科技介紹(Top-down, bottom-up方法與微影技術)；\r\n第二、\t奈米檢測(電子顯微鏡、光譜分析)\r\n第三、\t奈米材料性質(結構、形貌與機械性質)；\r\n第四、\t奈米材料應用(電磁、光學、能源、環境與生醫產業上的應用)\r\nThe course is divided into four parts:\r\nPart 1: Introduction of nano-manufacturing technology (Top-down, bottom-up approach and lithography)\r\nPart 2: Examination of nanomaterials (Electron microscopy, spectrographic analyses)\r\nPart 3: Nanomaterials properties (Structure, characteristics and mechanical properties)\r\nPart 4: Applications of nanomaterials in electromagnetic, optical, energy, environmental and biomedical industries", "schedule": "第1週\t課程內容簡介 Introduction of the subject\r\n第2週\t奈米科技簡介 Introduction of nanotechnology\r\n第3週\t奈米材料合成方法 General synthetic approaches of nanomaterials: Top-down approach\r\n第4週\t奈米材料合成方法 General synthetic approaches of nanomaterials: Bottom-up approach\r\n第5週\t奈米微影技術 Nanolithography\r\n第6週\t奈米材料檢測 Examination of nanomaterials (SEM, TEM, STM, AFM)\r\n第7週\t奈米材料檢測 Examination of nanomaterials (FTIR, Raman spectroscopy, XPS, SIMS)\r\n第8週\t分組報告 Presentation\r\n第9週\t期中考Middle examination\r\n第10週\t奈米材料之結構與形貌 Microstructure and characteristics of nanomaterials (C60, nanoparticle, quantum dot, quantum well etc)\r\n第11週\t奈米材料之機械性質 Mechanical properties of nanomaterials\r\n第12週\t奈米科技應用：電磁元件 Applications of nanotechnology: Electromagnetic component\r\n第13週\t奈米科技應用：光學元件 Applications of nanotechnology: Optoelectronics\r\n第14週\t奈米科技應用：機械性質 Applications of nanotechnology: Mechanical Properties\r\n第15週\t奈米科技應用：能源與環境 Applications of nanotechnology: Energy and environment\r\n第16週\t奈米科技應用：生醫材料 Applications of nanotechnology: Biomedical materials\r\n第17週\t奈米科技對健康、環境與安全影響 Health, environment and safety issues of nanotechnoloty\r\n第18週\t期末考Final exam", "scorePolicy": "1.\tParticipation 出席成績 (10%)\r\n2.\tPresentation 分組報告 (20%)\r\n3.\tAssignment 作業 (20%), \r\n4.\tMiddle examination期中考 (25%)\r\n5.\tFinal examination 期末考 (25%)", "materials": "1. Nanomaterials, Nanotechnologies and Design - An Introduction for Engineers and Architects, Michael F. Ashby et al., Elsevier 2009.\r\n2. Nanoscience and nanotechnologies opportunities and uncertainties, A. Dowling et al., The Royal Society & The Royal Academy of Engineering 2004.\r\n3. Nanomaterials and Nanochemistry, C. Brechignac et al., Springer 2006.", "foreignLanguageTextbooks": true}]