[{"name": "葛瑞斐", "email": "griffith@ntut.edu.tw", "latestUpdate": "2020-12-18 19:14:03", "objective": "在20世紀末和21世紀初，電影，漫畫書，視頻遊戲等其他形式的藝術在塑造我們的文化和日常生活方面越來越具有影響力。\r\n\r\n通過看電影，電視以及其他形式的流行文化，例如流行音樂和漫畫，我們將考慮西方和東方流行文化的性質和重要性。 在我們將要問的問題中：流行文化與學校通常學習的傳統或“高級”文化有何不同？ 評價這些作品的標準是什麼？ 我們是否應該以與經典作品相同的方式來評價流行文化作品？ 流行文化的好壞之間是有區別的：流行可以好嗎？ 流行的東西一定好嗎？\r\n\r\nIn the late 20th and early 21st centuries, alternative forms of art – movies, comic books, video games – became increasingly influential in shaping our culture and our daily lives.\r\n\r\nLooking at films, television, and other forms of pop culture like pop music and comic books, we will consider the nature and significance of pop culture in the West and in the East.  Among the questions we will ask:  How does pop culture differ from traditional or “high” culture normally studied in schools?  What are the standards for evaluating such works?  Should we value pop culture works in the same way as classic works?  Is there a difference between good and bad pop culture:   Can what is popular be good? Must what is popular be good?", "schedule": "Week 1: \tIntroduction\t\r\n      2-5:\tUnit 1\r\n      6-8:\tUnit 2\r\n         9:\tMidterm week\r\n  10-13:   Unit 3\r\n  14-17:   Unit 4\r\n\t18:\tFinals week", "scorePolicy": "Grades: \r\n\t \tMidterm  50%\r\n\t\tFinal\t50%", "materials": "Attendance:   \r\n\ta combination of 3 absences or late days or classwork zeroes =  -10 points from course grade\r\n\ta combination of 4 absences or late days or classwork zeroes =  failing course grade\r\n\r\nWeekly response pages:  each missing/late paper  =  -10 points from course grade", "foreignLanguageTextbooks": true}]