[{"name": "林威玲", "email": "rita33@ntut.edu.tw", "latestUpdate": "2020-12-23 14:28:26", "objective": "本校體育課程目標為鍛鍊健全身心、促進身心健全發展、培養運動道德、發揚團隊精神及養成終身運動習慣。四技一年級實施普通班體育正課教學。四技二、三年級實施專項分組教學，由具有專長之教師授課。開課項目：籃球、排球、桌球、羽球、保齡球、射箭、高爾夫球、網球、體操遊戲、慢速壘球、太極拳、國際標準舞、體適能、國術。學生得按自己興趣選擇修習。本校體育課程目標為鍛鍊健全身心、促進身心健全發展、培養運動道德、發揚團隊精神及養成終身運動習慣。四技一年級實施普通班體育正課教學。四技二、三年級實施專項分組教學，由具有專長之教師授課。開課項目：籃球、排球、桌球、羽球、保齡球、射箭、高爾夫球、網球、體操遊戲、慢速壘球、太極拳、國際標準舞、體適能、國術。學生得按自己興趣選擇修習。\r\nAll students are required to attend two hours per week of Physical Education class. This requirement applies to Freshman Sophomore and Junior students while it is an elective for senior students.  For Freshman level, Classes focus on basic physical strength training.  For Sophomore and Junior students, classes are interest-oriented, thus giving students the opportunity to select specific activities they are interested in.  Choices include Basketball, Volleyball, Table Tennis, Badminton, Bowling, Archery, Golf, Tennis, Gymnastics, Slow pitch, Tai Chi Chuan, Ballroom Dancing, Physical Fitness and martial arts, to mention a few.", "schedule": "壹、教學目標與內容\r\n一、瞭解自我體能狀況及限制。\r\n二、了解與規劃適合自我特殊需求時的運動方法。\r\n三、養成自我鍛鍊與規律運動的習慣，幫助在身心特殊需求下，維持健康適能，亦提升為運動適能。\r\n四、了解基礎食品營養與保健常識，幫助獲得熱能和營養素，以修護身體。\r\n\r\n貳、教學進度\r\n第一週、身體評估(加退選週)\r\n第二週、身體評估(加退選週)\r\n第三週\r\n1.認識健康與運動適能\r\n2.教學規劃說明，含目標、內容、進度、應備知識基礎、評量方式。\r\n第四週\r\n1.說明運動計畫DIY\r\n2.INBODY前測與說明\r\n3.了解適合個人的運動項目及器材\r\n第五週、[食品營養與保健1]\r\n第六週\r\n1.了解與使用體適能中心器材\r\n2.執行個人運動計畫\r\n第七週、執行與修正個人運動計畫\r\n第八週、執行個人運動計畫\r\n第九週\r\n1.皮拉提斯地板運動Pilates mat work\r\n2.滾筒與伸展運動\r\n第十週、執行與檢討、修改個人運動計畫\r\n第十一週、執行個人運動計畫\r\n第十二週、[食品營養與保健2]\r\n第十三週、執行個人運動計畫\r\n第十四週、執行個人運動計畫\r\n第十五週、執行個人運動計畫\r\n第十六週、[食品營養與保健3]\r\n第十七週\r\n1.滾筒與伸展運動\r\n2.瑜伽靜心\r\n3.INBODY結果說明\r\n第十八週、補考周", "scorePolicy": "評量方式\r\n一、出勤考核50%\r\n(一)學習態度20%\r\n   1.服裝儀容，著適宜之運動服裝。\r\n   2.安全考量，長髮者勿披頭散髮及不要穿戴飾品，亦影響自己與他人活動。\r\n   3.未經老師許可切勿使用手機，並關靜音。\r\n(二)出缺席狀況30%\r\n   1.一次曠課扣總成績5分。\r\n   2.遲到30分以上，無特殊原因者曠課論。\r\n   3.事病假以學校正式請假為主，超過三次以上依情況扣總成績1-5分。\r\n二、運動計畫報告10%\r\n三、食品營養與保健計劃及實施結果心得報告10%\r\n四、運動計畫實施成效報告與檢討心得30% \r\n *報告一律上傳至【北科i學園】數位教學平台", "materials": "1.自編\r\n2.Pilates Anatomy 彼拉提斯/解剖書。Dr Abby Ellsworth  艾比.埃爾斯沃斯 博士著。\r\n3.適應體育。編著:Joseph P. Winnick。總校閱:林曼蕙。譯者:周俊良、陳張榮、高桂足、朱彥穎、潘倩玉、徐錦興、蔡佳良。", "foreignLanguageTextbooks": false}]