[{"name": "黃晟豪", "email": "chhuang@stust.edu.tw", "latestUpdate": "2020-12-21 17:58:01", "objective": "「鐵道車輛系統與維修基地」課程，乃為培養具有鐵路車輛分析設計及檢修技術操作能力之人員，掌握鐵道裝備設計製造、檢修的基礎知識與應用能力，具有鐵道車輛製造、檢修、運用、管理等綜合職業能力和創新精神的高素質技能型專門人才。本課程將從鐵道車輛基本結構開始介紹，並探討鐵道車輛與鐵道基礎之互制關係。而後導入各式特殊鐵道車輛設計之原理與用途，如：高速客車、傾斜式列車、自導向系統….等，並研討各種車型之行駛穩定性與脫軌風險計算方式。最後介紹鐵道車輛維修之概念與實務，並介紹維修基地之設計與配置，再導入先進預兆健康預防檢修法與AR技術於檢修之應用與發展。\r\nThis course of \"Railway Vehicle System and Maintenance Depot\" will cover the basic design criteria of the railway vehicle, its sub-systems and integration. We will discuss factors that affect the design, sizing, manufacturing and maintenance of the sub-systems of the railway vehicle, including their integration with other sub-systems to work as one complete train. Various factors affecting reliability, accessibility and maintainability will be addressed. Then several types of vehicle (high-speed-vehicle, tilting train, self-guide bogie will be introduced to determine the dynamic stability and derailment risk. Finally, the design of maintenance depot will be studied and the latest technologies (PHM, AR) on railway vehicle maintenance will be introduced.", "schedule": "Week_01_軌道系統簡介\r\nWeek_02_軌道系統簡介\r\nWeek_03_軌道車輛基礎構造\r\nWeek_04_軌道車輛基礎構造\r\nWeek_05_輪軌互制與行車安全性\r\nWeek_06_期中考\r\nWeek_07_車體、聯結器及轉向架\r\nWeek_08_懸吊系統\r\nWeek_09_懸吊系統\r\nWeek_10_傾斜式列車\r\nWeek_11_傾斜式列車\r\nWeek_12_捷運列車\r\nWeek_13_輕軌列車\r\nWeek_14_剎車系統與動力系統\r\nWeek_15_車輛號誌與控制, 機電系統\r\nWeek_16_車輛維修\r\nWeek_17_維修基地規劃\r\nWeek_18_期末考", "scorePolicy": "期中考          20%\r\n期末考          20%\r\n報告      20%\r\n課程參與與作業 20%\r\n出席              20%", "materials": "軌道車輛工程概論, 宋鴻康, 全華圖書, ISBN:9789865035150, 2020/12初版", "foreignLanguageTextbooks": false}]