[{"name": "陳建文", "email": "a868@ntut.edu.tw", "latestUpdate": "2020-12-22 21:21:48", "objective": "*本課程為與霹靂布袋戲公司合作之布袋戲手作創新思考學習課程,須全程學習戲偶製作以及操演技巧.採3人1組進行小組創作學習.要求全程用心學習製作戲偶.不喜歡手作與無法每週穩定到課之同學請勿選修.\r\n\r\n課程目標與內容概述： \r\n創新思考能力的培養不僅需要觀念面的充實，也需要實作面的嘗試與刺激\r\n本課程與霹靂多媒體合作，藉由技術觀念解說以及實作體驗培訓活動，來讓同學瞭解台灣布袋戲產業的創新思考，並透過霹靂布袋戲偶創作活動來學習如何創新思考\r\n霹靂擁以布袋戲原創劇本為核心所發展出全方位娛樂事業版圖的豐厚實力，霹靂從不設限任何將布袋戲藝術推廣給更多人的機會、想法與可能，希望帶給所有學生新的文化體驗、成長學習。\r\n此課程除學習整個偶文化、製作流程外，另會加入操偶教學讓同學們在期末時可針對完成的角色進行一段屬 於同學們發揮創意、想像力的操偶演出。\r\n\r\nThis course is a creative thinking learning course for puppetry craftsmanship in cooperation with Pili Puppetry Company. You must learn puppet production and performance skills throughout the process. 3 people and 1 group are used for group creation learning. It requires the whole process to learn to make puppets. Students who are working and unable to arrive in class every week are not eligible for elective courses.\r\n\r\nThe cultivation of innovative thinking ability requires not only the enrichment of concepts, but also the attempts and stimulation of practical aspects.\r\nThis course cooperates with Pili Multimedia, through technical concept explanation and practical experience training activities, to let students understand the innovative thinking of Taiwan's puppet show industry, and learn how to think innovatively through Pili puppet creation activities\r\nPili has the abundant strength to develop a full range of entertainment business with the original script of puppet show as the core. Pili has never set any opportunities, ideas and possibilities to promote puppet show to more people, hoping to bring new ideas to all students Cultural experience, growth and learning.\r\nIn addition to learning the entire puppet culture and production process, this course will also add puppetry teaching so that students can perform a puppetry performance based on their creativity and imagination at the end of the semester.", "schedule": "週次  上課主題\r\n          課程內容\t        授課老師\r\n1週\t  課程說明.編組\t陳建文\r\n\t  歷史概論\t        陳建文/黃亮勛\r\n2週    品牌行銷\t        陳建文/黃政嘉\r\n3週\t  人物發想與設計\t陳建文/朱汧穎\r\n4週\t  偶頭設計\t        陳建文/陳素\r\n5週\t  偶頭設計\t        陳建文/陳素\r\n6週    偶頭設計\t        陳建文/陳素\r\n7週\t  造型設計\t        陳建文/樊仕清\r\n8週\t  造型設計\t        陳建文/樊仕清\r\n9週\t  期中成果發表與講評  (戲偶完成)\t陳建文/黃亮勛\r\n10週  道具設計\t        陳建文/石信一\r\n11週  道具設計\t        陳建文/石信一\r\n12週  道具設計         \t陳建文/石信一\r\n13週  道具設計\t        陳建文/石信一\r\n14週  操偶教學\t        陳建文/林奎協\r\n15週  操偶教學\t        陳建文/林奎協\r\n16週  操偶教學\t        陳建文/林奎協\r\n17週  發表會前檢討排演  陳建文\r\n18週  期末成果發表會    (角色成品 + 操偶演藝)\t陳建文/黃亮勛\r\n備註：期末成果發表，要介紹自己所創作的角色，另加入1分鐘以上的現場操偶表演，發揮自由創意。", "scorePolicy": "評量依據:\r\n\r\n1.每周上課心得紀錄30%  \r\n每週課後繳交(WORD檔格式.文字.照片.圖表)﹔下一周星期一前上傳臉書繳交完畢 ﹔遲缺交者扣分\r\n每周上課心得紀錄之寫作重點(參考範例見後):\r\n業師授課內容重點+個人的思考啟發以及延伸學習成果+課程互動過程花絮照片\r\n期中與期末  彙整各週學習心得記錄作個人化學習成果呈現\r\n\r\n2.布偶手作創作成果  20%\r\n 由各組配合課堂講授合作完成戲偶作品\r\n\r\n3.到課點名出席情形  10%\r\n\r\n4.課堂互動狀況(積極度)  20%\r\n\r\n5.期末成果準備及發表時之表現  20%\r\n 期中考進行期末發表輔導檢視+期末發表準備情形\r\n\r\n6.成果發表的準備與要求\r\n請各組持續準備學習成果資料，將於期中考週(第9週11/11) 檢視戲偶及學習成果資料準備情形。於期末考週進行成果發表時，需製作A1尺寸海報，完整呈現學習成果並上台分享。\r\n\r\n   期末考週成果發表會所要求之各種資料項目，其要求與完成期限如下表:  \r\n一、聊聊布袋戲的過去、現在與未來\r\n(「歷史概論」授課成果的評量)\r\n\r\n1.小組選讀一本布袋戲研究論文(論文全文PDF檔公布於本課程臉書社團)，提出簡要口頭報告(內容包括:選讀哪一本，為甚麼選讀﹔論文的內容重點；選讀後心得收穫；有無進一步自主延伸閱讀而有其他發現)\r\n\r\n2.每位同學至「霹靂布袋戲經典語錄」臉書社群 (https://www.facebook.com/pages/category/Community/%E9%9C%B9%E9%9D%82%E5%B8%83%E8%A2%8B%E6%88%B2%E7%B6%93%E5%85%B8%E8%AA%9E%E9%8C%84-250437181692640/)挑選一句自己想歡的特別金句來作介紹分享。\r\n3.每位同學以霹靂布袋戲….像極了愛情的公式來自創一句金句。\t 像極了愛情的金句創作遊戲\r\n \r\n二、說說戲偶的角色設定\r\n (「人物發想與設計」授課成果的評量)\r\n介紹小組所製作的戲偶+吟唸出場詩(或編RAP)。\r\n1.口語解說戲偶姓名﹑性情、武功﹑愛恨情仇﹑特殊事蹟。\r\n2.出場詩(也可以編RAP)創作與吟唸。\r\n3.設想、安排其他能讓戲偶一出場就令人印象深刻的創意作法。\t\r\n\r\n三、作作小組與戲偶的品牌行銷\r\n(「品牌行銷」授課成果的評鑑)\r\n1.設計小組形象logo  \r\n2.拍攝戲偶人物沙龍照 (期中考後進行)\r\n3.剪輯小組上課過程幕後花絮照片  \r\n4.編輯每位組員學習心得精華摘要\t本欄所列學習成果項目，於期中考檢視時，除1.設計小組形象logo部分需要全部完成之外，其他項目於期中考時可僅完成部分。\r\n四、寫寫創作人物主題歌\r\n 為自己創作的戲偶人物尋找代表歌曲 \r\n可以套裝既有歌曲，也可以自創人物歌曲\t\r\n\r\n7.期中/期末 各小組成員互評  提供互評資料供教師參考", "materials": "本課程檢索全國博碩士論文網站所有公開之布袋戲論文檔案於課程教學過程中供參考同學參考", "foreignLanguageTextbooks": false}]