[{"name": "周素鳳", "email": "sfchou@ntut.edu.tw", "latestUpdate": "2010-08-31 10:50:09", "objective": "This is an integrated course specifically designed to advance students’ proficiency in English.  Students are trained not only to improve their reading and listening ability but also to develop their written and oral communicative skills through a topic-based approach.  Each reading unit is supplemented with activities and practices which aim to reinforce students’ competence in listening, speaking and writing skills within the context of the same topic.\r\n", "schedule": "1  Orientation\r\n2  Unit 1: Big Changes\r\n3  Unit 1: Big Changes\r\n4  Unit 2: Careers\r\n5  Unit 2: Careers\r\n6  Unit 3: What Will Be Will Be\r\n7  Unit 3: What Will Be Will Be\r\n8  Midterm Exam\r\n9  Proficiency Test\r\n10 Unit 4: Advertising\r\n11 Unit 4: Advertising     “\r\n12 Unit 5: Did You Hurt Yourself\r\n13 Unit 5: Did You Hurt Yourself\r\n14 Unit 6: Take My Advice\r\n15 Unit 6: Take My Advice\r\n16 Review\r\n17 Final Exam\r\n18 Proficiency Test\r\n", "scorePolicy": "Grading Scale:\r\n1. Weekly quizzes and practices: 40%\r\n2. Midterm Exam & Final Exam: 50%\r\n3. Oral Tests: 10%\r\n", "materials": "Texts:\r\nMegaGaol (4).   Manuel Dos Santos.  McGraw-Hill, 2010.\r\nNews clippings from NPR & CNN\r\nEpisodes from movies\r\nRequirement:\r\n1. Your regular attendance is required to pass this course.  3 unexcused absences from class will result in failing this course.  Excused absences require that I be notified on or before class date, or with official documentation shortly after the absence.  One unexcused absence will result in an automatic final score reduction of 2 points.  If you are more than 15 minutes late to the class, it will be counted as an absence.  One late attendance means a 1 point reduction from your final score.\r\n2. Every student will be arranged to take 1-2 individual oral tests in this semester. You will be asked to summarize the texts we have covered in class.  Every week, 4-5 students will be assigned to take the oral test, while all the other students will be given group activities, in-class practices in writing or translation work.\r\n3. Throughout the semester, there will be numerous, announced or unannounced, quizzes, in-class activities, in-class writings, take-home exercises.  If you miss any of the tests or fail to submit the exercise by the deadline, there is no way to make it up (no exceptions).  However, your two lowest scores will be dropped—so, save these for those unexpected occasions when you might be sick or miss class for other reason.\r\n", "foreignLanguageTextbooks": false}]