[{"name": "喻沐英", "email": "naiadyu@yahoo.com.tw", "latestUpdate": "2010-09-10 12:57:00", "objective": "教導學生閱讀囊括全球議題的文章，並藉由文章的內容作技巧的訓練，字彙的建構，語言的解析，及思維的啟發。課中延展活動將閱讀內容與聽力、會話、寫作做進一步的連結，並引導學生將所學做有效的應用。", "schedule": "First Semester: Fall 2010\r\nWeek\r\n1. Introduction\r\n2. Unit 1. A. The World of Advertising: Reading One, “Advertising All over the World”; B. Advertising on the Air: Listening One.\r\n3. Unit 1. A. The World of Advertising: Reading Two, “Changing World Markets”; B. Advertising on the Air: Listening Two.\r\n4. Review 1.\r\n5. Unit 2. A. Fraud: Reading One, “Catch Me if You Can”; B. Identity Theft: Listening One.\r\n6. Unit 2. A. Fraud: Reading Two, “The Michelle Brown Story”; B. Identity Theft: Listening Two.\r\n7. Review 2.\r\n8. Class midterm exam\r\n9. Proficiency Test\r\n10. Unit 3. A. Going to Extremes: Sports and Obsession: Reading One, “An Interview with Tony Hawk; B. Endurance Test: Listening One.\r\n11. Unit 3. A. Going to Extremes: Sports and Obsession: Reading Two, “High School Star Hospitalized for Eating Disorder; B. Endurance Test: Listening Two.\r\n12. Review 3.\r\n13. Unit 4. A. Speaking of Gender: Reading One, “Different Ways of Talking”; B. Separated by the Same Language: Listening One.\r\n14. Unit 4. A. Speaking of Gender: Reading Two, “Speaking of Gender: An Interview with a Professor of Communication”; B. Separated by the Same Language: Listening Two.\r\n15. Review 4.\r\n16. Unit 5. A. Ecotourism: Reading One, “Tourists in a Fragile Land”; B. Culture and Commerce: Listening One.\r\n17. Class Final Exam\r\n18. Proficiency Test\r\n", "scorePolicy": "Assessment for the course will comprise up to three demonstrations, as well as assignment and tests, which will be given at the instructor’s discretion. The grade will be a cumulative average of all demonstrations, in class assignments, homework, tests, and attendance.", "materials": "A. Barton, Laurie and Carolyn Dupaquier Sardinas. North Star 3 :Reading and Writing. 3rd ed. White Plains: Pearson, 2009.\r\nB. Solorzano, Helen S. and Jennifer P. L. Schmidt. North Star 3: Listening and Speaking. 3rd ed. White Plains: Pearson, 2009.\r\n", "foreignLanguageTextbooks": false}]