[{"name": "楊韻華", "email": "yhyang@ntut.edu.tw", "latestUpdate": "2010-09-10 13:50:14", "objective": "Course Description: The course is designed for English-major students who wish to increase their knowledge in business-related issues and expertise in future business practice.  All students enrolled in this course are expected to be equipped with an advanced level of English proficiency as well as basic knowledge of effective business communication as it continues where Business English Writing left off. This course covers fundamental business concepts, important current business events, essential business terms, and comprehensive language used in business practice. Business content vocabulary incorporating several main business categories / disciplines will be introduced. Also, students are required to read the current issues of several prestigious business publications, including but not limited to, Fortune, The Economist, BusinessWeek, Wall Street Journal and the New York Times.", "schedule": "Weekly Syllabus\r\nWeek / Date \tContent Reading\tBusiness Vocab.\r\nWk 1 \tOrientation / The Joy of Economics \t\r\nWk 2\tEconomics: The Case for Globalization \tThe Changing World \r\nWk 3\tEconomics: The Case for Globalization \tThe Changing World\r\nWk 4\tBrands and Branding: What is a brand? \tBusiness and Businesses\r\nWk 5\tBrands and Branding: The financial value of brands / The social value of brands \tBusiness and Businesses\r\nGlobal Trading\r\nWK 6\tBrands and Branding: What makes brands great? \tGlobal Trading\r\nSustainable Development \r\nWK 7\tEconomics: The lopsided world economy\r\n--The phony recovery \tProduction \r\nWK 8\tEconomics: The lopsided world economy\r\n--The phony recovery\tSales \r\nWK 9\tEconomics: The lopsided world economy\r\n--China’s rise \tBusiness Performance \r\nWK 10\tEconomics: The lopsided world economy\r\n--China’s rise\tFinance\r\nWK 11\tBrands and Branding: Best practice in Branding---Brand positioning and brand creation \tMarketing \r\nWK 12\tBrands and Branding: Best practice in Branding---Brand positioning and brand creation\tIncreasing Sales\r\nWK 13\tBrands and Branding: Best practice in Branding---Brand experience \tCustomer Services \r\nWK 14\tBrands and Branding: Best practice in Branding---Visual and verbal identities\tServices\r\nWK 15\tBrands and Branding: Best practice in Branding---Visual and verbal identities\tManagers\r\nWK 16\tBrands and Branding: Best practice in Branding---Brand communications\tEmployees\r\nWK 17\tReview \tReview \r\nWK 18\tFinal Exam \t\r\n", "scorePolicy": "Course Objectives:  This course centers its focus on understanding business context in English, and it aims to help the students:\r\n(1)\tlearn about business through the medium of English \r\n(2)\tpromote high level of awareness of the business climate \r\n(3)\timprove reading comprehension of articles relating to business\r\n(4)\tdevelop functional business language in English \t\r\nCourse requirements:\r\nEach student must complete the following requirements:  \r\n1)\tattendance* noted for grading details\r\n2)\treading all materials assigned \r\n3)\ttaking lecture notes \r\n4)\tin-class oral quizzes (Q&A) based on the reading materials \r\nGrading Policy:\t1) Final Exams 30%\r\n\t\t\t\t2) In-class oral quizzes 20%\r\n\t\t\t\t3) Lecture notes  20%\r\n\t\t\t\t4) Attendance  30%\t\r\nLeaves and Absences: \t1) Any AWOL will result in the penalty of 10% semester grade deduction.\r\n\t\t\t\t  \t2) Penalty-waiver can be granted for any absence w/ official document at the \r\n\t\t\t\t\t   \t instructor’s discretion. It is only limited for one time in the entire semester. \r\nShould there be any major incidents and issues, special considerations will be given after thorough discussion with the student(s) and the class advisor(s). \r\n3) Each lateness, after the instructor finishes the second-round roll call, will result in the penalty of 5% semester grade deduction. \r\n\r\nOral Quizzes Guideline(s): 1) Each class session will begin with a few oral quiz questions. Students will be selected randomly by the course instructor to provide brief answers to the questions. Each question asked and answer will be rewarded 2 percent of semester grade (2 points on the percentage scoring scale). Failure will result in proportionate deduction.  \r\n2) Students will be divided into 10 to 15 groups, responsible for preparing questions based on the previous and current materials read and discussed. Students are also required to provide possible answers or interpretations to all questions asked, distributed by paper or electronic means.\r\nLecture Notes Guideline(s): 1) All students are required to take notes on the lectures. All notes taken need \r\n\t\t\t\t\t\t  to be compiled for submission a week before the midterm and final exam.\r\n\t\t\t\t\t\t  2) Supplementary content by student’s research will be considered for extra \r\n                         credit points. \r\n", "materials": "(1) Collins CoBuild Business Vocabulary in Practice  \r\n                (2) The Economist Series: Economics, edited by Simon Cox \r\n(3) The Economist Series: Brands and Branding, edited by Clifton, Simmons, et al.\r\n", "foreignLanguageTextbooks": false}]