[{"name": "霍弘毅", "email": "twall@ntut.edu.tw", "latestUpdate": "2010-08-24 08:17:09", "objective": "This course is designed to introduce students to various cultures other than American-British-European.  This semester we will look at the literatures and cultures of 20th century South America through literature, music, film, dance, and historical research.  We will read two Nobel Prize winning authors: Jorge Luis Borges (Argentina) and Gabriel Garcia Marquez (Columbia); along with two other prominent writers: Christina Peri Rossi (Uruguay), and Clarice Lispector (Brazil), and also with the writings on cinema and a film by Raul Ruiz (Chile).  We will also watch two or three additional films (Evita, Hour of the Star, and Tango) whose images and stories capture life in Brazil and Argentina.  We shall listen to the music of the world renowned Astor Piazzolla.  In addition, I will try to arrange for an instructor to teach the class basic tango since that dance is one of Argentina’s highest art forms and is one of its gifts to the world.  Some research into the history, politics, and sociology of the region will be required.", "schedule": "Pt I Magic Realism, Parables, Fables, Fictions: \r\nLuis Borges (Argentina): Fictions and Interviews\r\nGarcia Marquez (Columbia): “A Very Old Man with Enormous Wings” \r\nPeri Rossi (Uruguay): from The Museum of Useless Efforts\r\nRaul Ruiz (Argentina): from Poetics of Cinema; Film: Three Crowns of the Sailor\r\n\r\nPt II Politics:\r\n\tFilm: Evita\r\n\tChe: Film: The True Story of Che Guevara [History Channel Film]\r\n\tResearch: Dictatorship, Marxism, Democracy\r\n\r\nPt. III Brazil: \r\n\tC. Lispector: “The Crime of the Mathematics Professor”\r\n\tFilm: Hour of the Star\r\n\tRio, Carnival! Samba, the Amazon\r\n\r\nPt. IV Argentina:\r\n\tResearch into History and Culture\r\n\tAstor Piazzolla and Tango Lessons", "scorePolicy": "Magic Realism-Parable-Fiction Writing (3-4 pgs.): 30%\r\nResearch into Politics and 20th century History (4-5 pgs.): 30%\r\nResearch into either Brazil or Argentina (4-5 pgs): 30 %\r\nClass participation: 10%\r\n", "materials": "Course Reader", "foreignLanguageTextbooks": false}]