[{"name": "柯萊恩", "email": "kcline@ntut.edu.tw", "latestUpdate": "2010-08-30 15:15:24", "objective": "We will begin our study with a study of Bertolt Brecht’s theory of epic theatre, a theatrical enterprise which seeks to alienate alienation itself by preventing audience members from identifying with the characters.  We will then turn our attention to the basic repertoire of the actor, the combinations of voice, movement, characterization and emotional shading which enact the playwright’s vision.  As an adjunct to this, we will look at the basics of theatre: blocking, costuming, set design and tips on memorization and the efficient use of rehearsal time.  Our major undertaking will be the play The Threepenny Opera  by Bertolt Brecht, a musical comedy of tragic proportions.  We will study the fundamental characteristics of dramatic form including plot, character, action, and setting, as well as the conventions of dramatic genres, specifically tragedy, comedy, and tragicomedy.  Our approach will be informed by the examination of drama as a specifically literary genre, studying the texts of the play for its themes, historical contexts and uses of language. Central to this will be a close, experiential study of Kurt Weill’s score as students’ prepare to render Weill’s hilarious, jazz-influenced darkly humorous and sometimes bawdy songs.  But, of course, drama--unlike fiction and poetry--is a mixed genre: the play is only partially realized when read on the page.  It must be performed.  Thus each student will be responsible for bringing about the enactment of Brecht’s drama.  The course may be a bit of a challenge, but it is a great opportunity for you to create living art of masterpiece quality and to discover the difference between writing done purely as a mode of elementary communication, or for mere entertainment, and writing that is open-ended, provocative, dynamic, haunting, and relentless in its dis/solving of the puzzle of the Real.", "schedule": "September 16\tINTRODUCTION: Brecht's Epic Theatre  READ:  Brecht 97-110; memorize “Mack the Knife”\r\n\r\nSeptember 23\tRead Act One aloud in class:  Work on characterization through voice; singing tryouts; begin selecting roles  ASSIGNMENT:  Begin memorizing lines\r\n\r\nSeptember 30\tRead Act Two aloud in class:  Work on characterization through voice; singing tryouts, provisionally select roles  ASSIGNMENT:  Continue memorizing lines\r\n\r\nOctober 7\tRead Act Three aloud in class:  Work on characterization through voice; singing tryouts, finalize role selection  ASSIGNMENT:  Continue memorizing lines\r\n\r\nOctober 14\tBegin blocking; ass’t director makes crew assignments. ASSIGNMENT:  Continue memorizing lines, songs.\r\n\r\nOctober 21\tBlocking; begin assembling materials for sets, costumes, etc. ASSIGNMENT:  Continue memorizing lines, songs.\r\n\r\nOctober 28\tBlocking with lines memorized Act One\r\n\r\nNovember 4\tBlocking with lines memorized Act Two\r\n\r\nNovember 11\t Blocking with lines memorized Act Three\r\n\r\nNovember 18\tSet construction and costuming supervised by ass’t director + individual singers work with musician(s)\r\n\r\nNovember 25\tScene Rehearsal with sets and costumes supervised by ass’t director + individual singers work with musician(s)\r\n\r\nDecember 2\tRehearsal  (Mandatory for all students)\r\n\r\nDecember 9\tRehearsal  (Mandatory of all students)\r\n\r\nDecember 16\tRehearsal  (Mandatory of all students)\r\n\r\nDecember 23\tDress Rehearsal/Informal Presentation for English Corner Students  (ABSOLUTELY mandatory of all students)\r\n\r\nDecember 30\tFinal Presentation  (ABSOLUTELY mandatory of all students)", "scorePolicy": "25%  memorization and blocking\t\r\n25%  rehearsal\r\n25%  taking an active role in work you have selected or that has been selected for you by the Assistant Director (e.g.designing and constructing or selecting set, costumes and/or props)\t\r\n25%  performance", "materials": "The Threepenny Opera by Bertolt Brecht and Kurt Weill", "foreignLanguageTextbooks": false}]