[{"name": "柯萊恩", "email": "kcline@ntut.edu.tw", "latestUpdate": "2010-08-30 15:18:44", "objective": "Whether lasting or ephemeral, subversive or mainstream, redemptive or mind-rotting, pop culture and its productions surround us every day.  What meaningful definitions can we make about popular culture, and, perhaps more importantly, in what ways does popular culture define us?  Features of popular culture that we will study in this class include forms of pop iconography found present in music, film, television and in an ever-expanding arsenal of new media.  Our study will be considered only partially complete if we consider primarily the content of the media under investigation.  The larger question I shall call upon you to explore is how, in conjunction with (or in subordination to) its content, the form of the media itself shapes the way we think about ourselves and the world.\r\n\r\nStudents will be asked to, in coordination with a small group of fellow students give give two 10-15 minute presentations over the course of the semester.  Although the presentation need not be (and preferably should not be) scripted or read-aloud, each must be accompanied by a one-two page informal reflection to be handed in on the day of the presentation.  To help make sense of the immense body of pop culture which inculcates us at every turn, I have taken the liberty of coining a new term “iconotype,” to isolate the separate (though often merged) iconographic tropes which form the body of popular culture today.\r\n\r\nICONOTYPES\r\n\r\nPart One (A)\r\nIntroduction:  The Cowboy\r\nI.  Fantasy Worlds and their Inhabitants  (Elves, trolls, sorcerers, hobbits, avatars, etc.)\r\nII. UFO’s and Alien Abductions\r\nIII. Super-Heroes\r\nIV. Beautiful Girls and Hunky Guys\r\nV. Spies and Detectives\r\nVI. Animation/Anime\r\n\r\nPart Two (B)\r\nIntroduction: Monsters\r\nI. Pop Stars or Real Musicians\r\nII. Celebrities Famous for Being Celebrities (or for only 15 minutes)\r\nIII. Fashion\r\nIV. Cultural Icons Who Made Important (i.e., Revolutionary) Contributions Within Their Chosen Fields or Society as a Whole\r\nV. Television and Film\r\nVI. Things People Do for Fun (hobbies, social activities, etc.)\r\n\r\nFILMS\r\n\r\nFrankenstein\r\nThe Ox-Bow Incident", "schedule": "25%\tReflections\r\n25%\tPresentations\r\n25%\tFinal Exam\r\n25%\tParticipation", "scorePolicy": "September 12\tIntro:  The American Cowboy  READ: McLuhan “Introduction”\r\n\r\nSeptember 19\tFilm:  The Ox-Bow Incident  READ: McLuhan “The Medium is the Message”\r\n\r\nSeptember 26\tGroup One (A) Presentation  READ: McLuhan “Media Hot and Cold”\r\n\r\nOctober 3\tGroup Two (A) Presentation  READ McLuhan “Reversal of the Overheated Medium”\r\n\r\nOctober 17\tGroup Three (A) Presentation  READ: McLuhan “The Gadget Lovers”\r\n\r\nOctober 24\tGroup Four (A) Presentation  READ: McLuhan “Hybrid Energy”.\r\n\r\nOctober 31\tGroup Five (A) Presentation  READ: McLuhan “Media As Translators”\r\n\r\nNovember 7 \tGroup Six (A) Presentation:  READ: McLuhan “Challenge and Collapse”\r\n\r\nNovember 14\tMidterm Examination/  Film: Frankenstein, Pt. One\r\n\r\nNovember 21\tFilm Frankenstein, Pt. Two; Group One (B) Presentation\r\n\r\nNovember 28\tGroup Two (B) Presentation\r\n\r\nDecember 5\tGroup Three (B) Presentation\r\n\r\nDecember 12\tGroup Four (B) Presentation\r\n\r\nDecember 19\tGroup Five (B) Presentation\r\n\r\nDecember 26\tGroup Six (B) Presentation\r\n\r\nJanuary 2\tConclusion:  Prepare Short Concluding Statement to read for class  (YOU MUST BRING ONE EXTRA COPY TO RECEIVE FULL CREDIT.)\r\n\r\nJanuary 9\tConclusion:  Prepare Short Concluding Statement to read for class  (YOU MUST BRING ONE EXTRA COPY TO RECEIVE FULL CREDIT.)", "materials": "　", "foreignLanguageTextbooks": false}]