[{"name": "余盛延", "email": "syyu@ntut.edu.tw", "latestUpdate": "2010-08-30 01:55:07", "objective": "English and American Literatures and Cultures\r\nFaustus and Its Cultural Heritage\r\nFall 2010\r\nProfessor Sheng-yen Yu\r\nTue. 4:10-7:00 p.m.\r\nRoom 716\r\nsyyu@ntut.edu.tw\r\noffice hours: Mon. 3:10-5:00 p.m. and Tue. 2:10-4:00 p.m.\r\n\r\nCourse Objective\r\nThis course is designed to extend students’ learning in the first year about Greco-Roman mythology and biblical narratives. For this purpose, we will study Christopher Marlowe’s Doctor Faustus and Nathaniel Hawthorne’s The Scarlet Letter, focusing especially on the theological issues that play a prominent role in the texts. We will investigate the impact of Calvinism and Puritanism on the people and the religious culture in Renaissance England and colonial New England. The choice of the texts is apt for this course mainly because their stories exemplify a continuity of English and American cultural and religious concerns.\r\n\r\nStudents are required to read the course materials carefully before attending each class and be ready to engage actively in class discussion. Every week, four of the students will each do an oral presentation (10 minutes) on the assigned reading material. In addition, there will be a final exam.", "schedule": "Syllabus\r\n\r\n09/14  Introduction\r\n\r\n09/21  General comments on Christopher Marlowe’s Doctor Faustus (1604; 1616); Doctor Faustus [Prologue, 1.1-1.2]\r\n\r\n09/28  Doctor Faustus [1.3, 1.4. 2.1]\r\n\r\n10/05  Doctor Faustus [2.1; 2.2; 2.3]\r\n\r\n10/12  Doctor Faustus [3 Chorus; 3.1; 3.2]\r\n\r\n10/19  Doctor Faustus [4 Chorus; 4.1]\r\n\r\n10/26  Doctor Faustus [4.2; 5.1]\r\n\r\n11/02  Doctor Faustus [5.2; Epilogue]\r\n\r\n11/09  General Comments on Nathaniel Hawthorne’s The Scarlet Letter; The Scarlet Letter [The Custom-House]\r\n\r\n11/16  The Scarlet Letter [I. The Prison-Door; II. The Market-Place; III. The Recognition]\r\n\r\n11/23  The Scarlet Letter [IV. The Interview; V. Hester at Her Needle; VI. Pearl; VII. The Governor’s Hall]\r\n\r\n11/30  The Scarlet Letter [VIII. The Elf-Child and the Minister; IX. The Leech; X. The Leech and His Patient]\r\n\r\n12/07  The Scarlet Letter [XI. The Interior of a Heart; XII. The Minister’s Vigil; XIII. Another view of Hester; XIV. Hester and the Physician]\r\n\r\n12/14  The Scarlet Letter [XV. Hester and Pearl; XVI. A Forest Walk; XVII. The Pastor and His Parishioner]\r\n\r\n12/21  The Scarlet Letter [XVIII. A Flood of Sunshine; XIX. The Child at the Brook-side; XX. The Minister in a Maze]\r\n\r\n12/28  The Scarlet Letter [XXI. The New England Holiday; XXII. The Procession; XXIII. The Revelation of the Scarlet Letter; XXIV. Conclusion]\r\n\r\n01/04  Final Exam\r\n\r\n01/11  Review and Discussion\r\n", "scorePolicy": "Grading policy: attendance: 20%; oral presentation: 30%; final exam: 50%", "materials": "Required Texts\r\nMarlowe, Christopher. The Tragical History of Doctor Faustus. (A 1604 Version) Ed. David Bevington and Eric Rasmussen. English Renaissance Drama: A Norton Anthology. Ed. David Bevington, et al. New York: Norton, 2002. 250-284.\r\n\r\nHawthorne, Nathaniel. The Scarlet Letter. Oxford UP.\r\n", "foreignLanguageTextbooks": false}]