[{"name": "余盛延", "email": "syyu@ntut.edu.tw", "latestUpdate": "2010-08-27 00:25:54", "objective": "Reading and Discussion I\r\nFall 2010\t\r\nProf. Yu\r\n(A) Mon: 08:10-10:00 a.m.\r\nsyyu@ntut.edu.tw\r\noffice hours: Mon. 3:10-5:00 p.m. and Tue. 2:10-4:00 p.m.\r\n\r\nIn this semester, we will read J. M. Coetzee’s Life & Times of Michael K. We will discuss the novel in detail in terms of its historical context, characterization, stories, themes, and style. Students taking this course are required to engage in a close reading of the novel and participate actively in class discussion. There will be some quizzes and a final exam. Grading policy: attendance: 20%; oral presentation: 30%; final exam: 50%.\r\n\r\n", "schedule": "09/20\tIntroduction\r\n09/27\tMichael K’s birth, childhood, disposition, and occupation; Anna K and her illness; the settings of the novel (pp. 3-16)\r\n10/04\tThe Ks’ application and wait for travel permits (pp. 16-28)\r\n10/11\tThe death of Anna K in a hospital in Stellenbosch; Michael K robbed by a soldier (pp. 28-41)\r\n10/18\tMichael K forced to labor; walking to Prince Albert; living on charity; arriving at Prince Albert; and hunting goats (pp. 41-54)\r\n10/25\tMichael K learning a lesson, burying his mother’s ashes, and beginning his life as a cultivator; the unexpected visit of a deserter from the army; the Visagie grandson’s assignment; Michael K running away (pp. 54-67)\r\n11/01\tMichael K’s life in the mountains and in the Jakkalsdrif labor camp (pp. 67-80)\r\n11/08\tThe function of the camp; Michael K’s negotiation with a guard; Michael K forced to labor; the condition for leaving the Jakkalsdrif camp (pp. 80-93)\r\n11/15\tOosthuizen’s wrath; Robert’s influence; Michael K shouting for help; Michael K’s escape from the camp and return to the Visagie farm; Michael K’s life on the farm (pp. 93-106)\r\n11/22\tMichael K’s confidence, fear, and anxiety; his hiding in a cave; his freedom; the idea of the parasite; his dreams; his appetite (pp. 106-119)\r\n11/29\tMichael K discovered by the soldiers; Captain Oosthuizen’s recognition of Michael K; heavy explosions—end of Part One—Michael K’s detention at the Kenilworth camp (pp. 119-132)\r\n12/06\tThe medical officer’s narration about Michael K; Noël and the medical officer’s investigation of Michael K (pp. 132-145)\r\n12/13\tMichael K’s refusal to eat; the medical officer’s undelivered letter to Michael K; Michael K’s escape from the Kenilworth rehabilitation camp (pp. 145-159)\r\n12/20\tMore prisoners sent to the Kenilworth camp; the medical officer’s desire to follow Michael K; the medical officer’s exploration of the significance of Michael K’s refusal to eat; the medical officer’s comment on Michael K (pp. 159-167)\r\n12/27\tMichael K’s return to Sea Point, Cape Town; his harassment by a pimp and two prostitutes; his pursuit of an independent living as a gardener (pp. 169-184)\r\n01/03\tFinal Exam\r\n01/10\tReview and Discussion\r\n", "scorePolicy": "Grading policy: attendance: 20%; oral presentation: 30%; final exam: 50%.", "materials": "Texts:\r\nCoetzee, J. M. Life & Times of Michael K. New York: Penguin, 1983.\r\nFurther Readings:\r\nAttridge, Derek. “Against Allegory: Waiting for the Barbarians, Life & Times of Michael K, and the Question of Literary Reading.” J. M. Coetzee and the Idea of the Public Intellectual. Ed. Jane Poyner. Athens: Ohio UP, 2006. 63-82.\r\nGallagher, Susan VanZanten. “Apocalypse: Life & Times of Michael K.” A Story of South Africa: J. M. Coetzee’s Fiction in Context. Cambridge: Harvard UP, 1991. 136-165.\r\n", "foreignLanguageTextbooks": false}]