[{"name": "周素鳳", "email": "sfchou@ntut.edu.tw", "latestUpdate": "2010-08-28 16:40:52", "objective": "In the first semester, Intermediate English Writing is specifically designed to enhance students’ ability to present a clear, concise, coherent expository essay (Project I—Recollection and Reflection) and a well-organized analysis essay with a well-articulated thesis statement, sound reasoning support and an effective conclusion (Project II—Character Analysis).  Throughout the course, students will learn to develop their writing through dialogic interactions with texts, through class discussion and other collaborative class practices, and through sequenced assignments.  \r\nIn addition to the essays which aim to demonstrate essential writing skills, Jodi Picoult’s My Sister’s Keeper is especially selected for Project II. Students are required to compile a reading portfolio to demonstrate their progress as a close reader and reflective writer. It is hoped that through such an approach, students’ vocabulary power will be enriched, their ability in literary analysis cultivated, and their writing skill advanced.\r\n", "schedule": "9/14\tWriter’s Block/Main Idea/“Misconceptions about Writing”\r\n\t\r\n9/21\tFinding the Topic /Topic Sentenc/“Gary Larson’s Cartoon/\r\nMy Sister’s Keeper(pp. 1-29)\t\r\n9/28\tActive Reading /Observing/“Prospect Park”/M: 30-54;55~85\t\r\n10/5\tFree Association/“The Match”/M: 87-101; 102~128\t\r\n10/12\tFinding the Central Idea/“A Sketch of the Past”/M: 129-157\t/1st draft of Project I\r\n10/18\tOne-to-one discussion with the teacher   (M: 158~178; 179~196)\r\n10/26\tSelf-study: “Daddy Tucked…” (M: 197~221; 222~242)\r\n11/2\t2nd draft of Project I\r\n11/9\t(M: 158~178; 179~196)(M: 197~221; 222~242) \t\r\n11/10\tOne-to-one discussion with the teacher\r\n11/16\tHow to Write a Summary/\t“Our Barbies, Ourselves/M: 243-268; 269~298\t/Project I completed \r\n11/23\tHow to Write a Paraphrase /“An Anthropologist on Mars”/M: 299~326; 327~357\t\r\n12/30\tDialogue witht the Text/ ”Cat in the Rain”/M: 358-387; 388~416\t\r\n12/7\tAnalysis paper vs.Reflection paper/“Necklace”/M:417~441; 442~468\t\r\n12/14\tWriting an Analysis/“Story of an Hour”/M:469~500\t\r\n12/21\tCharacter Analysis/ Draft of Project II\r\n12/31\tOne-to-one discussion with the teacher\r\n1/7\tBook Review on My Sister’s Keeper/ Reading Portfolio  \r\n1/14\tReview and Discussion/ Project II completed\r\n\r\n", "scorePolicy": "Criteria for Grading\r\n1.Project I--35% : \r\n  1st draft: 10%; 2nd draft: 10%; final draft: 15%\r\n2.Project II—40%: \r\nreading portfolio: 10%; 1st draft: 10%;  revised draft: 20%\r\n3.Attendance, In class practice, Peer-reviewing and comments, Assignments: 25% \r\n\r\n", "materials": "Requirements:\r\n1.\tYour regular attendance is required to pass this course.  3 unexcused absences \r\n    from class will result in failing this course.  Excused absences require \r\n    that I be notified on or before class date, or with official documentation shortly after the absence.  One unexcused absence will result in an automatic final score\r\n    reduction of 3 points.  If you are more than 20 minutes late to the class, it will be counted as an absence.  One late attendance means a 1 point reduction\r\n    from your final score. \r\n2.  Throughout the semester, there will be in-class activities (peer-reviewing, group discussion) and in-class writings (free-writing, response to the selected reading text, peer comments, pair-writing).  If you fail to submit the exercise by the end of the class, there is no way to make it up (no exceptions).  However, your lowest score will be dropped—so, save this for the unexpected occasion when you might be sick or miss class for other reason.\r\n3.  All take-home assignments must be submitted on the day that they are due; otherwise, they are late.    A late paper will be penalized at the rate of 5 points reduction a day. A computer problem is not a legitimate excuse.\r\n4.  Each student should maintain a portfolio of your reading on My Sister’s Keeper.  Each reading portfolio includes at least 8 entries. The first three ones may include your notes in reading, while the rest 5 must contain two components: a summary and a response. \r\n5.  Each student should prepare an A4 folder (a writing portfolio) collecting your writing assignments.  Each time you submit your assignment, you should put it in the folder with the previous assignments included in it.\r\n\r\n", "foreignLanguageTextbooks": false}]