[{"name": "黃清孝", "email": "Csiyu.huang@msa.hinet.net", "latestUpdate": "2010-08-16 21:48:08", "objective": "了解國內外紡織市場與行銷策略，紡織工業之建立、紡織工業之發展過、台灣紡織與製衣工業外銷情況、世界市場紡織品之行銷策略、如何突破外銷瓶頸、如何生產附加價值高之紡織品以適合市場之需要。\r\nTo provide students with an understanding of the technological and quality context in which textile products are manufactured, marketed and sourced. In the time of increasing global competition it is essential for textile industries to have products and services of a high quality. The course will also provide students with case studies of implementing quality management in the UK and Taiwanese textile industries.", "schedule": "Curriculum\r\nWeek\tContents\r\n(1) Course Introduction and Discussion Basic Textile-Textile\r\nTerminology\r\n(2) Basic Textile-Nature fibers, man-made fibers, and spinning processes\r\n(3) International Competitive Strategies-Pursued a continual process of production innovation\r\n(4) The Competitive Landscape-Intense international competition, and economic factors\r\n(5) Quality management 1- Deming circle, statistical quality control, and standardization\r\n(6) Quality management 2-What is control, check and action, sampling, arrangement of data, and factor chart\r\n(7) Quality management 3-Control charts, process control, and total quality control\r\n(8) The ISO 9000 series of quality management standards\r\n(9) Mid-Term Examination\r\n(10) Present Paper reading\r\n(11) Industrial Visit: Shinkong Synthetic Textile\r\n(12) Quality system requirements appropriate to the textile industry\r\n(13) Case studies of implementing quality management in the UK textile industry\r\n(14) Case studies of implementing quality management in the Taiwanese textile industry\r\n(15) Industrial Visit: Wanstar Technology\r\n(16) Comparison between the Taiwanese and the British experience of ISO 9000 and TQM in the textile industry\r\n(17) Comparison between the Taiwanese and the British experience of ISO 9000 and TQM in the textile industry\r\n(18) Final Examination\r\n", "scorePolicy": "Score distribution\r\n1. Attendance 15%\r\n2. Mid-Term Examination 30%\r\n3. Reading Report 15% (Report 10%, Presentation 5%)\r\n4. Final Examination 40%\r\n", "materials": "Textbook(s) and References\r\n1. Edith Pankowski and Dallas Pankowski, Basic Textile, A Programmed Manual, Macmillan Publishing Co., Inc., 1972.\r\n2. ISO Management Systems: Published six times a year by the Central Secretariat of ISO (International Organization for Standardization),2008-2009.\r\n3. ISO Focus+,The magazine of the International Organization for Standardization),2010.\r\n4. Ching-Shaw Huang, The Implementation of ISO 9000 in the UK and Taiwanese Textile Industries, School of Textile Industries, The University of Leeds, PhD, 1998, pp. 1-15.\r\n5. Ching-Shaw Huang, Comparison between the Taiwanese and the British experience of ISO 9000 and TQM in the textile industries, The Proceeding of 16th Asia Quality Symposium November 15-16, 2002/( Part 3) pp. 418-424.\r\n6. TUV, The New ISO 9000: 2000- Interpretation of the Requirements of the Draft Standards, pp. 35-37.\r\n", "foreignLanguageTextbooks": false}]