[{"name": "陳文學", "email": "wschen@ntut.edu.tw", "latestUpdate": "2008-01-30 14:42:44", "objective": "本課程將介紹工程上、物理上系統解析的相關數學工具，內容包括：\r\n一、向量幾何與分析：矩陣行列式及特徵問題。\r\n二、傅立葉級數，積分及轉換。\r\n三、偏微分方程及邊界值問題。\r\n", "schedule": "第一週   Vector Functions of One Variable, Velocity, Acceleration, Curvature, and Torsion\r\n第二週   The Gradient Field and Directional Derivatives, Divergence and Curl\r\n第三週   Line Integrals, Green’s Theorem\r\n第四週   Independence of Path and Potential Theory in the Plane,  Surfaces in 3-Space and Surface Integrals\r\n第五週   Applications of Surface Integrals, Preparation for the Integral Theorems of Gauss and Stokes\r\n第六週   The Divergence Theorem of Gauss and the Integral Theorem of Stokes\r\n第七週   The Fourier Series of a Function, Convergence of Fourier Series\r\n第八週   The Phase Angle Form of a Fourier Series, Complex Fourier Series and the Frequency Spectrum\r\n第九週    The Fourier Integral, Complex Fourier Integral and the Fourier Transform, Midterm Exam.\r\n第十週   The Wave Equation and Initial and Boundary Conditions\r\n第十一週  Fourier Series Solutions of the Wave Equation\r\n第十二週  Wave Motion Along Infinite and Semi-infinite Strings\r\n第十三週  The Heat Equation and Initial and Boundary Conditions\r\n第十四週  Fourier Series Solutions of the Heat Equation\r\n第十五週  Heat Conduction in Infinite Media, an infinite Cylinder, and Rectangular Plate\r\n第十六週  Harmonic Functions and Dirichlet Problem\r\n第十七週  Dirichlet Problem for a Rectangle, Disk, and Cube\r\n第十八週  The Steady-State Equation for a Solid Sphere, Final Exam.", "scorePolicy": "1.Assignment\t10%\r\n2.Quizzes\t\t30%\r\n3.Midterm exam.\t30%\r\n4.Final exam.\t30%", "materials": "Textbook: Advanced Engineering Mathematics   6th Edition\r\nPeter V. O’Neil\r\nReference Book：Differential Equations with Boundary-Value Problems 6th Ed.\r\nDennis G. Zill and Michael R. Cullen", "foreignLanguageTextbooks": false}]