[{"name": "楊韻華", "email": "yhyang@ntut.edu.tw", "latestUpdate": "2008-03-06 14:59:14", "objective": "本課程因應二十一世紀工商領軍時代的需求，透過國際語言進行訓練生活，經貿，勞資及國際事務之溝通與談判，理論與實務並重，循序漸進，培訓英語溝通及談判人才。\t\r\nCourse Description: \r\n        This course is designed for senior English-major students   who are equipped with advanced level of English language competence to develop comprehensive understanding of the principles, strategies and tactics of effective negotiation and to strengthen professional relationship management skills. This course adopts case study approach to engage and motivate students in the real-life scenarios of conflicts and concessions. The examination of these cases is also a prominent means to develop a high level of awareness of cultural differences and the impact of inconformity on negotiations and conflict resolutions. \r\n \r\nCourse Objectives:  \r\n     Students are expected to become confident in their communicative competence in a variety of communication and negotiation settings, and thence an effective negotiator. Students can \r\n   (1)Develop an understanding of the principles, process and  strategies of effective negotiation.\r\n   (2)Plan integrative strategies and effectively execute negotiation plan  \r\n   (3)Strengthen persuasive, analytical and interpersonal skills\r\n   (4)Enhance their abilities in dealing with contingent situations. \r\n   (5)Use communication techniques and persuasive ploys to achieve goals.\r\n   (6)Promote a high level of awareness of ethical issues in a wide variety of situations.\r\n", "schedule": "Course requirements:\r\n     All students are expected to participate in the communicative exchange for material discussions and negotiations. A total of five cases will be submitted for in-class case discussion. Each student pair is responsible for analyzing and performing ONE case, on which simulated negotiation is based. The simulation is recommended to be conducted as suggested and instructed. And yet it is also preferred that students develop their own strategic negotiation plan to play out. In addition to the case negotiation, students are also required to give a report on the reading assigned. Each student pair (panel) should \r\n   1)report on the assigned reading \r\n   2)brief the class on the case with complete analysis of its various spheres in its reality \r\n   3)examine the negotiation plan in use and other possible strategies in question\r\n   4)demonstrate the happenings of negotiation \r\n   5)identify the various of spheres of reality at play \r\n   6)evaluate the negotiation \r\n   7)submit an analysis report on the current negotiation with the above content included\r\n\r\nTentative Assignment Schedule \r\n\r\nWk / Date \tReading \t  Case Negotiation \r\nWk 1\tOrientation / Types of Negotiation \t\r\nWk 2\tFour Key Concepts\tCompeting Approaches to Negotiation Practice\r\nWk 4\tPreparation\tPersonality and Negotiation\r\nWk 5\tSun and Fun Tours vs. Hotel De La Playa\r\n(Compensation for Breach of Agreement)\tNegotiation Demo\r\nWk 6\tTable Tactics / \tDealing with Negotiators\r\nWk 7\tSansung Sporting Goods Seeks A Scandinavian Distributor ( An Agency Agreement)\tNegotiation Demo \r\nWk 8\tFrequently Asked Tactical Questions\tTBD\r\nWk 9\tBarriers to Agreement Mental Errors\tTBD\r\nWk 10\tAmerican Auto Corp. vs. Auto Workers’ Union (Wage and Working Conditions Negotiations)\tNegotiation Demo \r\nWk 11\tWhen Relationships Matter \tTBD\r\n\r\n\r\nWk 12\tTourism Comes to Zanir\r\n(Development of a Tourist Resort)Conflict Resolution\tNegotiation Demo \r\nWk 13\tNegotiating for Others \t TBD\r\nWk 14\tChemi Suisse vs. the State of India\r\n(A Catastrophe and Claims for Compensation)\tNegotiation Demo \r\nWk 15\tNegotiation Skills \tTBD\r\nWk 16\tTBD\tTBD\r\nWk 17\tTBD\tTBD\r\nWk 18\tTBD\t\r\n\r\n* * Each panel will be assigned to complete the writing tasks. Tasks will be determined and announced as the class proceeds. \r\n\r\n\r\n", "scorePolicy": "Grading System:\t\r\n\t\r\nCase Negotiation \r\n(1)\tchapter presentation \r\n(2)\tnegotiation briefing & demo performance \r\n(3)\tanalysis report \t70%\r\nAttendance (Each unexcused absence will result in a penalty of grade deduction of 10 %.)\t30%\r\n*(The grading policy is subject to contingent alternations as the class proceeds.)\r\n", "materials": "Harvard Business Essentials on Negotiation & Compiled Handouts", "foreignLanguageTextbooks": false}]