[{"name": "楊韻華", "email": "yhyang@ntut.edu.tw", "latestUpdate": "2008-02-20 12:05:51", "objective": "本課程介紹語言教學與學習原則，語言習得理論，和語言習得領域重要研究發現。期能建立學生應用語言學知識與日後相關研究的基礎。課程涵蓋主要內容包括：母語習得理論與實踐、第二語言(外語)習得理論與實踐、母語習得與第二語言(外語)習得之相同與相異處、影響語言習得重要因素(情性因素與社會文化因素)、語言學習者策略、對比分析、錯誤分析、語言溝通能力、閱讀理論與實踐、 寫作理論與實踐。\r\nCourse Description: This course will look at the process of   acquiring / learning and using a second language. It provides theoretical and experimental insights to examine the phenomenon of language development from multi-disciplinary perspectives. \r\n\r\nCourse Objectives:  This course aims to help students \r\n(1) understand the principles and processes governing L1 & L2 acquisition and learning\r\n(2) examine how non-native language ability develops\r\n(3) become familiar with SLA theories to account for many facets of non-native discourse\r\n", "schedule": "Course Requirements:\r\n(1) All students are required to use a copyrighted textbook. No photocopied edition will be accepted for use in class. It is important for students to be aware that legal action will potentially be sought by the publisher in the case of using an unauthorized duplicated text.  \r\n(2) Students will form pairs on the first day of class and be responsible for in-class presentations as assigned. \r\n(3) Each student pair is required to conduct a PPT report on the assigned textbook section (see details). \r\n(i) Student presentations cover a range of related topics in  Chapter 5, 6, 7, and 9.\r\n(ii) All PPT presentations need to comply with the format as instructed and modeled by the instructor.\r\n(iii)Detailed notes of handouts for distribution in class need to incorporate all theories, arguments, discussions and studies reviewed in the textbook. English-Chinese bilingual handouts are preferred. \r\n(iv) A full-length, revised Chinese translation of the text is due for submission in two weeks after the presentation session. Assignments must be submitted both in electronic and paper forms. \r\n(4) Each student will be given abundant opportunities to provide his/ her response toward the assigned reading content as the lectures proceed. Students must complete all readings assigned prior to the class session.  \r\n(5) The instructor will not assign additional readings. However, as SLA is multi-disciplinary in nature, it comprises a broad array of theories and studies. Students who are highly interested in this field are strongly encouraged to consult the professor for further suggested readings.\r\n(6) Attendance: Students are required to attend the class as scheduled. \r\ni.Each unexcused absence will result in 10% semester grade deduction. \r\nii.At the sole discretion of the instructor, some absence penalties may be waived with valid proof and just cause. No Penalty waiver request will only be accepted in two weeks of the date of absence. Students forfeit the right of contention after that. It is important to know that only ONE- time penalty waiver will be granted to any student.  \r\niii.Lateness to class: Any arrival to class after the instructor finishes the second-round roll call is considered lateness. Two times of lateness will, in effect, incur a grade penalty of 5% semester grade deduction.\r\n-------------------------------------------------------------------\r\nClass Schedule:\r\n\r\nWeek \tClass Task \t        Lecturer(s)\t\r\n1_Feb.18\tOrientation + Ch. 1 \tDr. Yang\t\r\n2_Feb.25\tCh. 1 \t                  Dr. Yang\t\r\n3_Mar.3 \tCh. 2\t                  Dr. Yang\t\r\n4_Mar.10\tCh. 2\t                  Dr. Yang\t\r\n5_Mar.17\tCh. 3\t                  Dr. Yang\t\r\n6_Mar.24\tCh.3\t                  Dr. Yang\t\r\n7_Mar.31.\tCh. 3 +Ch. 4\t         Dr. Yang\t\r\n8_Apr.7\tCh. 4 \t                  Dr. Yang\t\r\n9_Apr.14\tCh. 4 + Midterm \t         Dr. Yang\t\r\n\r\n10_Apr.21\tCh. 5 Presentations: pp. 99-124 Dr. Yang + Student Pairs 1-6\t\r\n11_Apr.28\tCh. 5 Presentations: pp.99-124  Dr. Yang +Student Pairs 1-6\t\r\n12_May 5\tCh. 6 Presentations: pp.127-162 Dr. Yang +Student Pairs 7-14\t\r\n13_May12\tCh. 6 Presentations: pp.127-162 Dr. Yang +Student Pairs 7-14\t\r\n14_May19\tCh. 6 Presentations: pp.127 -162 + Ch 7. Presentations: \r\n     pp. 164-188\tDr. Yang +Student Pairs 7-14 / Student Pairs 15-19\t\r\n15_May26\tCh. 7 Presentations: pp. 164-188 \r\n               Dr. Yang +Student Pairs 15-19\t\r\n\r\n16_Jun.2\tCh. 9 Presentations: pp. 213-246\t\r\n               Dr. Yang +Student Pairs 20-25\t\r\n\r\n17_Jun.9\tCh. 9 Presentations: pp. 213-246+ Ch. 10 Seven Theories of SLA \tDr. Yang +Student Pairs 20-25 \r\n\t\r\n18_Jun.16\tFinal Exam \t\r\n\t\r\n*Class schedule is subject to necessary modifications at the professor’s discretion.\r\n\r\n", "scorePolicy": "Evaluation Procedures & Grading System:\r\n   Final grades will be determined by a point system (X out of 100 total points). Students will be evaluated by their presentations, handouts, full-length text translations, in-class exams, and attendance.\r\n(1) PPT Presentation & Handout 10%\r\n(2) Text translation 25% \r\n(3) Exams (Midterm & Final) 45% * Total possible points for midterm and final exams are 50 points respectively. \r\n(4) Attendance 20%\r\n", "materials": "Required Texts:   Ellis, Rod. Understanding Second Language Acquisition, Oxford Applied Linguistics Series, Oxford University Press, 2003.", "foreignLanguageTextbooks": false}]