[{"name": "楊韻華", "email": "yhyang@ntut.edu.tw", "latestUpdate": "2008-02-20 12:10:20", "objective": "本課程旨在培養學生撰寫及處理各類商用文書之能力，透過各類專業文體的講授及寫作練習，使學生熟悉各類商用文書術語、文體及文件的應用。\t\r\nCourse Description: \r\n    This course is designed for English-major students who are interested in planning a career in business practice. It focuses on effective written communication in various types of business correspondence, reports, and collaborative projects in business contexts. In addition, this course introduces basic business concepts for better understanding of business activities.\r\n\r\nCourse Objectives:  \r\n   This course has its dual emphases and aims to help the students to develop strong business competence delivered through the English language. Students can thus  \r\n(1) understand a broad array of business contexts to actively participate in business communications\r\n(2) respond effectively in concise and accurate English to a variety of professional scenarios and achieve communication goals \r\n(3) develop a high level of writing skills in producing quality correspondence and related documentations.\r\n(4) increase knowledge of basic business vocabulary, concepts and operations.\r\n(5) promote a high level of awareness of and attention to the contemporary and up-to-date global business climate. \r\n", "schedule": "Course requirements:\r\n   Each student must fulfill the following requirements in a panel:    \r\nStudent panels will be organized. Each student panel is required to work collaboratively on vocabulary session assigned and on writings for simulated business communications. Hardcopy (paper) handouts are necessary for class distribution. Also submit the electronic files on compact disk, on which both drafts and revised versions of assignment need to be included, to the instructor within two weeks after the presentation date. \r\n    * In Collins Cobuild Business Vocabulary in Practice: Student panels need to \r\n1) give oral reports / presentations on the assigned unit(s).\r\n2) prepare concise handouts with Chinese translation on the assigned unit(s).\r\n3) submit a complete panel vocabulary and writing portfolio.\r\n    * In business correspondence: Student panels need to \r\n4) prepare sample writings based on the simulated situation(s) and scenario(s)write at least1 letter a week as scheduled based on simulated scenarios.\r\n5) prepare / distribute copies of sample writings for in-class discussion.  \r\n6) participate in group discussions and business simulations and problem-solving activities.\r\n7) submit a complete panel vocabulary and writing portfolio.\r\n \r\nAssignments and Grading\r\n(A) Guidelines:\r\n1) Complete the assignments as scheduled and submit the completed portfolio at the semester end (deadline TBD). No extension will be considered if not asked in advance. \r\n2) Each panel member needs to write a brief reflection regarding the present course and their own learning. Reflection writings shall be included in the panel portfolio.\r\n3) Plagiarism is an academic misconduct. Once found, it will result in failing grade in this course without contention. \r\n4) Follow the formal business correspondence formats (as instructed and modeled in class OR in other sources)\r\n5) Collaborative group projects are presented extemporaneously in English by using PowerPoint and other necessary visual aids. \r\n", "scorePolicy": "Grading System\t\t\r\nPanel Assignment 40%:\r\n(1)\tbusiness vocabulary \r\n(2)\tbusiness correspondence \r\n(3)\tpanel portfolio \t\r\nAttendance (Each absence will result in a penalty of grade deduction of 10%.)\t30%\r\nFinal Exam  20%\r\n*(The grading policy is subject to contingent alternations as the class proceeds.)\r\n", "materials": "Required Text(s):    \r\n(1) Collins Cobuild Business Vocabulary in Practice. Sue Robbins. HarperCollins Publishers, 2003.  \r\n(2) Compilations of business writing guidelines, samples and tests\r\n", "foreignLanguageTextbooks": false}]