[{"name": "楊韻華", "email": "yhyang@ntut.edu.tw", "latestUpdate": "2008-03-06 15:04:40", "objective": "英語教學實作課程，將課本上的英語教學法應用至實際的教學狀況中。兩學分的課程，提供學生將理論應用至實際的教學情境中。主旨在於利用英語教學實務，讓學生應用教學法，改善教學的方法技巧及加強教學領域…等。課程中由老師或合作學校及教室的指導老師從旁評估分析。在此課程中，學生還會與指導教授及在場的指導老師定期的討論以期能達到評估教學的目的。學生在這一學期中，最少需教學24個小時。學生在本課程結束完成後，學生們將會獲得由合作學校所頒發的教學實習證明。", "schedule": "The course offers teaching internship for students enrolled in English Teaching Practicum. The course also aims to prepare quality English teachers. Student intern teachers are obligated to assist English teaching as assigned in the internship program. The current practicum, as part of the teaching development curriculum, provides the opportunity for students to employ theories to classroom practice. Internship program varies each academic year / semester. Student interns are thus required to abide by the regulations, conditions and codes of conduct drawn in the present program agreement.  In this current semester, three internship programs are available:\r\n1)\tTeaching Assistant for English Language Proficiency Course: intern teachers are responsible for assisting the various tasks assigned by the course instructor(s) of the evening English Language Proficiency Course. Details will be provided at a later time.\r\n2)\tTeaching Excellence English Tutor: intern teachers are responsible for tutoring students at NTUT in their various needs in English learning. This program is under the direct supervision of Faculty Development Center. Details will be provided at a later time.\r\n3)\tHappy English Village Internship: intern teachers are responsible for assisting English teaching at Happy English Village located in Taoyuan County. In this semester all Happy English Village intern teachers are compiling their respective comprehensive teaching portfolio. \r\n", "scorePolicy": "(1) Student intern assessment will be conducted on the collaboration of the partner school supervisors, coordinator(s) and the faculty moderator (the course instructor). \r\n(2) All site evaluation will adopt the qualitative assessment method. Final grades will be given by the faculty moderator (the course instructor).\r\n(3) Student interns will need to submit midterm and final teaching reports to the instructor. Format and details for the report will be provided at a later time.\r\n\r\nEvaluation by partner school / class instructor  50%\r\nAttendance  30%\r\nLesson plans  20%\r\n", "materials": "　", "foreignLanguageTextbooks": false}]