[{"name": "楊韻華", "email": "yhyang@ntut.edu.tw", "latestUpdate": "2009-02-18 09:14:47", "objective": "Course Description: This course introduces English-major students to the rudiments of the science of logic as well as to the basic skills to develop effective thinking and critical argumentation. Logic and language are inseparable. Students who have chosen language studies as a profession are obligated to think logically, and to argue analytically in the use of the language acquired. This course, however, is not intended to introduce theories of argumentation; nor does it seek to produce theoreticians of philosophy. It is, in his nature, a practical preparation for students who are about to engage in myriads of academic and professional tasks, which demand strong ability in critical reasoning and logic-based argumentation. The learning of the English language is also enhanced through the studies of the materials.\r\nCourse Objectives:  This course has its dual emphases and aims to help the students establish strong critical thinking and argumentation skills as well as learn the use the English language logically. Students will be able to\r\n(1)\tunderstand the basic principles of logic and the language   of logic\r\n(2)\tunderstand the framework of argumentation\r\n(3)\tidentify the principal forms of illogical thinking\r\n(4)\tthink, reason and argue analytically and critically\r\n(5)\tacquire and use key terms in simulated case debate\r\n", "schedule": "Week/ Date\tContent Unit / Chapter\r\n1_ Feb. 18\tOrientation / What is critical thinking and how to improve it?\r\n2_ Feb. 25\tIdentifying reasons and conclusions: the language of reasoning\r\n3_ Mar. 4\tUnderstanding reasoning: different patterns of reasoning\r\n4_ Mar. 11\tUnderstanding reasoning: assumptions, context and a thinking map\r\n5_ Mar. 18\tEvaluating inferences: deductive validity and other grounds\r\n6_ Mar. 25\tEvaluating inferences: assumptions and other relevant arguments\r\n7_ Apr. 1\tReasoning about causal explanations\r\n8_ Apr. 8\tMidterm\r\n9_ Apr. 15\tWhat are the reasons? /What words and phrases are ambiguous?\r\n10_ Apr. 22\tWhat are the value conflicts and assumptions? / What are the descriptive assumptions?\r\n11_ Apr. 29\tAre there any fallacies in the reasoning? / Identifying flaws in the argument\r\n12_ May 6\tEvidence / How good is the evidence? / Finding and evaluating sources of evidence\r\n13_ May13\tRelevance: probative relevance, dialectical relevance, relevance in meetings and debates\r\n14_ May 20\tRelevance: relevance in legal argumentation, fear appeal arguments, etc\r\n15_ May 27\tThe use and abuse of logic 1\r\n16_ Jun. 3\tThe use and abuse of logic 2\r\n17_ Jun. 10\tThe use and abuse of logic 3\r\n18_ Jun. 17\tFinal Exam\r\n", "scorePolicy": "Course requirements:\r\nEach student must fulfill the following requirements:\r\n(1)\tStudy each chapter / unit assigned prior to class session.\r\n(2)\tSubmit an elaborated outline of the chapter assigned for each week. (sample provided)\r\n(3)\tPresent chapter outline as randomly assigned by the instructor.\r\n(4)\tParticipate in course activities and respond to questions in class discussion.\r\n(5)\tTake notes of class lectures and discussion. Submit the handouts of notes in the final portfolio.\r\n(6)\tMidterm / Final Exam and in-class quizzes\r\nAssignments and Grading:\r\n(A)\tGuidelines:\r\n1)\tComplete the assignments as scheduled and submit the completed portfolio at the semester end (deadline TBD). No extension will be considered if not asked in advance.\r\n2)\tEach student needs to write a brief reflection regarding the present course and their own learning. Reflection writings shall be included in the final portfolio.\r\n3)\tPlagiarism is an academic misconduct. Once found, it will result in failing grade in this course without contention.\r\n4)\tAll presentations and discussions are conducted extemporaneously in English.\r\n(B) Grading System\r\nAssignment:\r\n(1)\tChapter outline presentation 10%\r\n(2)\tClass participation and oral responses 10%\r\n(3)\tOther assignments (article critique) 5%\r\n(4)\tPortfolio (lecture notes included) 5%\t30%\r\nAttendance (Each absence will result in a penalty of grade deduction of 10%.)\t30%\r\nMidterm Exam \t20%\r\nFinal Exam\t20%\r\n*(The grading policy is subject to contingent alternations as the class proceeds.)\r\n", "materials": "Required Text(s):   Compiled Class Handouts\r\nRecommended Text (s):\t1)\tBeing Logical: A Guide to Good Thinking by D.Q. Mcinerny\r\n2)\tFundamentals of Critical Argumentation (Critical Reasoning and Argumentation) (Paperback) by Douglas Walton\r\n3)\tCritical Thinking Skills by Stella Cottrell\r\n4)\tAsking the Right Questions: A Guide to Critical Thinking (8th Edition)\r\nby Neil Browne & Stuart M. Keeley\r\n5)\tCritical Thinking: An Introduction by Alec Fisher\r\n", "foreignLanguageTextbooks": false}]