[{"name": "陳雅玫", "email": "ymchen@ntut.edu.tw", "latestUpdate": "2009-02-28 15:32:19", "objective": "This course is designed to introduce to students basic skills for consecutive interpretation, including note-taking techniques, pre-task preparation, bilingual glossary compiling and knowledge build-up. These skills will not only lay the foundation for more advanced interpreting training but will also be of value in other professions. 。", "schedule": "Week 1  introduction\r\nWeek 2  (1)short consecutive interpretation: mock exercises\r\n(2)introduction to note-taking\r\nWeek 3  note-taking techniques and exercises\r\nWeek 4  (1) note-taking techniques\r\n(2) pre-task preparation\r\n(3) glossary compiling\r\nWeek 5  Politics exercises\r\nWeek 6  Politics exercises\r\nWeek 7  Science & Technology\r\nWeek 8  Science & Technology\r\nWeek 9  Mid-term\r\nWeek 10 Business & Finance\r\nWeek 11 Business & Finance\r\nWeek 12 Travel\r\nWeek 13 Travel\r\nWeek 14 mock conference\r\nWeek 15 mock conference\r\nWeek 16 introduction to basic skills of SI\r\nWeek 17 Wrap-up\r\nWeek 18 Final Exam\r\n", "scorePolicy": "1. attendance and participation: 15%\r\n2. assignments: 20%\r\n(1) one-page group report\r\n(2) glossary compiling\r\n3. in-class evaluation: 15%\r\n4. mid-term exam: 25%\r\n5. final exam: 25%\r\n", "materials": "Teaching and practice materials will be prepared by the instructor.\r\n\r\nRequirements and rules: \r\n1. Please turn off your cell phone during the two-hour class period.\r\n\r\n2. Absence: Students are expected to attend the class ON TIME. \r\n(1) Being late for more than TWENTY minutes equals one hour unexcused absence. One hour UNEXCUSED absence results in 2 points deduction.  \r\n(2) For an absence to be excused, students need to submit compelling evidence of the gravity or unforseeability of the event causing the absence within ONE WEEK. \r\n(3) Students missing more than TEN hours will have a fail.\r\n(4) Absence from a class is no excuse for not knowing the assignment and what has been discussed in that class. There will be NO MAKE-UP EXAM unless you have valid and official reasons for absence BEFOREHAND.\r\n\r\n3. Assignments: \r\n(1) Group Report: students are required to do the assigned note-taking and CI exercises both individually and in groups. Each group needs to submit a written report (within one page) every week, briefly describing in English the problems or difficulties encountered as regards the assigned exercises. The report should be e-mailed to the instructor by FRIDAY 5pm. For late submission, 20% of the mark will be deducted each day. Reports more than THREE days late will not be accepted.\r\n(2) Glossary Compiling: Each student needs to compile a bilingual glossary relevant to the upcoming speech. One printed copy of the compiled glossary should be submitted to the instructor in class. A CD containing the compiled glossaries for all the speeches has to be handed in to the instructor in WEEK 16 (save each glossary for a given speech in a separate file).  \r\n  \r\n4. In-class Evaluation: In class, the instructor will call on individual students at random to check off if \r\nthey have done the assigned exercises, and students’ performances will be evaluated.  \r\n\r\n", "foreignLanguageTextbooks": false}]