[{"name": "徐健達", "email": "atatsu@seed.net.tw", "latestUpdate": "2009-02-23 13:02:52", "objective": "Course Objectives\r\nThe major course objectives for the first semester of Junior English Composition, according to the department guidelines, read as follows: (1). To help students develop an understanding of the syntax, style, and structure of general technical/technological articles through guided reading; and (2). To familiarize students with the writing of technical/technological reports and papers.\r\nWhile embracing the essential spirit of the above guidelines, your instructor would like to begin the course with an exploration of the “what” and “how” of technical reading and writing from the perspective of English majors. A clear understanding of the scope of technical English and its role in students’ future careers should help you develop more realistic expectations of this course in which the instructor focus on helping you become a more competent and confident communicators in English writing by training your proficiency in the writing skills for PRACTICAL applications in your future career or studies that may or may not be related to technology. Close attention will also be directed to the productive uses of advanced writing tools and related online resources with the hope to expand the one-semester course into a sustainable pursuit for ongoing perfection of your English reading and writing ability.", "schedule": "Course Description\r\nThe course adopts an interactive approach to language learning by providing you with plenty of chances for guided reading and writing. Major class activities include: (1). Writing in varied forms (self-introduction, response letter, and résumé) for developing a more active attitude toward writing; (2). Guided readings of sample essays highlighting the essential style and structure of technical writing and reporting. Please be noted that the course Technical English – Guided Reading and Writing uses no textbook; instead, relevant handouts will be prepared by the instructor and e-mailed to you one week prior to the lessons begin.\r\nCourse Requirements\r\nYour taking this course signifies your agreement with the course objective and the teaching approach proposed by the instructor. Moreover, as a selective course, Technical English – Guided Reading and Writing will be taught with the underlying assumption that you are here with a strong desire to improve your reading and writing ability. The major course requirement is therefore for you to constantly demonstrate that desire through your class participation, writing assignments, and reading tasks. There will be no mid-term exam while the final will take the form of a self-evaluation. IMPORTANT NOTES: (1). All required assignments should be typed, not hand-written. (2). Late submission of assignments will be penalized by a 50% reduction in score.\r\nCourse Schedule\r\nFebruary 16 - Course Orientation – Diagnostic Test\r\nFebruary 23 - Using English-English Dictionaries – Why and How / In-Class Writing – Self-Introduction\r\nMarch 2 -\tIntroducing Online/Electronic Resources for Technical & Business Writing\r\nMarch 9 - Deconstructing and Redeveloping the Way to Write / Review of Self-Introduction & The Writing Situation\r\nMarch 16\t- In-Class Reading of “Eleven” and Practice Writing of Response Letter\r\nMarch 23\t- Lecture on Résumé Writing and Application Essays\r\nMarch 30\t- Review of Response Letter\r\nApril 6 - Review of Sample Résumés and Application Essays\r\nApril 13 - In-Class Activity on Critical Thinking\r\nApril 20\t- Review of Sample Essay\r\nApril 27\t- Identifying Typical Problem Areas in English Writing\r\nMay 4 - Correcting Typical Problems in English Writing\r\nMay 11 - \tGuided Reading I (Sample Technical Paper)\r\nMay 18 - \tGuided Reading II (Sample Technical Report)\r\nMay 25 -\tGuided Reading III (On Technical Writing)\r\nJune 1 - Guided Reading IV (On Technical Writing)\r\nJune 8 - Guided Reading V (On Technical Writing)\r\nJune 15 - Course Review & Self-Evaluation\r\n", "scorePolicy": "Grading Criteria\r\nClass Participation: 40%\r\nWriting Assignments: 40%\r\nExercises & Quizzes: 20%", "materials": "Eliot, Norbert and Herman A. Estrin. Technical Writing in the Corporate World: Understanding, Developing and Editing Technical Documents. Boston: Course Technology, 1990.\r\nGustavii, Bjorn. How to Write and Illustrate Scientific Paper. 2nd Edition. London: Cambridge, 2008.\r\nKirkman, John. Good Style: Writing for Science and Technology. 2nd Edition. London: Routledge, 2005.\r\nKirkman, Johan and Christopher Turk. Effective Writing: Improving Scientific, Technical and Business Communications. 2nd Edition. London: E & PN Spon, 1989.\r\nRogers, Silvia M. Mastering Scientific and Medical Writing: A Self-Help Guide. Berlin: Springer, 2007.\r\nSilyn-Roberts, Heather. Writing for Science and Engineering: Papers, Presentations and Reports. London: Butterworth-Heinemann, 2002.\r\nWoolever, Kristin R. Writing for the Technical Profession. 4th Edition. New York: Longman, 2008.\r\nWriting in English: A Practical Handbook for Scientific and Technical Writers. Writing in English Project Group, The European Commission Leonardo da Vinci Programme.\r\n", "foreignLanguageTextbooks": false}]