[{"name": "陳雅玫", "email": "ymchen@ntut.edu.tw", "latestUpdate": "2009-02-28 15:38:19", "objective": "This course will examine different text types and acquaint students with the techniques and methodologies available in translating these texts. Attention will not only be given to usage, but also to issues of discourse. This course is intended to prepare students for more specialized translation training.", "schedule": "Week 1\tIntroduction\r\nWeek 2\t(1) different text types and translation\r\n         (2) discourse analysis and translator\r\nWeek 3\ttranslation of scientific and technical texts\r\nWeek 4\ttranslation of scientific and technical texts\r\nWeek 5\t(1) translation of scientific and technical texts\r\n         (2) in-class translation quiz\r\nWeek 6\ttranslation of journalistic texts\r\nWeek 7\ttranslation of journalistic texts\r\nWeek 8\t(1) translation of journalistic texts\r\n         (2) in-class translation quiz\r\nWeek 9\tMid-term\r\nWeek 10\ttranslation of advertising texts\r\nWeek 11\ttranslation of advertising texts\r\nWeek 12\t(1)translation of commercial & financial texts\r\n         (2) in-class translation quiz\r\nWeek 13\ttranslation of commercial & financial texts\r\nWeek 14\t(1) translation of legal texts\r\n         (2) in-class translation quiz\r\nWeek 15\ttransation of legal texts\r\nWeek 16\ttranslation of travel brochures\r\nWeek 17\tWrap up\r\nWeek 18\tFinal exam\r\n", "scorePolicy": "(1) attendance & participation: 15%\r\n (2) translation quizzes: 30%\r\n (3) translation assignment: 30%\r\n (4) final-exam: 25%\r\n", "materials": "(1) instructor’s lecture handouts\r\n(2) selected readings from the following books:\r\n(a) main textbooks: 文體與翻譯（劉宓慶）、翻譯初階（周兆祥）、\r\n(b) references: 傳媒翻譯（鄭寶璇）、專業翻譯（周兆祥）\r\nChan, S. and D. Pollard ed. An Encyclopaedia of\r\ntranslation: Chinese-English, English-Chinese\r\n\r\nRequirements & Rules:\r\n1. Please turn off your cell phone during the two-hour class period.\r\n\r\n2. Absence: Students are expected to attend the class ON TIME. \r\n(1) Being late for more than TWENTY minutes equals one hour unexcused absence. One hour UNEXCUSED absence results in 2 points deduction. \r\n(2) For an absence to be excused, students need to submit compelling evidence of the gravity or unforseeability of the event causing the absence within ONE WEEK. \r\n(3) Students missing more than TEN hours excused or unexcused will have a fail.\r\n(4) Absence from a class is no excuse for not knowing the assignment and what has been discussed in that class. There will be NO MAKE-UP EXAM unless you have valid and official reasons for absence BEFOREHAND.\r\n\r\n3. Translation Quizzes: \r\nThere will be four in-class quizzes. Part of each quiz will cover the translation exercises discussed in the pre-readings. \r\n4. Translation Assignments: \r\n(1) All translation assignments have to be typed. \r\n(2) Each assignment goes through the following stages: (a) submission of the first draft by due date, (b) discussion of each assignment in class, and (c) submission of the final version with revision.\r\n(3) All assignments must be submitted via e-mail by 5pm Monday. For late assignments, 20% of the assignment mark will be deducted each day. Assignments more than THREE days late will not be accepted\r\n\r\n\r\n", "foreignLanguageTextbooks": false}]