[{"name": "余貞儀", "email": "cy1269@gmail.com", "latestUpdate": "2009-02-17 10:36:57", "objective": "This is a history course about western classical music, which the definition, according to The New Harvard Dictionary of Music, is ”art” or ”serious” music. The styles of the various periods will be introduced from the Medieval, Renaissance, Classical, Romantic, and the Contemporary eras.  The course is aiming to build each student's independent academic research ability in western art music and related fields. \t\r\n\r\nIn order to pursue the most accurate references and info, the major key-points and terminology used in this course will be in English or the original European text.", "schedule": "1st week: Introduction to Western Art Music\r\n2nd week: The Medieval Period--folk music and church music\r\n3rd week: Renaissance--Madrigals, church music, dance music.\r\n4th week: Renaissance--the choral music from different regions.\r\n5th week: Baroque--Louis XIV and his influence on French music\r\n6th week: Baroque--Italian and French legends--Corelli, Lully and Couperin\r\n7th week: Baroque--Italian and French legends continues--Vivaldi, Scarlatti, and Rameau\r\n8th week: Baroque--Comparison between Handel and J.S.Bach\r\n9th week: Baroque--J.S. Bach in-depth--his string works, orchestral music, choral music, keyboard music, and Fugues.\r\n10th week: Classical--Gluck and the history of Vienna--the form of the Viennese School and Haydn\r\n11th week: Classical-- Mozart and Beethoven\r\n12th week: Beethoven and the beginning of Romantic era; how Schubert was influenced by Beethoven\r\n13th week: The pinnacle of Romantic era--Chopin, Schumann, Brahms, Liszt, Tchaikovsky\r\n14th week: The late Romantic era--Mahler, Scriabin, and Rachmaninoff\r\n15th week: The Contemporary Music--12-tone music (The 2nd Viennese School), Existentialism, music of Minimalism, and experimental music.\r\n", "scorePolicy": "1. Attendance\r\n2. Learning attitude\r\n3. Class notes as a part of evaluation for both mid-term and final grades, along with a final group projects", "materials": "Internet research", "foreignLanguageTextbooks": false}]