[{"name": "房同經", "email": "nathan1@ms39.hinet.net", "latestUpdate": "2009-03-20 15:25:28", "objective": "課程的目標和基礎\r\n瞭解你的身體後，你就有力量去改變它、維護它、裝飾它、強化它。每一章開頭我們將剖析你體內某個重要器官的構造，也就是帶你進入體內，向你說明各個器官怎樣運作，以及如何互動。我們不會採用醫生的口吻，但也不會把你當作小學四年級的學生。我們會把科學簡化，變得淺顯易懂。接著，我們要告訴你如何強化器官的功能，藉以防止疾病，而且活得更年輕、更健康。我們會讓你明瞭疾病從何而起，怎樣影響你的身體，而你又能怎樣防禦和打敗病魔，以免它們威脅到你的生活品質，乃至你的生命。\r\n再拿房子作比喻，我們希望你能像維修房子一樣對身體作基本維修。如果你平常就儲備一些管子，馬桶壞了就不必去找水電工，試試進水器，掀起水箱蓋撥弄一下浮球，你就可能自行修好故障。你發現廚房裡有隻蒼蠅，當然無需勞動滅蟲專家。燈泡燒掉時，也不必找電工。你可以靠自己來控制房子的老化過程，你也知道，防範未然、及早處理小問題是最省錢的，要是任由屋子裡的東西一樣樣壞掉，最後當然只好花大錢翻修。\r\n最後，我們希望你善待自己的身體，這樣，你才有信心去做身體基本維修，才能避開有害健康的事物，去作對你身體長期有益的事。\r\n", "schedule": "時逢二十一世紀後基因時代的來臨，疾病的治療已非生命過程中最重要的議題；健康的促進、活力的增強及生活品質的提升，才是普受關切的焦點。由於資訊科技的突飛猛進、日新月異，以及各種傳播媒體的蓬勃發展，醫學知識的獲得變得快速便捷。因此，預防保健與健康管理的觀念已逐漸深植於社會各階層民眾的心中。\r\n三大特色：\r\n一、\t學習常見及有趣的醫學健康問題，有益身心健康。\r\n二、\t深入淺出的圖解與比喻兼顧的描述。\r\n三、\t以現今崛起的「系統生物學」之新思維來整合不同學門領域的前瞻性醫  學知識，並作整體分析，以解答疑難雜症及提出有益於預防保健的建議，可作為「個人化健康管理」之參考與依據。\r\n內容所涵蓋的層面與層次希望能「廣博精深」之境，學習者從中當可獲得「自我健康管理」之醫學知識，對促進身心健康，增強活力，延齡益壽有莫大的助益。\r\n課程內容\r\n一、身體就像房子\r\n身體和家的相似之處，比雙胞胎還要多。我們的骨架支撐著房子(身體)的內部結構；眼睛是窗子；肺是通風管；腦子是開關及保險絲盒；腸是管線系統；心血管是自來水幹管；脂肪是你的貯存閣樓、裡面是你的另一半的不停嘮叨要你清除掉的廢物。\r\n二、心臟和動脈\r\n某天深夜，知名電視節目主持人心絞痛 (Angina) 心臟病突發卻不自知。他覺得左肩疼痛，並有強烈的疲倦感，但完全不認為是心臟病發作。朋友開車送他去醫院途中，他還抽了根菸。Angina的狀況也有可能發生在你身上。大約三分之一死於心臟病的人，第一次發病就是最後一次。\r\n三、腦子和神經系統\r\n有些女人喜歡說，男人用某處思考。這我們不太瞭解，但我們知道腦子和某處至少有一點是相同的：尺寸並非一切。腦子的尺寸純粹來自遺傳，不代表你的智慧。事實上，愛因斯坦的腦子只有一．二公斤重，比平均值整整小了一成。\r\n四、骨骼、關節和肌肉\r\n即使你的骨頭現在摸起來像支鋼樑，而不像根牙籤，但未來的變化是會讓你吃驚的，也會大大影響我們的老年生活。舉例來說：如果你無法自行從馬桶上站起來，那麼，就算你有阿姆斯壯的心臟或愛因斯坦的腦子，也將毫無意義。\r\n五、肺及呼吸\r\n在一生中，有三個時間點你會想到呼吸問題：當聞到很臭的味道時（比如泰國菜裡的醬蝦）；當呼吸處於危急狀態時，（比如被大蟒蛇纏繞）；當喘個不休時（比如新婚之夜）。在其他時間裡，呼吸這椿事就像歌手伍佰的伴舞女郎，不太引人注意。\r\n六、消化系統\r\n糞便入水時最好能像奧運跳水冠軍，不會濺起水花。你聽到的聲音應像投入了空心球（唰！）而不是機槍聲（噗噗噗噗噗噗噗！）。最理想的是當它入水的剎那，另一端仍藕斷絲連。\r\n七、生殖系統\r\n假使把陰莖比作車子，陰道就是車庫。但如果車子在車道上拋錨，就進不了車庫。如果車庫的門關上，情形也一樣。你需要力量來達成水乳交融。對男人和女人（尤其是男人）來說，沒有高品質的血液流通，就難成其好事，而打頭陣的是吸引力。\r\n八、感覺器官\r\n當你切洋蔥、觀賞悲劇，或是自己擁戴的王建民打輸時，你不禁會淚眼汪汪；但如你所知，淚腺還負責濕潤你的眼睛。常見的乾眼症，是淚腺分泌液體不足所致。最好的治療方法，不是再看一場「鐵達尼號」，而是多喝水，整天保持水分。\r\n九、免疫系統\r\n肥皂和水能洗掉手上的細菌，等你用手摸嘴巴和鼻子時，就不會有細菌進入。有時候未必找得到地方洗手，不妨在車子、皮包或公事包裡放抗菌凝膠，只要抹上一個銅板大小的份量，就能把細菌殺死。\r\n十、荷爾蒙和內分泌\r\n說到荷爾蒙，大家多半只會聯想到血氣方剛的少年郎、明星的海報。其實，荷爾蒙參與了我們所做的每件事，包括如何處理壓力、吸收脂肪、生小孩等等。如果荷爾蒙錯亂，結果會很可怕。\r\n十一、 地獄細胞：癌\r\n自由基是單個或一群帶電原子，會改變細胞、蛋白質和DNA的化學結構、使之受損。抗氧化物最大的功用就是把自由基銬起來、打包，再透過腎臟把它們給沖出體外，不讓它們破壞細胞和染色體。\r\n十二、 最有益健健的食譜\r\n健康食譜設定的目標，不在你能減輕幾公斤，而在延年益壽，增加活力，所以份量是足夠的，不會教你挨餓。\r\n", "scorePolicy": "期中考 40%\r\n期末考 40%\r\n討論及報告 20%", "materials": "　", "foreignLanguageTextbooks": false}]