[{"name": "張詠翔", "email": "shawnchang@ntut.edu.tw", "latestUpdate": "2017-12-11 11:09:52", "objective": "此堂課將透過傳統和現代影像技術，來探討語音產生過程之構音動作。學生需檢視母語人士之構音變異性，並且對照非母語人士的構音方式 。構音變異探討將提供考慮第二語言發音教學或語音治療相關產業工作及應用之學生良好的基礎。\r\nWe will explore speech articulation through both traditional (palatograms, linguograms, and video imaging) and modern (ultrasound imaging) technologies. This course meets for both lecture and laboratory work. We will study and compare the articulatory variation in native and non-native speech (where similar variation, or non-native deviation may be observed). The variation and deviation in speech will be discussed in the context of second-language speech production. This training provides a solid foundation for careers in speech pathology and teaching pronunciation.", "schedule": "A detailed syllabus will be given on the first day of class.", "scorePolicy": "‧\tParticipation 30%: Students are expected to actively participate in classroom discussion and group activities. The laboratory part of this course consists principally of hands-on work (i.e., collection and annotation of acoustic/articulatory data). The end project of the laboratory work will be a mini articulatory corpus. \r\n‧\tAttendance 10%: It is crucial that students attend every class session. Two points of the final grade will be taken off for each absence. After five absences, you lose all the ten points of your final grade that attendance accounts for. You will also be graded down in the participation component of the final grade if you continue to miss classes. A hard copy of the officially approved leave sheet is required if you have missed (or will miss) a class due to illness, family emergency, etc.  \r\n‧\tIndividual homework: 20% At the end of each course meeting, a list of discussion questions, based on the reading due the following week, will be made available online. Students will need to submit their responses via Google Forms before the next course meeting. \r\n‧\tGroup project 40%: Towards the middle of the semester, each group has to meet with the instructor to discuss a possible project topic. Group members will have to design stimuli to answer the raised research questions. At the end of the semester, students will give an oral presentation, which accounts for 20%. The quality of the annotated acoustic and articulatory data accounts for the other 20% of the grade.", "materials": "1) Gick, B., Wilson, I., & Derrick, D. (2013). Articulatory Phonetics. Oxford: Wiley-Blackwell. \r\n2) Ladefoged, P. (2005). Phonetic Data Analysis: An Introduction to Fieldwork and\r\nInstrumental Techniques. Oxford: WileyBlackwell.\r\n3) 童寶娟 (2016)。華語構音與音韻障礙學(第二版).華騰文化股份有限公司。", "foreignLanguageTextbooks": true}]