[{"name": "林逾先", "email": "line@ntut.edu.tw", "latestUpdate": "2015-08-27 17:55:25", "objective": "本課程教導學生在管理領域內英文的運用，學生將在本課程裡學習到:\r\n(1)個人英文履歷表的撰寫，(2) 英文會議資料如：議程、動議、記錄等的準備，(3)英文正式文件及電子郵件的撰寫，(4) 英文計劃書與手冊的編寫，(5)管理常見之英文專有名詞的正確用法，及(6) 現代化全球管理的英文專題。學生必須在課堂上就選定的管理題材以英文做簡報及討論。\r\nThis course teaches students the use of English within the context of management. Students are expected to learn the followings in English: (1) Write-up of personal curriculum vitae; (2) Preparation of meeting materials such as agenda, motions, minutes, etc.; (3) Appropriate style and writing of official business documents and electronic mails; (4) Development of business proposals and manuals; (5) Correct use of English terminologies in management and (6) Contemporary issues and trend in global management communities. Students are required to make individual presentation with class discussion on the selected management topics in English.", "schedule": "9月16日     \t發給課程大綱及相關資料\r\nSeptember 16\tDistribution of course outlines and relevant materials\r\n    9月23日     \t個人英文履歷表的撰寫\r\n September 25\tWrite-up of personal curriculum vitae\r\n    9月30日     \t會議議程的準備，動議的提出與表決; 會議記錄撰寫\r\n September 30\tPreparation of meeting agenda, moving and voting on\r\n\t\t        a motion; Write-up of meeting minutes\r\n  10月07日    \t企業計劃書的編寫\r\n October 07\tPreparation of a business project proposal\r\n 10月14日      \t英文正式文件及電子郵件的適當寫法\r\n October 14\tAppropriate style of writing for business English\r\n\t\t\tdocuments and electronic mails\r\n  10月21日     \t管理專有名詞的正確用法\r\n October 21\tCorrect use of management terminologies\r\n 10月28日    \t現代化全球管理相關英文專題探討 (一)\r\n October 28\tDiscussion on the contemporary management topics on\r\n\t\t\tglobal issues (I)\r\n   11月04日    \t現代化全球管理相關英文專題探討 (二)\r\n November 04\tDiscussion on the contemporary management topics on\r\n\t\t\tglobal issues (II)\r\n   11月11日    \t期中考\r\nNovember 11\tMid-term examination\r\n  11月18日     \t管理議題個人隨堂英文口頭報告 (一)\r\nNovember 18\tIndividual class impromptu oral presentation on a\r\n\t\t\tmanagement topic in English (I)\r\n  11月25日      \t教師公務出國 (停課)\r\nNovember 25\tInstructor out of the country on business (No class)\r\n  12月02日    \t管理議題個人隨堂英文口頭報告 (二)\r\nDecember 02\tIndividual class impromptu oral presentation on a\r\n\t\t\tmanagement topic in English (II)\r\n  12月09日    \t管理專題個人課堂英文簡報 (一)\r\nDecember 09\tIndividual class presentation on a management topic (I)\r\n  12月16日    \t管理專題個人課堂英文簡報 (二)\r\nDecember 16\tIndividual class presentation on a management topic (II)\r\n  12月23日   \t教師公務出國 (停課)\r\nDecember 23\tInstructor out of the country on business (No class)\r\n  12月30日    \t管理專題個人課堂英文簡報 (三)\r\nDecember 30\tIndividual class presentation on a management topic (III)\r\n  1月06日    \t管理專題個人課堂英文簡報 (四)\r\n January 08  \tIndividual class presentation on a management topic (IV)\r\n 1月13日    \t管理專題個人課堂英文簡報 (五)\r\nJanuary 15 \tIndividual class presentation on a management topic (V)", "scorePolicy": "課堂出席   \t          Class attendance\t                        10%\r\n個人隨堂口頭報告   Individual class impromptu report\t10%\r\n個人課堂專題簡報\t  Individual class presentation\t         30%\r\n隨堂測驗   \t          Quizzes\t                                         10%\r\n期中考試\t                  Mid-term examination\t                 40%", "materials": "本課程將採用教師在課堂上所發給之教材與講義。\r\nThis course will adopt the teaching materials handed out in the class by instructor.", "foreignLanguageTextbooks": false}]