[{"name": "樊學良", "email": "sam.fan@gmail.com", "latestUpdate": "2015-09-09 11:47:49", "objective": "一、課程說明及教學目標\r\n\r\n本課程為初階課程共計三學分，適合具備基本管理學相關知識的學生選讀，跨系所學生也非常歡迎。本課程教學目標如下：\r\n\r\n1.培育學生具備人力資源管理基本素養，學生得以在未來職場協助企業善用和員工相關的資源，協助員工發揮個人潛能，提升組織效能。\r\n2.透過實際演練和操作，熟悉人力資源管理之相關技能，這些技能包括了：優秀的口語表達及摘要簡報能力、人際溝通與團隊合作的技巧、創意思考的技巧，以及甄選、面談和績效評估的技巧等。\r\n3.綜合運用課程所學，能對組織的人力資源管理實務做基本診斷。\r\n4.經由本課程，學生能自我期許為專業的人力資源管理人員，並將課程所學運用在日常生活當中。\r\n\r\n二、教學方法：教師講授、影片觀賞、個案研討、團體活動、團體討論、團體表演、角色扮演等方式進行。", "schedule": "第1週\t9/18\t課程簡介：為什麼要學人力資源管理？\r\n第2週\t9/25\t人力管理之基礎：人力規劃及策略管理觀點/ 作業1\r\n第3週\t10/2\t企業發展與人力資源規劃/作業2\r\n第4週\t10/9\t停課（國慶日連假）\r\n第5週\t10/16\t人際溝通與團隊合作工作坊/決定分組名單\r\n第6週\t10/23\t工作分析與人力招募活動/作業3\r\n第7週\t10/30\t人力甄選與測試面談作業 （團體作業1：模擬面試）/作業4\r\n第8週\t11/6\t企業員工訓練與才能發展（團體作業2：企業訓練或人力資源發展課程一覽）\r\n第9週\t11/13\t設計思考工作坊（主題：如何吸引東協印度管理人才？）\r\n第10週\t11/20\t個案討論（員工績效評估與績效管理/團體作業3）\r\n第11週\t11/27\t印象管理：修飾你面試的妝容、服儀（知名彩妝老師和企業高階主管協助學生調整）/作業5\r\n第12週\t12/4\t個案討論(職涯管理) /團體作業4\r\n第13週\t12/11\t企業倫理、勞資關係、內部創業與人管\r\n第14週\t12/18\t幸福企業分析/作業5\r\n第15週\t12/25\t幸福企業分析/作業5\r\n第16週\t1/1\t停課（元旦）\r\n第17週\t1/8\t期末考\r\n第18週\t1/15\t停課（校慶補假）\r\n\r\n備註：課程進度及內容將依學生學習情況調整，必要時將邀請企業人士進行專題演講。", "scorePolicy": "一、課堂參與 (含課程參與情形、課前心智圖小測驗成績)\t20%\r\n\r\n課前「心智圖」測驗：老師會根據每週課程進度，參考教課書內容，提出數個核心概念，請學生繪製心智圖（mind mapping）來描述核心概念間的關係。心智圖測驗也包含了「點名」的功能，會影響學期成績，無法出席者需事先請假，並提出充分的理由。\r\n\r\n二、四份團體作業 20%\r\n\r\n團體作業1：模擬面試\r\n\r\n以表演方式進行，各組首先需從組員所嚮往之企業名單中挑選一家企業為假想企業。之後，其中一半組員扮演面試官，另一半扮演應試者。面試的方式（一對多、多對多、多rounds）、細節等等請發揮小組創意（但不能偏離企業實際情形），最好能具有學理原則。面試問題以釐清申請人履歷為優先，之後才可向外延伸，例如考驗面試人隨機應變的能力或創造力。其他尚未上台表演的同學，則擔任評審的角色，評審的目的在於協助表演人檢討面試過程的各項技巧。\r\n\r\n團體作業2：企業訓練或人力資源發展課程一覽\r\n\r\n以華人社會（台灣、中國、香港、新加坡等）為對象，蒐集以職場人員為主的企業訓練或人力資源發展課程，藉此瞭解實務界推動員工訓練的實際情形（至少20門課程），內容應至少包括：課程名稱、授課對象、授課時數，以及課程目標或教學內容、費用等。老師將搭配學生報告內容，說明課程設計背後的學理原則，若時間許可則帶領同學演練。學生未來進入職場後，將對如何設計或選擇適當的課程有所瞭解。\r\n\r\n團體作業3、團體作業4\r\n\r\n本課程將有兩次個案討論，每組需針對指定個案，撰寫2頁分析報告（12字體、單行距、不需封面），內容為「回答個案內的討論問題」。\r\n\r\n三、五份個人作業 15%\r\n\r\n搭配每週課程進度，學生共有五份個人作業。若能依照進度認真撰寫作業，學期結束後，學生將對人力資源管理的內涵有一完整瞭解（一頁A4、12字體、單行距、不需封面）。\r\n\r\n作業1：找你所愛（找到你心目中所嚮往的、未來想去任職的任何企業2-3家，摘要介紹企業概況和你選擇的理由）\r\n\r\n作業2：前述公司如何進行核心優勢相關人才的人力資源規劃與發展？\r\n\r\n作業3：前述公司所需人才之能力分析和招募策略\r\n\r\n作業4：想像你將要應徵你所嚮往的公司，請你整理個人CV（最多兩頁A4），老師會於學期末修改後發還給同學。\r\n\r\n作業5：就職前準備，請你在上課當天著面試服儀（女帶妝），老師將會邀請知名彩妝老師和企業高階主管協助學生調整定位，為你提升未來就業優勢。\r\n\r\n\r\n四、幸福企業診斷（團體作業）\t35%\r\n\r\n1.以知識密集、創意導向或服務導向的企業（如：Google、Apple、facebook、時尚業、好萊塢產業等），或華人企業典範為對象，完成一份個案分析報告，或企業實務分析（或診斷）報告書面。\r\n2.分析或診斷的重點著重在「招募甄選」、「績效評估與管理」，評論時最好有學理基礎，並能提出具體改善建議。\r\n3.書面報告十頁以內（不含附錄），之後需在課程中進行口頭報告；\r\n4.評分標準：「分析深入程度」、「觀點的獨特性」、「口語表達及簡報能力」。\r\n5.報告小組需接受其他組的評論與評鑑。\r\n\r\n\r\n五、同儕評鑑：學期末同儕互評成績\t10%", "materials": "1.吳秉恩/審校（2013）。人力資源管理：理論與實務。台北市：華泰書局。（主要教材）\r\n2.李誠主編（2012）。人力資源管理的12堂課（第四版）。台北：天下文化出版社。\r\n3.教師自編講義、中文個案、補充教材。\r\n(1)「今日人資長，明日執行長？」，2014/12 哈佛商業評論\r\n(2)「三顧茅廬聘教授，打造諾貝爾獎搖籃」，2015/9，遠見雜誌\r\n4.教育訓練有關的電影、參考文獻：捍衛戰士、魔鬼諜報員、CIA 追緝令、魔鬼女大兵 G.I. JANE、全面啟動、煞不住、魔球、杜拉拉升職記、實習大叔。\r\n(1)黃麗秋（2015/9/9）。團隊學習體驗：先不想怎麼贏先想怎麼玩。能力雜誌，257。\r\n(2)夏業良、魯、江麗美（2013翻譯）。體驗經濟時代（十週年修訂版）：人們正在追尋更多意義，更多感受（The Experience Economy, Updated Edition）。台北市：經濟新潮社。\r\n5.知識密集、創意導向或服務導向企業的人力資源管理參考文獻\r\n(1)連育德（2015翻譯）。Google超級用人學：讓人才創意不絕、企業不斷成長的創新工作守則（Work Rules! Insights from Inside Google That Will Transform How You Live and Lead）。台北市：天下雜誌。\r\n(2)The Economists (2014, Nov. 1). Creative capitalism：Other industries have a lot to learn from Hollywood（創新資本主義時代，其他產業要多跟好萊塢學習，例如：如何管理公司內的超級明星？）.\r\n(3) wangkumi （2013.12.18）。人才是企業的重要資產：Toyota 和 Pixar 如何營造適合員工發展的工作環境？ TechOrange\r\n(4)風傳媒（2015.8.16）。你是國際人才嗎？矽谷科技業高階主管為何印度裔遠多於華裔？", "foreignLanguageTextbooks": false}]