[{"name": "施欣文", "email": "sharinschroeder@ntut.edu.tw", "latestUpdate": "2015-09-17 19:37:05", "objective": "COURSE OVERVIEW\r\n\t \r\nThis course aims at providing students with the fundamental knowledge and competence that they will need in doing research and writing research papers using the MLA style. Its main purpose is to familiarize students with methods, procedures, and techniques that are applicable to quantitative and qualitative research as well as to improve their ability to write research papers. The main topics for instruction include: the research process; major research methods; and the structure of a research paper. The research methods primarily studied include the experimental method, descriptive research, ethnography, case study, observation, survey research (questionnaire and interviews), content analysis/documentary analysis, and critical approaches to literature.", "schedule": "Please see the hard copy of the syllabus for specific assignments. You will be reading chapters from Writing Research Papers and from the course packet and taking reading quizzes on this material. You will be doing one group presentation over a chapter from Writing Research Papers, and you will write an extended research proposal with an annotated bibliography.", "scorePolicy": "GRADING AND OTHER POLICIES\r\n\r\nGrade Percentages:\r\nPresentation: 20%\r\nQuizzes: 20%\r\nAssignments: 30%\r\nProposal and Annotated Bibliography: 20%\r\nParticipation: 10%\r\n\r\nI may modify these grade weights at my discretion. If I do so, I will let you know. \r\n\r\nGrading Criteria:\r\n\r\nA\tSuperior work. Achievement that is outstanding relative to the level necessary to meet course requirements.\r\n\r\nB\tAchievement that is significantly above the level necessary to meet course requirements.\r\n\r\nC \tAchievement that meets the course requirements in every respect. \r\n\r\nD \tAchievement that fails to meet fully the course requirements. \r\n\r\nF \tAchievement that is not worthy of credit. The only way to outright fail this course is through lack of effort. The student may not participate in classroom work. Assignments are either (a) completed but not completed at a level of achievement that is not worthy of credit; (b) frequently late, thereby lowering the grade too significantly to give the student a chance to pass; or (c) never completed at all.", "materials": "TEXTS\r\n\r\n‧\tLester, James D. and James D. Lester, Jr. Writing Research Papers: A Complete Guide.15th ed. Boston: Pearson, 2015. Print. \r\n‧\tCourse Packet and/or e-mailed readings and handouts. Please print these. \r\n\r\nSUPPLIES\r\n‧\tA journal, pens, and loose-leaf paper for in-class writing and quizzes\r\n‧\tA dry-erase marker and a cleaning cloth", "foreignLanguageTextbooks": false}]