[{"name": "劉秋蘭", "email": "pclliu@ntut.edu.tw", "latestUpdate": "2012-05-13 16:51:59", "objective": "美學與藝術類經典是珍貴的世界遺產，是人類文化不朽的標記。無論東方或西方，舉凡任何領域的活動，皆有經典。經典之所以為經典，在於其揭示出永恆的理念，讓人不斷傳承，成為我們思慮云為的起跑點。經典的理念，超越時空限制，具有不可磨滅的參考價值。\r\n本課程旨在教導學生閱讀美學的重要經典，並藉著介紹相關時期的藝術品（畫作或建築物等），幫助學習者有系統地瞭解該經典的內涵。因為經典的普世通達，讓我們得以運用共同認知的思想，建立與人溝通的基礎路徑；因為經典的先見之明，讓我們得以運用崇高的智慧，檢視自己，照見生命旅程之中的每一個腳步。", "schedule": "第一週 課程介紹+Les cinq grandes familles de theories de l’art : la phenomenology de l’art, La psychologie de l’art, La sociologie de l’art, Le formalism, L’analyse structurale\r\n第二週 Les théories de l’art dans l’Antiquité : Platon, Aristote, Plotin, \r\n第三週 同上\r\n第四週 La Renaissance : Cennino Cennini, Leon Battista Alberti, Léonard de Vinci, Giorgio Vasari, Albrecht Durer\r\n第五週 同上\r\n第六週 Classicisme et baroque au XVIIe siècle : Nicolas Poussin, Roger de Piles\r\n第七週 同上\r\n第八週 Le néoclassicisme e tla description des oeuvres au XVIIIe siècle : Johann Joachim Winckelmann, Denis Diderot\r\n第九週 同上\r\n第十週 Le Romantisme : Eugène Delacroix, Charles Baudelaire, John Ruskin \r\n第十一週 同上\r\n第十二週 Les historiens de l’art héritiers de l’esthétique allemande : Emmanuel Kant, Georg Wilhelm Friedrich Hegel, Arthur Schopenhauer, Friedrich Nietzsche, Aloïs Riegl, Heinrich Wölfflin, Aby Warburg, Erwin Panofsky, \r\n第十三週 Les théories psychanalytiques de l’art : Sigmund Freud\r\n第十四週 同上\r\n第十五週 Les théoriciens de l’art contemporains : Pierre Francastel, Meyer Schapiro, Sir Ernst Gombrich\r\n第十六週 同上\r\n第十七週 La situation actuelle : entre l’excès et l’absence de théorie de l’art\r\n第十八週同上", "scorePolicy": "評量一：平時成績 20%\r\n評量二：讀書心得報告 15%\r\n評量三：期中報告 20%\r\n評量四：期末報告 45%", "materials": "參考書目：\r\n1. Chalumeau (Jean-Luc), Les théories de l’art. Paris, Vuibert, 2004.\r\n2. Chalumeau (Jean-Luc), La Lecture de l’art. Paris, Vuibert, 2002.\r\n3. Diderot, Salons. \r\n4. Eco (Umberto), Histoire de la Beauté. Paris, 2003.", "foreignLanguageTextbooks": false}]