[{"name": "朴維鎮", "email": "eugenepark993@gmail.com", "latestUpdate": "2020-02-13 14:58:16", "objective": "The purpose of this course is to train the students who can be familiar with the statistics approaches and theories. Besides, they will be able to employ the collected data to analyze the unknown environments. The course includes probability theory, testing, regression analysis and variance analysis.", "schedule": "Week 1\tIntroduction to probability distribution, sampling distribution, and estimation\r\nWeek 2\tDecision making for a single sample – Estimation, hypothesis testing, inference on the mean of a population\r\nWeek 3\tDecision making for a single sample – Inference on the variance of a normal population, inference on a population proportion, goodness of fit test\r\nWeek 4\tDecision making for two samples – Inference on the means of two populations, paired t-test\r\nWeek 5\tDecision making for two samples – Inference on the ratio of variances of two normal populations, inference on two population proportions\r\nWeek 6\tSimple linear regression – Part I\r\nWeek 7\tSimple linear regression – Part II\r\nWeek 8\tOther aspects of simple linear regression\r\nWeek 9\tMidterm exam (In-Class, 1 Cheat Sheet, Calculator)\r\nWeek 10\tMultiple linear regression – Part I\r\nWeek 11\tMultiple linear regression – Part II\r\nWeek 12\tOther aspects of multiple linear regression\r\nWeek 13\tFactorial design, replication, center points – Part I\r\nWeek 14\tFactorial design, replication, center points – Part II \r\nWeek 15\tBlocking, confounding, fractional factorial designs X-bar and R control chart\r\nWeek 16\tFactorial experiments with more than two levels\r\nWeek 17\tIntroduction to control charts\r\nWeek 18\tFinal exam (In-Class, 1 Cheat sheet, Calculator)", "scorePolicy": "1. Midterm Exam: 30%\r\n2. Final Exam: 30%\r\n3. Team project: 15%\r\n4. Homework: 20%\r\n5. Attendance: 5%", "materials": "Engineering Statistics (5th Ed., Wiley) by Montgomery, Runger, and Hubele (ISBN: 978-0-324-59433-1)", "foreignLanguageTextbooks": true}]