[{"name": "郭為中", "email": "", "latestUpdate": "2020-02-05 21:20:03", "objective": "本課程主要教導學生認識建築物理環境之控制原理與應用技術，包含光環境、溫熱環境、空氣環境、音環境等，做為學習建築環境控制系統與建築設備之基礎。本課程內容分為五大部分，包括(一)永續建築與評估系統概述、(二)建築環境量測系統介紹、(三)建築節能計畫、(四)室內環境品質計畫、(五) 專題演講或實務案例參訪。\r\n本學期特色為介紹物理環境控制技術外，同時輔以量測儀器觀摩或操作，及專題演講或實務案例參訪，幫助學生在建築設計中能依據其控制原理，針對不同類型建築物提出最適化之規劃、設計，使其建築設計符合永續、健康建築環境之原則。\r\nIn this course, students will learn about the principles of control and application techniques of architecture physics which include luminous environment, thermal environment, air environment, and sound environment as an introduction to understanding Systems of Environment Control and Architectural equipment. The course is divided into 5 sections, (1) Summary on sustainable architecture and the systems of evaluation, (2) Introduction on the measurement systems of architectural environment, (3) Building energy conservation plan, (4) Indoor environmental quality plan, (5) Themed lectures or site visits.\r\n   In this semester, other than the introduction of techniques on physical environment control,  the operation of measuring instruments, themed lectures and site visits will also be incorporated to assist students in the application of environmental control theories into their architectural designs. Allowing them to be able to plan and design while given different types of architecture, m", "schedule": "第1週---課程介紹與解說。\r\n第2週---建築物佈局與日照。\r\n第3週---環境共生住宅。\r\n第4週---音環境。\r\n第5週---電腦應用軟體簡介。\r\n第6週---實務案例參訪(1)。\r\n第7週---專題演講(1)。\r\n第8週---期中報告。\r\n第9週---期中考試。\r\n第10週--綠建築評估。\r\n第11週--智慧綠建築。\r\n第12週--光環境之室內照明。\r\n第13週--照明應用軟體操作。\r\n第14週--實務案例參訪(2)。\r\n第15週--導光管系統簡介。\r\n第16週--專題演講(2)。\r\n第17週--期末報告提交與討論。\r\n第18週--期末考試。", "scorePolicy": "平時成績--25%\r\n期中考試(含報告)--30%\r\n期末考試(含報告)--45%", "materials": "賴榮平、林憲德、周家鵬，建築物理環境，台北，六合出版社，1991。\r\n王錦堂，建築應用物理學，台北，台隆書店，1992。\r\n周鼎金，建築物理，台北，旭營文化，1999。", "foreignLanguageTextbooks": false}]