[{"name": "黃慧禎", "email": "", "latestUpdate": "2020-03-06 15:06:45", "objective": "國文，是運用本國語言文字，蘊釀於欣賞文藝作品，充實文化內涵，增進思維能力與人文素養的一門課程。\r\n本課程分為大一上學期2學分，大一下學期2學分。大一上學期的授課內容，以語言和文學為範圍；希望藉此擴建學生深入品味文學趣味的能力，鍛鍊靈活的語文敏感度，默契文學創意，甚而嘗試創作。大一下學期的授課內容，以思想名篇為範圍；希望藉此啟發學生透轍分析各家學說思想，漫步哲人的宇宙天地，跟隨哲人的心路歷程，進而念茲在茲，從容內化，共饗取之不盡用之不竭的先驗與風範。\r\nThis course that uses the national language to enrich the literary and artistic works, enrich the cultural connotation, and enhance the thinking ability and humanistic quality.\r\nThe course is divided into 2 credits for the first semester and 2 credits for the next semester. The content of the first semester of the freshman year is based on the language and literatures . It is hoped that  will expand the students' ability to deeply appreciate the taste of literature, exercise flexible language sensitivity, tacitly understand literary creativity, and even try to create. The content of the lectures in the next semester is based on the ideological and famous articles. I hope to inspire students to analyze the ideas of various theories, to walk through the universe of the philosophers, to follow the journey of the philosophers, and then to read and understand. Take advantage of the inexhaustible a priori and demeanor.", "schedule": "一、課程介紹\r\nCourse Introduction\r\n二、情境華語學習  \r\nSituational Chinese learning\r\n三、情境華語學習  \r\nSituational Chinese learning\r\n四、情境華語學習  \r\nSituational Chinese learning\r\n五、情境華語學習  \r\nSituational Chinese learning\r\n六、情境華語學習  \r\nSituational Chinese learning\r\n七、情境華語學習  \r\nSituational Chinese learning\r\n八、情境華語學習  \r\nSituational Chinese learning\r\n九、情境華語學習  \r\nSituational Chinese learning\r\n十、期中評量\r\nInterim  test\r\n十一、期中評量 \r\nInterim  test \r\n十二、情境華語學習  \r\nSituational Chinese learning\r\n十三、情境華語學習  \r\nSituational Chinese learning\r\n十四、情境華語學習  \r\nSituational Chinese learning\r\n十五、情境華語學習  \r\nSituational Chinese learning\r\n十六、情境華語學習  \r\nSituational Chinese learning\r\n十七、期末評量\r\nFinal test \r\n十八、期末評量\r\nFinal test", "scorePolicy": "平時成績（百分六十）：出席（百分二十。以當場點名為計，逾時不候。）、課堂活動（百分二十）和學習態度百分二十）\r\n期中成績：（百分二十）\r\n期末成績：（百分二十）\r\nOrdinary results (60%) : Attendance (20% According to the name of the spot,no waiting.), classroom activities (20%) and learning attitude (20%）\r\nInterim grade : 20%\r\nFinal grade : 20%\r\n\r\n備註：因武漢疫情之故，因此針對 1.暫緩來台 2.因防疫而隔離 3.未來可能確診就醫之學生，教師視疫情影響可能調整講授內容、教授方式、評量方式及配分比例。講授內容和方式改由教師提供資料，學生先自行學習後，錄下教師所指定的說讀部分錄音繳交（50分）及完成教師所出的一份考卷（50分），來達成本學期成績的評比。\r\nPs : Due to the epidemic situation in Wuhan, for the purpose of 1. Suspended coming to Taiwan 2. Isolation due to epidemic prevention 3. For students who may be diagnosed in the future, teachers may adjust the content of teaching, teaching methods, evaluation methods and allocation ratios depending on the impact of the epidemic situation. The teaching content and method are changed by the teacher to provide materials. After the students learn by themselves, record the recording (50 %) of the speaking and reading part designated by the teacher and complete a test paper (50 %) by the teacher to achieve the cost semester results Rating.", "materials": "Yang Yi hui \"Easy to learn Chinese\" / 楊琇惠《華語趣味成語》 \r\nMandarin Training Center National Taiwan Normal University  \"A Course in Contemporary Chinese / 國立台灣師範大學國語教中心《當代中文課程》", "foreignLanguageTextbooks": false}]