[{"name": "陳怡靜", "email": "sweetprettylover@gmail.com", "latestUpdate": "2020-01-02 17:02:26", "objective": "This class is for the students who are foreigners and the Chinese level is basic. There is 2 sections for this basic class. First section, we had learned the basic Hanyu pinyin and daily conversation. Students might achieve the level of A1. In this semester, let's head to A2. Daily conversation is getting complicated and we need to bring them in real life. Of course, we need to read some simple texts, expand more vocabulary, writing and listening are the skill should to be trained a lot. Students need to practice hard in class and in private.", "schedule": "week 1 introduce and review\r\nweek 2 review(bring your handouts which I assigned last semester)\r\nweek 3 vocabulary expand and grammar\r\nweek 4 vocabulary expand and grammar\r\nweek 5 number and daily life (list, buy a ticket, make a phone call, discount )\r\nweek 6 number and daily life (list, buy a ticket, make a phone call discount)\r\nweek 7 dress/ makeup and colors\r\nweek 8 dress/ makeup and colors\r\nweek 9 midterm exam\r\nweek 10 direction, location, place and map \r\nweek 11 direction, location, place and map \r\nweek 12 7-11 adventure\r\nweek 13 see a doctor\r\nweek 14 see a doctor\r\nweek 15 go to bank\r\nweek 16 go to bank\r\nweek 17 final presentation\r\nweek 18 final presentation", "scorePolicy": "attendance(inc. attitude) 20%\r\nquiz and assignments 30%\r\nmidterm exam 20%\r\nfinal presentation 30%\r\nspeaking is necessary in class\r\nwill select 3~5 students for small conversation before 5 mins of class dismissed.\r\nYou can bring any Chinese texts to class for discussing.", "materials": "download an app Pleco and pinyin input\r\nmini white broad and white broad pen for practice writing\r\nhandouts will be assigned in class\r\ntextbook are 當代中文1,2聯經出版社/實用華語單句書 楊琇惠五南出版/integrated Chinese lvl2 Cheng & Tsui Company/ 華語文閱讀測驗初級篇 楊琇惠 五南出版\r\nChinese texts from daily life\r\nFriends of you can help you upgrade your Chinese level", "foreignLanguageTextbooks": true}]