[{"name": "白俊恩", "email": "allenbalaz@gmail.com", "latestUpdate": "2019-12-22 12:47:53", "objective": "This course is designed to strengthen the English skills that participants have as indicated by their diagnostic essays and descriptive sentence writing. The schedule outlined below can be amended to better fit the class needs as indicated by their diagnostic work.\r\n\r\nThe focus on the course is on current students abilities relative to the demands that the various forms of the TOEIC place on test takers.\r\n\r\nThis course should ideally be taken by those who have already taken the TOIEC test and want to strengthen the skills their experience has shown them they need to improve or by those who plan to take the TOEIC in the next 6-12 months.", "schedule": "Week 1 Intro to the class – organization, grading, overview of TOEIC and TOEIC grading policies; Diagnostic essay writing & descriptive sentence writing\r\nWeek 2 feedback on essays; Unit 2 Relative Clauses\r\nWeek 3 Discussion of homework\r\nWeek 4 Unit 3 Participles\r\nWeek 5 Discussion of homework\r\nWeek 6 Unit 4 Appositives\r\nWeek 7 Discussion of homework\r\nWeek 8 Unit 5 Absolutes\r\nWeek 9 MIDTERM EXAM\r\nWeek 10 feedback on midterms; Unit Coordination & Subordination\r\nWeek 11 Discussion of homework\r\nWeek 12 Unit 7 Prepositional & Infinitive phrases\r\nWeek 13 Discussion of homework\r\nWeek 14 Unit 8 Noun Substitutes\r\nWeek 15 Discussion of homework\r\nWeek 16 Unit 9 Paragraph Cohesion\r\nWeek 17 Discussion of homework\r\nWeek 18 FINAL EXAM", "scorePolicy": "written midterm exam = 30%\r\nwritten final exam = 30%\r\nin-class participation -- doing the tasks, asking questions in class or by email, downloading the teacher-provided pdfs, studying them, and asking follow-up question in class or by email = 40%", "materials": "The teacher will provide all materials in downloadable pdf form.\r\n\r\nFiles used for weekly work and the solutions to each week's tasks will also be provided in downloadable pdf form by the teacher.", "foreignLanguageTextbooks": true}]