[{"name": "郭政淳", "email": "kuojona@gmail.com", "latestUpdate": "2020-01-09 21:42:57", "objective": "本課程主要在培養進階寫作能力，採用功能導向的方式，諸如書函，文章／書本摘要，評論，創作，學術專技報告等專項進行演練。\r\nThis course, using a functionally-oriented approach, aims at increasing university-level EFL writing students' English writing skills and developing them into more fluent, confident writers. To achieve this goal, students in this course will have ample opportunities to compose a wide variety of extended writing pieces, including letters, memos, abstracts, reviews, creative writings, and technical reports.", "schedule": "Week 1 Introduction  \r\nWeek 2 Good Writing in the 21st Century\r\nWeek 3 Telling Right from Wrong (I)\r\nWeek 4 Telling Right from Wrong (II)\r\nWeek 5 Telling Right from Wrong (III)\r\nWeek 6 How to Tell a Story (I): Actions\r\nWeek 7 How to Tell a Story (II): Characters\r\nWeek 8 How to Tell a Story (III): Active/Passive Voice\r\nWeek 9 Arcs of Coherence (I): Coherence Relation\r\nWeek 10 Arcs of Coherence (II): Pronouns and Voice\r\nWeek 11 Writing Clearly (I): Diction\r\nWeek 12 Writing Clearly (II): The Curse of Knowledge\r\nWeek 13 Writing Elegantly (I): Concision\r\nWeek 14 Writing Elegantly (II): Shape\r\nWeek 15 Writing Abstracts \r\nWeek 16 Writing Critiques\r\nWeek 17 Describing/Explaining Graphs and Tables \r\nWeek 18 Final Exam", "scorePolicy": "Written Assignments: 34%\r\nIn-Class Activities: 36%\r\nFinal Exam: 20%\r\nWriting Portfolio: 10%", "materials": "Bizup, Joseph and Joseph M. Williams. 2013. Style: Lessons in Clarity and Grace. 11th ed. Pearson Education.\r\nPinker, Steven. 2014. The Sense of Style: The Thinking Person’s Guide to Writing in the 21st Century. New York: Penguin Books.\r\nSwales, John M. and Christine B. Freak. 2012. Academic Writing for Graduate Students: Essential Tasks and Skills. 3rd ed. University of Michigan Press.", "foreignLanguageTextbooks": true}]