[{"name": "尤信程", "email": "scyou@ntut.edu.tw", "latestUpdate": "2019-12-17 08:25:34", "objective": "This course covers a broad classes of machine learning algorithms to be able to conduct research in this field after completing this course. The emphasis of this course is not in the theoretical development (math), but in the understanding level. Therefore, many examples will be given in the lecture to show how to apply the equations to real problems. The detailed contents are given in the course schedule field.", "schedule": "Week 1: Class announcement and introduction to machine learning (CH 1)\r\nWeek 2: Holiday\r\nWeek 3: Basics of supervised learning (Example: k-NN), VC dimension, and regression (CH 2). Bayesian decision theory (CH 3) and Naive Bayes classifiers (CH 5) \r\nWeek 4: ML and MAP estimation; Bias vs variance dilemma (CH 4). Sample mean mean and sample covariance (CH 5). Dimension reduction techniques: PCA, FA (CH 6)\r\nWeek 5: Dimension reduction techniques: LDA and ICA. Clustering algorithm: k-mean (CH 7)\r\nWeek 6: Unsupervised neural networks (CH 12): Competitive learning, SOFM, and ART. Decision trees: ID3, C4.5, and random forest (CH 8)\r\nWeek 7: Holiday\r\nWeek 8: Basics of optimization.\r\nWeek 9: MT\r\nWeek 10: MT sol. Gradient search and linear discrimination (CH 10)\r\nWeek 11: Feedforward neural networks with examples: radical basis networks and multi-layer perceptrons. Back propagation and regularization methods (CH 11)\r\nWeek 12: Deep learning and convolutional neural networks\r\nWeek 13: More on deep neural networks: YOLO, Autoencoder, LSTM, and others \r\nWeek 14: SVM (CH 13)\r\nWeek 15: Combining multiple classifiers (CH 17) & Design and analysis of experiments (CH 19) \r\nWeek 16: Reinforcement learning (Basics, Q learning, DQN)\r\nWeek 17: Reinforcement learning (policy-based learning & PPO)\r\nWeek 18: Final exam", "scorePolicy": "MT 30 %\r\nFinal 40 %\r\nHW 30 %\r\nProject 10 % (optional)", "materials": "Reference text book: Introduction to machine learning. E. Alpaydin. 2nd ed or 3rd ed. Note: textbook is only used to follow the presentation order. Much of the detailed lecture materials are NOT covered in the textbook.", "foreignLanguageTextbooks": true}]