[{"name": "林碧雲", "email": "py23373@ntut.edu.tw", "latestUpdate": "2020-02-28 21:13:31", "objective": "This course, as one of the General Education Courses, is an introduction to economics, aiming to provide young learners a clear, up-to-date, and interesting introduction to the principles of economics and the basic facts about Taiwan and world economic systems. Economics is inherently an evolutionary science, changing to reflect shifting trends in society and the economy. Hopefully at the end of this course, successful students will be able to (1) use economic science methods to explain or predict individual and collective human behavior and decision-making. (2) articulate interdependence of people and places around the globe. (3) understand and apply economic science principles to solve personal, social, and organizational issues.", "schedule": "Week 1-2：Introduction & course overview 導論\r\nWeek 3-5：Principles of economics 經濟學原理\r\nWeek 6-7：Demand-supply & market equilibrium 供需及市場均衡\r\nWeek 8-9：Elasticity and its applications 彈性及其運用 \r\nWeek 10：Midterm exam  期中考\r\nWeek 11-13：National income 國民所得\r\nWeek 14-15：Price index and inflation 物價指數及通膨\r\nWeek 16-17：Unemployment 失業\r\nWeek 18：Final exam  期末考\r\n＊The instructor will adjust the progress and content based on students’ learning situation. 教師將視同學學習情況調整進度與內容", "scorePolicy": "Attendance and Class Participation：40% 平時成績(出勤及參與討論)\r\nMidterm Exam：30% 期中考\r\nFinal Exam：30% 期末考\r\n＊To attend lectures is important. If you miss more than 3 times, you will have no score for attendance and participation.一學期缺課超過3次者，平時成績零分。\r\n＊The schedule and grading policy of this course might be changed to accommodate the impact of COVID 19. 本課程之授課順序、講授內容、教授方式、評量方式以及配分比例可能調整，以因應新冠肺炎之影響。", "materials": "＊This course will be current-event and daily-life oriented. Students should preview the relevant data, understand the week's theme and then participate in the class discussion本課程將以時事及日常生活問題為導向，修課同學請事先預習相關資料，於上課時發表對該週主題之了解，並參與討論。\r\n＊Class discussions are in Mandarin. Chinese proficiency is required. 上課以中文進行，外籍同學需有一定之中文聽講能力。", "foreignLanguageTextbooks": false}]