[{"name": "楊韻華", "email": "yhyang@ntut.edu.tw", "latestUpdate": "2016-02-19 14:26:54", "objective": "本課程介紹語言教學與學習原則，語言習得理論，和語言習得領域重要研究發現。期能建立學生應用語言學知識與日後相關研究的基礎。課程涵蓋主要內容包括：母語習得理論與實踐、第二語言(外語)習得理論與實踐、母語習得與第二語言(外語)習得之相同與相異處、影響語言習得重要因素(情性因素與社會文化因素)、語言學習者策略、對比分析、錯誤分析、語言溝通能力、閱讀理論與實踐、 寫作理論與實踐。\r\nCourse Title:\t\tLanguage Acquisition _ Second Language Acquisition \r\nCredit Hours:\t\t3 \r\nInstructor’s Name:\tDr. Yun-Hua Yang\r\nContact E-Mail:\tyhyang@ntut.edu.tw \r\nTerm Offered:\t\tSpring, 2016\r\nScheduled Class Hours: Monday 9:10—12:00 AM \r\nOffice Hours:      By appointment \r\nRequired Texts:  Selected Chapters from Understanding Second Language Acquisition (Ellis) \r\nCourse Description: This course will look at the process of acquiring / learning and using a second language. It provides theoretical and experimental insights to examine the phenomenon of language development from multi-disciplinary perspectives.  \r\nCourse Objectives:  This course aims to help the students \r\n\t\t\t(1) understand the principles and processes governing L1 & L2 \r\n               acquisition and learning\r\n\t\t\t(2) examine how non-native language ability develops\r\n            (3) become familiar with SLA theories to account for many facets of non-native discourse", "schedule": "Class Schedule (subject to necessary modifications at the professor’s discretion)\r\nWeek \tClass Task(s) \tSession Type \t\r\n1\tOrientation + Ch. 1 Key Issues in SLA\tLecture / Q&A\t\r\n3-4\tCh. 1 Key Issues in SLA\tLecture / Q&A\t\r\n5-6\tCh. 2 The role of the first language\tLecture / Q&A\t\r\n7-8\tCh. 3 Interlanguage\tLecture / Q&A\t\r\n9-11\tCh. 4 Variability in interlanguage\tLecture / Q&A\t\r\n11\tMidterm \t\t\r\n12-13\tCh. 5 Individual differences and SLA \tPresentation / Q&A \t3 groups \r\n14-15\tCh. 6 Input, interaction and SLA \tPresentation / Q&A \t3 groups \r\n16-18\tCh. 7 Learner Strategies \tPresentation / Q&A \t3 groups \r\n18\tFinal Exam", "scorePolicy": "Evaluation Procedures & Grading System:\r\n\tFinal grades will be determined by a point system (X out of 100 total points). Students will be evaluated by their presentations, handouts, full-length text translations, in-class exams, and attendance. (Adjustments will be made if necessary.) \r\n(1)\tPPT Presentation / Handouts and study notes 20%\r\n(2)\tExams (Midterm & Final) 50-60% \r\n(3)\tAttendance 20-30%\r\n(4)\tExtra credit points 5%-10% (if applicable)\r\n\r\nCourse Requirements:\r\n(1)\tIt is recommended that students take class notes.  The use of any form of recording device and/or photographing is strictly prohibited. \r\n(2)\tStudents are divided into 8-10 groups for presentations. Presentation requirements are as follows: \r\ni.\tA full-length presentation MUST be recorded and completed in the studio at least TWO weeks prior to the in-class discussion (presentation & Q&A). \r\nii.\tThe recorded presentation MUST be made available to all students enrolled, and submitted to the instructor ONE week prior to the scheduled class session. \r\niii.\tAll students are required to watch the recorded presentations before the scheduled session. Provide views and points of discussions for class. \r\niv.\tThe group presenters will host the discussion session through brief and summarized presentations and Q&A. What to be discussed / explained / answered in class need to be collected among all students enrolled, and compiled for class and later handouts. Students who contribute questions and topic issues will also need to provide preliminary analysis (with extra credit points).  Group presenters MUST produce handouts with further explanation and analysis. \r\nv.\tComprehensive and detailed notes of lectures are required for study review. \r\nvi.\tAll PPT presentations need to comply with the format as instructed and modeled by the instructor. All the aforementioned materials need to be distributed (hardcopy or digital) to all students enrolled. \r\n(3)\tEach student will be given abundant opportunities to provide his/ her response toward the assigned reading content as the lectures proceed. Students must complete all readings assigned prior to the class session.  \r\n(4)\tThe instructor will not assign additional readings. However, as SLA is multi-disciplinary in nature, it comprises a broad array of theories and studies. Students who are highly interested in this field are strongly encouraged to consult the professor for further suggested readings.\r\n(5)\tAttendance: Students are required to attend class as scheduled. \r\ni.\tEach unexcused absence will result in 10% semester grade deduction. \r\nii.\tAt the sole discretion of the instructor, absence penalty may be waived with valid proof and just cause. Penalty waiver request will only be accepted in two weeks of the date of absence. It is important to know that generally only ONE- time penalty waiver will be considered.  \r\niii.\tLateness to class: Any arrival to class after the instructor finishes the second-round roll call is considered lateness. Each occasions of lateness will, in effect, incur a grade penalty of 5% semester grade deduction.", "materials": "Required Texts:  Selected Chapters from Understanding Second Language Acquisition (Ellis)", "foreignLanguageTextbooks": false}]