[{"name": "黃如瑩", "email": "vinia@ntut.edu.tw", "latestUpdate": "2014-03-03 03:00:58", "objective": "Objectives: The treasure of literature, especially suitable and meaningful for children and teenagers, will be explored in a variety of learning activities in the class, including reading, discussions, role plays, creating picture books, and analyzing film adaptations with the aim to cultivate students’ full language skills and to enrich their cultural literacy in order to build a sound foundation for their future studies. \r\n目標:本課程的主旨在針對兒童文學與青少年文學的經典之作，給予同學們閱讀與分析上的訓練，並培養學生對不同文學主題和寫作風格的鑑賞能力。經由課堂上的學習活動(包括:閱讀,討論,角色扮演,繪本撰寫與製作,以及分析改編電影)來提升同學們整體的聽說讀寫英語能力,並增進對英語世界的文化辨識力,為未來的學業實力打下深厚的基礎.", "schedule": "I. syllabus\r\nWeek 1 \r\nIntroduction \r\nFocus One: The Heart of a Child\r\nWeek 2  \r\n1. “Peter Rabbit and “Benjamin Bunny” by Beatrix Potter \r\n2. Miss Potter\r\nWeek 3 \r\n1.Picture books: Leo Leonni, Julia Donaldson, Quentin Blake, Jan Brett\r\n2.“Peter and the Wolf” (musical)\r\nWeek 4 \r\n1.The Little Prince\r\n2. Miyazaki 's \"Spirited Away\" and Greek mythology\r\nFocus Two: The Heart of a Hero, Now and Then \r\nWeek 5 \r\n1. Beowulf\r\n2. Greek Heroes: Hercules, Theseus, Perseus, Achilles, Odysseus \r\n3. Heroes today: Percy Jackson and the Olympians, Life of Pi\r\nWeek 6 \r\n1.King Arthur Cycle: The Sword in the Stone, Merlin, The First Knight, Sir Gawain and the Green Knight, The Knight’s Tale\r\n2.The Harry Potter Series\r\nWeek 7 \r\n1.The Grimm’s Tales\r\n2.Modern versions of Grimm's Tales\r\nWeek 8\r\n1.The Anderson’s Tales\r\n2.Modern adaptations\r\nWeek 9 \r\n\"The Borrowers\" series and Miyazaki's \"Arietty\"\r\nFocus Three: The Heart of the Literary Masters \r\nWeek 10 \r\n1.The Wizard of Oz (Novel and film adaptation)\r\nWeek 11 \r\n1.The Habbit (Novel and film adaptation)\r\nWeek 12\r\n1.Alice in the Wonderland, Through the Looking Glass (Novel and film adaptation)\r\n2. The trilogy of Inkeart, Inkspell, and Inkdeath (by Cornelia Funke)\r\nWeek 13 \r\n1.Howl’s Moving Castle (Novel and film adaptation by Miyazaki)\r\nWeek 14 \r\n1.The Kite Runner (novel and film adaptation)\r\nFocus Three: The Heart of Fantasy Literature\r\nWeek 15 \r\n1.Narnia\r\nWeek 16 \r\n1.The Lord of the Rings\r\nWeek 17 \r\n1.The Earthsea Cycle \r\nWeek 18 \r\nFinal project due", "scorePolicy": "Percentile distribution for final grades:\r\n1. Weekly exams: 15%\r\n2. Group presentation before mid-term exam week: 15%\r\n3. Group presentation after mid-term exam week: 15% \r\n4. Mid-term exam:15%\r\n5. Final project: 20%\r\n4. Attendance and participation in classroom activities: 20%", "materials": "Reference books:\r\n(1) The 20th-Century Children's Book Treasury. By Janet Schulman. New York: Alfred A. Knopf., 1998.\r\n(2) The 20th-Century Children's Poetry Treasury. Selected by Jack Prelutsky. Illustrated by Meilo So. New York: Alfred A. Knopf., 1999.\r\n(3) Beatrix Potter: The Complete Tales.  Authorized Edition by Frederick Warne. London: Penguin, 2002.\r\n(4) The Family Storybook Treasury:  Tales of Laughter, Curiosity, and Fun. New York: Houghton Mifflin Harcourt, 2011.\r\n(5) Jan Brett’s Snowy Treasury. By Jan Brett. New York: Penguin, 2007.\r\n(6) The Quentin Blake Treasury. By Quentin Blake.  London: Jonathan Cape, Random House, 2012.", "foreignLanguageTextbooks": false}]