[{"name": "雷貝利", "email": "barry.lee.reynolds@gmail.com", "latestUpdate": "2014-02-06 22:27:54", "objective": "課程重點：(1)藉由適合其程度的教材加強學生必備的基礎文法觀念和句型結構；(2)使學生確切把握閱讀要領以及充分瞭解寫作的各種技巧，重心在生字、片語、句法的解釋和基本寫作技巧的分析；(3)熟悉英語人士日常生活情境及與學生將來就業環境相關之會話及適當之應對方式；(4)透過練習加強聽、說、讀、寫的知能及表達。\r\n\r\n英文閱讀與聽講練習\r\nCourse Policies and Syllabus\tSpring 2014\r\n\r\nDepartment:\t應用英文系\t\t\t\tMeeting Place: \t共同715教室\r\nInstructor:  \tDr. Reynolds  雷老師\t\t\tClass Time:\t\t四13:10-16:00\r\nE-mail:\tbarry@ntut.edu.tw\t\t\tClass:\t\t\t英文系大一\r\n\r\nMy Facebook Page:\t\thttp://www.facebook.com/ProfessorLei\r\nClass Facebook Page:\thttps://www.facebook.com/EnglishReadingAndListeningPractice\r\n\t\t\t\t\r\nCourse Title:\tEnglish in Practice\r\n\r\nCourse Description:\tThis course is designed (1) to strengthen students' previously required knowledge in English with basic grammatical ideas and sentence patterns reviewed through reading materials appropriate to their levels; (2) to develop reading skill by giving explanation of difficult words, phrases, and syntax, as well as analysis of basic writing skill; (3) to familiarize students with useful expressions in conversation and build up their confidence in cross-cultural communication; (4) to reinforce the competence and performance of listening, speaking, reading and writing by practice.\r\n\r\nContent Outline:  The course is organized around listening, note-taking, reading, writing, and discussion of content taught in American history and culture courses in high schools, colleges, and universities in the United States.  However, the listening, note-taking, reading, writing, and discussion tasks help students develop the skills they need for study in any academic discipline. Dialogue journals will be used as the method of providing students with the opportunity to improve English writing.  Both intensive and extensive reading will be practiced inside and outside of class.  \r\n\r\nCourse Objectives:  By the end of the course students will have shown:\r\n‧\tknowledge of how to take notes on academic lectures to answer questions.  \r\n‧\tthe ability to participate in class discussions.\r\n‧\tknowledge of how to appropriately apply vocabulary, reading, and writing skills. \r\n‧\tability to read intensively and extensively to acquire content knowledge.  \r\n\r\nInstructional Activities:  This course is first and foremost a reading course.  Students will follow their textbook as it guides them in the acquisition of American history and culture as course content.  Dialogue journals will be used to allow students the opportunity to critique what has been discussed during class.  Students will practice a number of note-taking and reading comprehension tasks inside of class. One intensive reading assignment will be completed in class that will require students to read a lengthy piece of writing without the aid of a dictionary in a short period of time.  Students are encouraged to preview all the material before class in order to not fall behind.  \r\n\r\nDialogue journals are written conversations between student and teacher.  Topics will be selected by both the student and by the teacher.  Students will write an entry and the teacher responds.  The student then reads what the teacher has written and responds.  The student determines how long or short the entry will be.  This will decide how long or short the reply from the teacher will be.  This journal will provide a student with the opportunity to practice writing at one’s own level, receive individualized attention and regular positive feedback, write and read for authentic purpose –to communicate (fluency) but have the teacher model correct usage (accuracy), have the opportunity for reflection and personal response, and have a record of written language development.  This type of writing also allows the teacher to become more acquainted with individual students, provide individualized instruction, and receive frequent assessment of student progress.  There will be time set aside at the beginning of each class for dialogue journal writing tim", "schedule": "Weekly Schedule:\r\nWeek\tDate\tClass Work\tHomework\r\nWeek 1\t2/20\t課程大綱簡介\r\nDialogue Journal Writing #1 (Written Prompt)\t\r\nWeek 2\t2/27\tReading – Chapter 6 pp. 119- 140\r\nDialogue Journal Writing #2 (Written Prompt) – p. 139-140\t\r\nWeek 3\t3/6\tReading – Chapter 7 pp. 141-163\r\nDialogue Journal Writing #3 (Written Prompt) – p. 164-165\t\r\nWeek 4\t3/13\tReading – Chapter 8 pp. 166-184\r\nDialogue Journal Writing #4 (Written Prompt) – p. 185-186\t\r\nWeek 5\t3/20\tReading – Chapter 9 pp. 187-208\r\nDialogue Journal Writing #5 (Written Prompt) – p. 209-210\t\r\nWeek 6\t3/27\tReading – Chapter 10 pp. 211-231 \r\nDialogue Journal Writing #6 (Written Prompt) – p. 232-233\t\r\nWeek 7\t4/3\tHoliday Compensation for Sports Day\t\r\nWeek 8\t4/10\tDialogue Journal Writing #7 (Video Prompt) \r\nListening Chapter 6 p. 81-96\t準備期中考\r\nWeek 9\t4/17\tReading/Writing期中考\t\r\nWeek 10\t4/24\tDialogue Journal Writing #8 (Video Prompt)\r\nListening Chapter 6 p. 81-96\t\r\nWeek 11\t5/1\tIntensive Reading Activity\t\r\nWeek 12\t5/8\tIntensive Reading Activity\t\r\nWeek 13\t5/15\tIntensive Reading Activity\t\r\nWeek 14\t5/22\tListening Chapter 7 p. 97-111\t\r\nWeek 15\t5/29\tListening Chapter 8 p. 112-128\t\r\nWeek 16\t6/5\tListening Chapter 9 p. 129-143\t\r\nWeek 17\t6/12\tListening Chapter 10 p. 144-159\t準備期末考\r\nWeek 18\t6/19\tListening/Note Taking期末考", "scorePolicy": "Grading Procedures:  Course grades will be calculated in the following manner:\r\n\r\nReading/Writing期中考 (Chapters 6-10)\t\t\t\t35%.\r\n\tListening/Note Taking期末考 (Chapters 6-10)\t\t\t35%\r\n\t出席率\t\t\t\t\t\t\t\t10%\r\n\tIntensive Reading Activity\t\t\t\t\t\t10%\r\n\tDialogue Journals (x8)\t\t\t\t\t\t10%\r\n\t\t\t\t\t\t\t\t\tTotal:\t100 pts.\r\n\r\nA\t90-100\r\nB\t80-89\r\nC\t70-79\r\nD\t60-69\r\nF\t59 & BELOW", "materials": "Text and References:\t\r\nSanabria, K. & Sanabria, C. (2008).  Academic Listening Encounters: American Studies.  Cambridge: Cambridge University Press.  \r\nWilliams, J. (2007).  Academic Encounters: American Studies. Cambridge: Cambridge University Press. \r\n\r\n上課規則:\r\n1.\t老師授課時，請同學保持安靜，不要與同學交頭接耳。\r\n2.\t上課中請勿製造噪音(例如隨意講話，大聲整理東西，摔門，等等) 。\r\n3.\t上課時不可以吃東西（兩堂課中間休息時可以）。飲料沒問題。\r\n4.\t不來上課的同學注意喔！要補考（小；期中；期末）的學生必須出示醫生開立之證明或訃聞才可以補考。", "foreignLanguageTextbooks": false}]