[{"name": "柯萊恩", "email": "kcline@ntut.edu.tw", "latestUpdate": "2014-02-17 10:36:32", "objective": "In this course we will examine modern literary works from its first intimations in the 19th century to its more overt inception within the 20th—and moving into the 21st.  After a consideration of the meaning of \"modernity\" from an a-historical framework, we will look at key Modernist and Post-Modern poetry, short fiction and film.  In the period between WWI and WWII, international artistic movements such as the Futurists, Dadaists and Surrealists, as well as American writers Ernest Hemingway, William Faulkner and film makers such as Buster Keaton helped to define a new Modernist impulse in the West; after WWII, post-modern writers such as the poets of the Beat and New York School movements,  fiction writers Thomas Disch and Philip K. Dick and dramatists such as Samuel Beckett took up where the Modernists had left off, but were faced with still more complex aesthetic, political and spiritual challenges.\r\n\r\nSTUDENT RESPONSIBILITIES\r\n\r\n1)  Journals.  Students must keep a journal containing responses to the works we are examining and share these writings with the class on a regular basis. Generally speaking, each Journal Entry will correspond with the works we are studying.  I will be suggesting one or more ideas ideas to explore in your entries during a portion of the course lecture briefly introducing each weeks upcoming reading assignment. I will collect journals during the semester to check on your progress.  \r\n\r\n2) Performance.  Students will give a (quite short) dramatic performance in concert with two or three classmates.  Full participation in all aspects of this performance—from the selection of a short play, to its rehearsal and preparation, to its performance is MANDATORY.).\r\n\r\n3)  Attendance.  Frequent attendance is mandatory.  After your first two absences, each subsequent unexcused absence will cause your final grade to be reduced by five points.  If you are absent, it is your responsibility to find out the substance of class discussions and to make up homework.  Since I generally take roll in the first five minutes of class, if you come in late you may be marked absent.  It is your responsibility to let me know if you've been tardy after class ON THE DAY THAT YOU ARE LATE.  Three tardies = one absence.\r\n\r\n4)  Anyone caught plagiarizing will receive a failing grade in the course.", "schedule": "All assignments journal entries and reading tasks are due next class session unless otherwise indicated.  \r\n\r\nFebruary 18\tIntroduction: Intimations of Modernity  ASSIGNMENT:READ Poe “the Imp of the Perverse and WRITE Journal Entry #1\r\n\r\nFebruary 25\tWhat is Modern?  ASSIGNMENT: READ Poe Stories and WRITE Journal Entry #2\r\n\r\nMarch 3\t\tWomen and Modernity:  ASSIGNMENT: READ Gilman and WRITE Journal Entry #3\r\n\r\nMarch 11\tClass Cancelled\r\n\r\nMarch 18\tWhat is Kafkaesque?  ASSIGNMENT: READ Kafka’s “Metamorphosis” and WRITE Journal Entry #4\r\n\r\nMarch 25\tThe Rupture/Rapture of Modernism:  ASSIGNMENT: READ Loy Poems + Carrington Stories and WRITE Journal Entry #5\r\n\r\nApril 1\t\tThe Center Cannot Hold  ASSIGNMENT: READ Yeat’s “The Second Coming” + stories by Hemingway and Faulkner and WRITE Journal Entry #6\r\n\r\nApril 8\t\tPoetry and Prose//MIDTERM QUIZ ASSIGNMENT: READ Dylan Thomas story “After the Fair” + Thomas poems and WRITE Journal Entry #7\r\n\t\r\nApril 15\t\tText as Analog of Infinity:  ASSIGNMENT READ essay by Foucault + WRITE Journal Entry #8\r\n\r\nApril 22\t\tText as Relationship:  ASSIGNMENT READ poems by Eliot and Rich + WRITE Journal Entry #9\r\n\r\nApril 29\t\tText as Freedom:  ASSIGNMENT READ poems by O’Hara and Kaufman + WRITE Journal Entry #10\r\n\r\nMay 6\t\tText as Paradox:  ASSIGNMENT READ Philip K. Dick Story “King of the Elves” + poems by Simic, Szymborska + WRITE Journal Entry #11\r\n \r\nMay 13\t\tText as Environment:  ASSIGNMENT: READ Thomas Disch story “The Squirrel Cage” + Ashbery poems + WRITE Journal Entry #12\r\n\r\nMay 19\t\tPost-Modern Theatre  View Beckett film “Film,’ starring Buster Keaton.  ASSIGNMENT: READ Beckett’s “Krapp’s Last Tape” + look over futurist texts and WRITE Journal Entry #13 (DIVIDE INTO SMALL GROUPS FOR PERFORMANCES: ATTENDANCE MANDATORY)\r\n\r\nMay 26\t\tRehearsal:  Futurist Plays  (ALL JOURNALS DUE: ATTENDANCE MANDATORY)\r\n\r\nJune 2\t\tDRAGONBOAT FESTIVAL\r\n\r\nJune 9\t\tFuturist Plays Performance (ATTENDANCE MANDATORY)\r\n\r\nFINAL PAPER DUE NOON JUNE 16", "scorePolicy": "25%\tClass Participation and Journals \t\t\t25%\tMidterm Quiz\r\n25%\tPerformance Aptitude and Originality\t\t25%\tFinal Exam (Take Home)", "materials": "　", "foreignLanguageTextbooks": false}]