[{"name": "魏敏樺", "email": "mwgui@ntut.edu.tw", "latestUpdate": "2014-01-22 16:38:48", "objective": "This course will provide the students with sufficient guidance and resources to learn the fundamentals of soil mechanics principle applicable in the analysis and design issues encounter in geotechnical engineering. In particular, this course introduces the students to the following areas of Soil Mechanics: 1. Physical Characteristic of Soils; 2. Permeability and Seepage; 3. Consolidation; and 4. Soil Settlement, and 5. Shear Strength and Stress Path of Soil. The goals of the course are:\r\n1. Gain understanding in the physical and mechanical properties of soils.\r\n2. Gain knowledge in determining parameters from soil testing to characterize soil properties, soil strength, and soil deformation.\r\n3. Apply concept of soil mechanics to analyze and design of simple geotechnical system.", "schedule": "1.\tPhysical Characteristics of Soils:\r\n- Weight-Volume Relationships\t\t\t- Grain Size Distribution of Soils\r\n- Consistency of Cohesive Soils\t\t\t- Soil Classification\r\n- Compaction of Soils\r\n2.\tPermeability and Seepage:\r\n- Darcy's Law\t\t\t\t\t- Flow Net\r\n- Factors Affecting the Coefficient of Permeability\r\n- Effective Coefficient of Permeability for Stratified Soils\r\n- Determination of Coefficient of Permeability in Lab/Field\r\n- Hydraulic Uplift Force Under a Structure\r\n- Safety of Hydraulic Structures against Piping\r\n3.\tConsolidation:\r\n- General Concepts of 1-D Consolidation\r\n- Theory of 1-D Consolidation\r\n- Degree of Consolidation under Time-Dependent Loading\r\n- Standard 1-D Consolidation Test and Interpretation\r\n- Secondary Consolidation\r\n4.\tSoil Settlement:\r\n- Immediate Settlement\t\t\t\t- Primary Consolidation Settlement\r\n- Secondary Consolidation Settlement\t\t- Stress Path Method of Settlement Calculation\r\n5.\tShear Strength of Soil and Stress Path:\r\n- Mohr-Coulomb Failure Criterion\t\t- Shearing Strength of Granular Soils\r\n- Shearing Strength of Cohesive Soils\t\t- Drained and Undrained Shear Strength\r\n- Relation of Su and Effective Overburden Pressure\r\n- Comments on the Friction Angle of Granular Soils", "scorePolicy": "Quizzes/Home works  \t: 40%\r\nMidterm Exam\t\t: 30%\r\nFinal Exam\t\t: 30%", "materials": "1.\tMuni Budhu, Soil Mechanics & Foundations, John Wiley & Sons, Inc.\r\n2.\tBraja, M. Das, Advanced Soil Mechanics, McGraw-Hill Inc.\r\n3.\tBraja, M. Das, Principles of Geotechnical Engineering, PWS Publishing Company.", "foreignLanguageTextbooks": false}]