[{"name": "鄭傅儒", "email": "frcheng@ntut.edu.tw", "latestUpdate": "2014-01-08 14:18:21", "objective": "以創意的實作訓練為主﹐藉由家具與室內設計空間之相關性的主題, 透過實際設計程序的演練以培養設計的能力。", "schedule": "選修的同學必須包含﹕\r\n一. 設計實作部份﹕\r\n在德國Lichtenfels舉辦的設計營 (Prof. Auwi Stübbe/Innovations-Centerum Lichtenfels,共同指導)\r\nFirst Workshop project 2014 - Rattan meets Taiwan\r\n\r\nSubject:MATERIAL AND SUSTAINABILITY \r\n\tResources and Creativity\r\n\tDesign strategy for rattan furniture construction\r\n\r\nParticipants:Students of National Taipei University of Technology \r\nDesigner and students from Germany\r\n\r\nAttendance: 30 Taiwanese Students and 10 German Students/Designers\r\n\r\nManagement:\r\nProf. Dr. Frue Cheng National Taipei University of Technology\r\nProf. Auwi Stübbe,\tInnovation Center Lichtenfels\r\nProf. Jan Armgardt, Innovation Center Lichtenfels\r\nProf. Frank Sander, Innovation Center Lichtenfels\r\nAssistance: Klaus Jacob, Master of Rattan maker, IZL\r\n\r\nWorkshop venue:\tD 96215 Lichtenfels, Germany, Schneidmühlweg 28\r\n\r\nMaterial:The participants bring drawing material:\r\n-pencil with soft lead,\r\n-measuring instruments\r\n-tracing paper, \r\n-masking tape (Tesa)\r\n\r\nBasic material: The basic material used for the models – thin rattan poles 2 to 4 mm diameter – are provided for the participants.\r\n\r\nChallenge\t\r\n1. Create a light, small easy chair! Alternative\r\n2. Create a small, light daybed\r\n\r\nTargets of workshop: Training objectives: \r\nTo qualify Taiwanese design students and designer in designing rattan furniture for the international market by:  \r\n-strategic, methodical approach with the generation of ideas, the styling and model development,\r\n-quality standards in technique,\r\n-ergonomic norms and standards\r\n-aesthetic standards, targeting of market groups\r\n\r\nWorking objectives: Within the workshop time each participant creates a model-form in the scale 1:10 or 1:5/1:6  (depends on the Ideas) important details will be worked out as prototypes scale 1:1 \r\n\r\nTechnical dokumentation: It will be kept records in suitable form on the single design steps. \r\n\r\nPresentation: The working objectives are to be prepared in a way to be convenient for a daily presentation as well as for the terminal presentation.\r\n\r\n\r\nScheduling\r\n1.Day,2014/01/20 Mo:Introduction of the participants – becoming acquainted of the participants. Introducing of the scope of work by the managers and explanation of the process and the objectives.\r\nSet up of the work stations. Daily target: Set up work stations and clearness about the scope of work, First ideas\r\n\r\n2.Day,2014/01/21 Thu:Form finding\r\nIdeas, drafts, little models. Transfer of the ideas to model-forms scale 1:10/1:5/1:6 using thin rattan poles. Daily target: Ideas suitable for realization.\r\n\r\n3.Day,2014/01/22 We: Transfer of the ideas to model-forms scale 1:10/1:5/1:6 using thin rattan poles. Daily target: Constructive and structural clearness\r\n\r\n4.Day, 2014/01/23 Th: Ergonomic design matching with the construction and Test of the seating respectively lying comfort.\r\nStudies of the surfaces, Material studies of the netting Elaboration, bringing together of netting and Daily target: Model-form scale 1:10/1:5/1:6 plus detailed studies construction\r\n\r\n5.Day, 2014/01/24 Fr: Elaboration and preparation for the presentation Presentation. Daily target: participant, Challenge Satisfied students who recognize this is a good way for a sustainable design strategy\r\n\r\nSpecial experts \tProf. Jan Armgardt, Schondorf/Aachen\r\nas teachers for \tProf. Frank Sander, Trier\r\none day\r\n\r\n6. and 7. Day,opportunities\t:Reserve days for excursions. \r\nDay excursion to the City of Bamberg UNESCO world Heritage By train 30 minutes from Lichtenfels\r\n\r\nVisit the German Wicker-Work-Musem in a small village Michelau, near to Lichtenfels\r\nVisit the Banz Monastery and Basilica of the Fourteen Holy\r\nby car 20 minutes\r\nVisit a upholstery furniture factory\r\n\r\nDaily targets: Good impressions of Upper Franconia and Bavaria\r\n\r\n二.\r\n第一週至第十八週﹕設計報告及作品集指導", "scorePolicy": "設計實作 60%\r\n設計報告及作品集 40%", "materials": "　", "foreignLanguageTextbooks": false}]