[{"name": "周至如", "email": "cjchou@ntut.edu.tw", "latestUpdate": "2010-02-20 16:01:10", "objective": ".Lumped circuit & distributed circuit concepts,\r\n.Circuit elements characteristics and circuit variables,\r\n.Kirchhoff's voltage law (KVL) and Kirchhoff's current law (KCL),\r\n.Techniques of circuit analysis\r\n.Simple one-port resistive circuit and Thevenin-Norton equivalent\r\ncircuit analysis,\r\n.Analysis of linear time-invariant resistive circuit with\r\nindependent and dependent sources,\r\n.Characteristics of inductance, capacitance and mutual inductance,\r\n.First order circuits (RL and RC circuits) analysis,\r\n.Applications and further solutions for more complex first order\r\ncircuit.", "schedule": "第1週:Introductions,the concepts of lumped circuit & distributed\r\ncircuit and their applications.\r\n第2週:Circuit elements characteristics, circuit variables and simple\r\ncalculations.\r\n第3週:Descriptions of Kirchhoff's voltage law (KVL) and Kirchhoff's current law (KCL) and their extended concepts.\r\n第4週:Techniques of circuit analysis based on KVL and KCL and conventional methods and theorems.\r\n第5週:Simple one-port resistive circuit and Thevenin-Norton\r\nequivalent circuit analysis.\r\n第6週:Analysis of linear time-invariant resistive circuit with\r\nindependent sources only.\r\n第7週:Analysis of linear time-invariant resistive circuit with\r\nboth independent and dependent sources.\r\n第8週:Analysis of linear time-invariant resistive circuit with\r\nmore complex scheme.\r\n第9週: Review and midterm (期中考)\r\n第10週:Characteristics of inductance and derivation of important  equations.\r\n第11週:Characteristics of capacitance and derivation of important  equations.\r\n第12週:Characteristics of mutual inductance and derivation of important  equations.\r\n第13週:Calculations of important items about combinations of inductance, capacitance and mutual inductance.\r\n第14週:First order circuits (RL circuits) characteristics analysis.\r\n第15週:First order circuits (RC circuits) characteristics analysis.\r\n第16週:Various types of first order circuit analysis.\r\n第17週:Applications and further solutions for more complex first order circuits.\r\n第18週:Final examination (期末考)", "scorePolicy": "期中考(30%)\r\n期末考(30%)\r\n平常成績(40%)\r\n註:平常成績包括:出席率, 作業, 小考(至少二次)及課堂表現等.", "materials": "The goals of this course is to discipline the students of under graduated level to erect their fundamental on the circuit theory . For this, the concepts and the analysis technique of electric circuit are learned , in which the related electromagnetic theory, physical concepts and mathematic methods for solving the circuit problems will be enhanced . The approach methods including the analytical methods and numerical methods are studied. From which, the students can realize many circuit theorems and their applications and some associated approach software. In addition to the circuit analysis techniques, the students are encouraged to solve some simple circuit synthesis problems for futher study on the circuit design and its related fields in the future.\r\n主要教材為:\r\n教科書名 Electric Circuits (Eighth Edition)\r\n作者 James W. Nilsson & Susan A. Riedel\r\n出版書局 Person Prentice Hall\r\n出版日期 西元2008年", "foreignLanguageTextbooks": false}]