[{"name": "葉樹開", "email": "yehshukai@gmail.com", "latestUpdate": "2010-08-23 15:35:35", "objective": "介紹各種奈米結構材料：奈米碳管、奈米線、量子點、量子線和奈米複合材料的基本特性以及製備與應用技術，期能對奈米材料的物性、製造與應用有整體的認識。\t\t\t\r\n先修課程: General Physics, General Chemistry, Physical Chemistry \r\nTextbook:\tD. L. Schodek, P. Ferreira and M. F. Ashby, “Nanomaterials, Nanotechnologies and Design: An Introduction for Engineers and Architects” Butterworth-Heinemann (June 11, 2009)\r\nCourse Objectives:\t\r\nA. Provide a brief review of material history\r\nB. Provide a brief review of nanotechnology\r\nC. Learn to understand the properties of nanomaterials\r\nD. Learn to understand the chemistry of nanomaterials\r\n", "schedule": "Course Outline:\r\n1.\tNanomaterials and Nanotechnologies\r\n2.\tAn Evolutionary Perspective\r\n3.\tThe Design Context\r\n4.\tMaterial Classes, Structure, and Properties\r\n5.\tMaterial Property Charty and Their Uses\r\n6.\tNanomaterials: Class and Fundamentals\r\n7.\tNanomaterials: Properties\r\n8.\tNanomaterials: Synthesis and Characterization\r\n9.\tDesign Environments and Systems\r\n10.\tNanomaterial Product Forms and Functions\r\n11.\tNanomaterial and Nanotechnologies in Health and Environment\r\n12.\tThe Broader Context\r\n", "scorePolicy": "Grades: \r\nGrades will be determined from a composite score of all graded materials, consisting of: two midterm exams, homework problems, and the comprehensive final exam. Weights used to determine the final score will be:\r\n1. Homework problems, 15%\r\n2. In-Class Activities, Quizzes 10%\r\n3. Two exams, 60% (midterm 30%, final 30%)\r\n4. Final Project, 15%\r\nHomework Rules:\t\t\r\n1.\tHomework problems are due at the beginning of class.\r\n2.\tPlease work the homework early to avoid lateness due to computer crashes.\r\n3.\tAnswer keys will be posted on http://elearning.ntut.edu.tw \r\n4.\tYou may discuss with others how to begin working problems, but you must work the problem entirely yourself to hand in for credit. You may not share computer files for homework problems until the case study.\r\n5.\tAnyone who share computer files or copy homework from classmates will subject to a 50% off his/her homework credit.\r\nExams:\r\nAll exams will be held in our normal classroom.\r\nFinal Exam:\r\nAll students must take the final exam to pass the course. Finals will not be given at any other time. There will not be a makeup exam.\r\n", "materials": "References:\r\n1.\tL. E. Foster, “Nanotechnology: Science, Innovation, and Opportunity”, Prentice Hall PTR, 2009\r\n2.\tG. L. Hornyak, J. J. Moore, H. F. Tibbals, and J. Dutta, “Fundamentals of Nanotechnology”, CRC Press, NY, 2008\r\n3.\t呂宗昕, “圖解奈米科技與光觸媒”, 商周, 2003\r\n4.\t馬振基主編, “奈米材料科技原理與應用”, 全華, 2007\r\n5.\t林建中, “奈米科技基礎與實務”, 2nd edition, 文京, 2006\r\n6.\t蔡信行, 孫光中, “奈米科技導論 基本原理與應用”, 文京, 2009\r\n", "foreignLanguageTextbooks": false}]