[{"name": "陳雅玫", "email": "ymchen@ntut.edu.tw", "latestUpdate": "2010-02-22 12:37:38", "objective": "This course aims to help students learn the correct usage of English grammar (including parallelism, subordination and coordination) and master the paragraph-length writing. It will develop students’ writing skills from expressing an idea into a complete English sentence to organizing ideas into a structured paragraph. Students are expected to be able to use effective definition, description, illustration, argumentation and narration in their paragraph writing. Plenty of discussion will take place in class and active participation is highly required of students.", "schedule": "Week 1   N/A\r\nWeek 2   1. Introduction/2. Clear sentences\r\nWeek 3   Parallelism\r\nWeek 4   Subordination and Coordination\r\nWeek 5\t1. Understanding the Writing Process/2. What Is a Paragraph? (I)\r\nWeek 6   1. What Is a Paragraph? (II)/2. Developing Ideas for Writing a Paragraph\r\nWeek 7   Tomb-sweeping Festival\r\nWeek 8   Supporting and Concluding Sentences\r\nWeek 9   Midterm Exam\r\nWeek 10  Paragraph Review; Punctuations\r\nWeek 11  Definition Paragraphs\r\nWeek 12  Process Analysis Paragraphs\r\nWeek 13  Descriptive Paragraphs\r\nWeek 14  Opinion Paragraphs\r\nWeek 15  Narrative Paragraphs\r\nWeek 16  Paragraphs in an Essay: Putting It All Together\r\nWeek 17  Wrap-up\r\nWeek 18  Final Exam\r\n", "scorePolicy": "1. attendance & participation: 10%\r\n2. grammar exercises and quizzes: 25%\r\n3. writing assignments and revisions: 30%\r\n4. mid-term exam: 20%\r\n5. final-exam: 20%\r\n", "materials": "Teaching Materials:\r\n1. Folse, K., Muchmore, A., & Verstri, E. 2004. Great Paragraphs: An Introduction to Writing Paragraphs. 2nd edition. Boston: Houghton Mifflin.\r\n2. Fowler, H. R. & J. E. Aaron. 2001. The Little, Brown Handbook. 7th edition. New York: Longman Person.\r\n3. Butler, E., Hickman, M. A., McAlexander P. J. & Overby, L. 1998. Correct Writing. 6th edition. Taipei: Bookman.\r\n4. Instructor’s handouts\r\nRequirements & Rules:\r\n1. Please turn off your cell phone during the two-hour class period.\r\n2. Absence: Students are expected to attend the class ON TIME.\r\n(1) Being late for more than TWENTY minutes equals one hour unexcused absence. One hour UNEXCUSED absence results in 4 points deduction.\r\n(2) For an absence to be excused, students need to submit compelling evidence of the gravity or unforseeability of the event causing the absence within ONE WEEK.\r\n(3) Students missing more than SIX hours unexcused will have a fail.\r\n(4) Absence from a class is no excuse for not knowing the assignment and what has been discussed in that class. There will be NO MAKE-UP EXAM unless you have valid and official reasons for absence BEFOREHAND.\r\n3. Each student is required to complete all readings assigned prior to the class session. All assigned readings will be included in the in-class quizzes, mid-term exam and final exam.\r\n4. Writing Assignments:\r\n(1) Writing assignments will be given periodically throughout the course.\r\n(2) All assignments must be submitted via e-mail by 5PM SATURDAY. For late assignments, 20% of the assignment mark will be deducted each day. Assignments more than THREE days late will not be accepted\r\n(3) After the writing assignments are evaluated and assessed, students need to submit their revisions based on the instructor’s comments within one week.\r\n", "foreignLanguageTextbooks": false}]