[{"name": "黃如瑩", "email": "vinia@ntut.edu.tw", "latestUpdate": "2010-05-04 15:48:00", "objective": "課程重點：(1)藉由適合其程度的教材加強學生必備的基礎文法觀念和句型結構；(2)使學生確切把握閱讀要領以及充分瞭解寫作的各種技巧，重心在生字、片語、句法的解釋和基本寫作技巧的分析；(3)熟悉英語人士日常生活情境及與學生將來就業環境相關之會話及適當之應對方式；(4)透過練習加強聽、說、讀、寫的知能及表達。", "schedule": "I. Required text:\r\n1.Advanced English Monthly Magazine,by Studio Classroom (Taipei).\r\n2. Popular songs\r\nII.Important text:\r\nEssential Reading I-IV, by Gough. McAvoy, Miles, and French. Oxford: MacMillan,2008.\r\nIII. Syllabus\r\nUnit One: March Issue of Advanced English Weekly Magazine\r\nWeek 1 Introduction\r\nWeek 2 Weekly test on reading and listening; Listening comprehension re-enforcement\r\nWeek 3 English songs and drama; weekly test on reading and listening\r\nWeek 4 Weekly test on reading and listening; Listening comprehension re-enforcement\r\nUnit Two:April Issue\r\nWeek 5 English songs and drama; weekly test on reading and listening\r\nWeek 6 Weekly test on reading and listening; Listening comprehension re-enforcement\r\nWeek 7 English songs and drama; weekly test on reading and listening\r\nWeek 8 Weekly test on reading and listening; Listening comprehension re-enforcement\r\nUnit Three: May Issue\r\nWeek 9 English songs and drama; weekly test on reading and listening\r\nWeek 10 Weekly test on reading and listening; Listening comprehension re-enforcement\r\nWeek 11 English songs and drama; weekly test on reading and listening\r\nWeek 12 Weekly test on reading and listening; Listening comprehension re-enforcement\r\nUnit Four: June Issue\r\nWeek 13 English songs and drama; weekly test on reading and listening\r\nWeek 14 Weekly test on reading and listening; Listening comprehension re-enforcement\r\nWeek 15 English songs and drama; weekly test on reading and listening\r\nWeek 16 Weekly test on reading and listening; Listening comprehension re-enforcement\r\nWrapping up\r\nWeek 17 Group presentation of script and drama\r\nWeek 18 Final exam", "scorePolicy": "1. Weekly tests: 5% X 14 = 70%\r\n2. Midterm exam: 10%\r\n3. Final exam: 10%\r\n4. Group presentation of drama: 10%\r\n", "materials": "1. Essentail Idioms in English. By Robert J. Dixson.  New Work:  Scholastic, 1994.\r\n2. Idioms Made Easy:  Stories of Selected English Idioms. By Tseng and Kao. Taipei: Bookman, 2004.\r\n3. Essential Reading I-IV, by Gough. McAvoy, Miles, and French. Oxford: MacMillan,2008.\r\n4. Twenty-minute Plays:  Animal Crackers, by Don Gilleland.  Taipei:  Bookman, 2003.\r\n", "foreignLanguageTextbooks": false}]