[{"name": "葉樹開", "email": "yehshukai@gmail.com", "latestUpdate": "2010-08-23 15:38:11", "objective": "介紹化工廠各種不同支架或機械單元之受力情形及其強度與變形。課程包括力學之基本概念、力系之平衡 、磨擦、靜態力學、動態力學、材料之伸縮及應力分佈分析。\r\nCourse Objectives:\t\r\nA. Provide a basic understanding of vector analysis\r\nB. Learn to understand the fundamentals of solid mechanics\r\nC. Learn to understand mechanical properties of materials\r\nD. Learn to understand the stress-strain relationship and stress-strain transformation\r\n", "schedule": "Course Outline:\r\n1.\tStatics\r\n1.1\tGeneral Principles\r\n1.2\tForce Vectors\r\n1.3\tForce System Resultants\r\n1.4\tEquilibrium of a Rigid Body\r\n1.5\tStructural Analysis\r\n1.6\tGeometric Properties and Distributed Loadings\r\n1.7\tInternal Loadings\r\n2.\tMechanics of Materials\r\n2.1\tStress and Strain\r\n2.2\tMechanical Properties of Materials\r\n2.3\tAxial Load\r\n2.4\tTorsion\r\n2.5\tBending\r\n2.6\tTransverse Shear\r\n2.7\tCombined Loadings\r\n2.8\tStress and Strain Transformation\r\n2.9\tDesign of Beams\r\n2.10\tBuckling of Columns\r\n", "scorePolicy": "Grades: \r\nGrades will be determined from a composite score of all graded materials, consisting of: two midterm exams, homework problems, and the comprehensive final exam. Weights used to determine the final score will be:\r\n1. Homework problems, 25%\r\n2. In-Class Activities, Quizzes 10%\r\n3. Two exams, 65% (midterm 30%, final 35%)\r\nHomework Rules:\t\t\r\n1.\tHomework problems are due at the beginning of class.\r\n2.\tHomework may be turned in 1 week late without excuse for up to 50% credit or the lowest grade of the class. You may look at the answer key in front of my office for guidance on late homework. Please work the homework early to avoid lateness due to computer crashes.\r\n3.\tAnswer keys will be posted on http://elearning.ntut.edu.tw \r\n4.\tYou may discuss with others how to begin working problems, but you must work the problem entirely yourself to hand in for credit. You may not share computer files for homework problems until the case study.\r\n5.\tAnyone who share computer files or copy homework from classmates will subject to a 50% off his/her homework credit.\r\nExams:\r\nAll exams will be held in our normal classroom.\r\nFinal Exam:\r\nAll students must take the final exam to pass the course. Finals will not be given at any other time. There will not be a make up exam.\r\n", "materials": "Textbook:\tR. C. Hibbeler, “Statics and Mechanics of Materials, SI Edition” Prentice-Hall, Inc. 2004", "foreignLanguageTextbooks": false}]