[{"name": "周素鳳", "email": "sfchou@ntut.edu.tw", "latestUpdate": "2010-02-19 16:55:16", "objective": "In this semester, we’ll move from the personal, subjective to the objective, critical; from close observations to the critical process and reasoning.  Project I involves a writing of analysis on educational or social issues.  Students will be guided with strategies of critical reading and structures of analysis and formal critique so as to set forth thoughtful responses and formulate a coherent thesis and support it with evidences and arguments. Project II—Reading the News—emphasizes analysis and argumentation.  After carefully examining two newspaper articles describing the similar event or issue, students will learn to read critically and write their own analysis and viewpoints.", "schedule": "2/25\tEnumeration; The Old Days\r\n3/4\tAnalysis;\t“Typical Science Fiction Film”\r\n3/11\tWriting an outline\t“Why Women Should Not Have an Abortion”\r\n3/18\tOrganization of an Argumentative Essay;\t“Uniforms”\r\n3/25\tDebatable Statements;“College is a Waste of Time and Money”\r\n4/1\tTransitional Words\tResponse to “College is a Waste of Time and Money”\r\n4/8\tTOEFL & GRE argumentative sample essays\r\n4/15\tOne-to-one discussion with the teacher\r\n4/22\tTOEFL & GRE argumentative sample essays;\r\n4/29\tComparison and Contrast;“Romance is a Poor Basis for Marriage”“My Part-time Jobs”;“METU and Bogazici University”;“The Committer vs. the Non-Committer”\r\n5/6\tBrowsing through the news;“The Noose Incident”\r\n5/13\tSelecting a news event;“An Appropriate Expression?”\r\n5/20\tComparing and Contrasting Media (Re)Presentations;\t“Ithacan Inquirer”\r\n5/27\tArguing Your Point of View\t;“Now Hip-Hop, Too, Is Made in China”“Why Isn’t Hip-Hop Popular in China”\r\n6/4\tArguing vs. Expressing Your Opinion\r\n6/11\tOne-to-one discussion with the teacher\r\n6/18     Project II completed\r\n6/25\tReview and Discussion\r\n", "scorePolicy": "Criteria for grading\r\n1.\tProject I: 35% (outline draft —10%; draft 2—10%; final draft: 15%)\r\n2.\tProject II: 35% (outline draft —10%; draft 2—10%; final draft: 15%)\r\n3.\tAssignments and In-class Practices: 30%\r\n", "materials": "Requirements:\r\n1.Your regular attendance is required to pass this course.  3 unexcused absences from class will result failing grade for this course.  One unexcused absence will result in an automatic final score reduction of 3 points.\r\n2. Don’t be late. One late attendance means a 1 point reduction from your final score. If you are more than 10 minutes late to the class, it will be counted as an absence.\r\n2. A late paper will be penalized at the rate of five points reduction a day. A computer problem is not a legitimate excuse.\r\n3.Each student should prepare an A4 folder collecting your writing assignments.  Each time you submit your assignment, you should put it in the folder with the previous assignments included in it.\r\n", "foreignLanguageTextbooks": false}]