[{"name": "楊韻華", "email": "yhyang@ntut.edu.tw", "latestUpdate": "2010-03-05 12:09:16", "objective": "本課程著重於: (1)藉由科技性文章的閱讀來幫助非理工背景之學生了解一般科技性文章之語法、文體與結構組織，(2)幫助學生熟悉技術報告以及科技論文之撰寫。\r\nCourse Description: \tThis course aims to prepare undergraduate English-major students with sufficient repertoire of English for technology at the level of workplace and academia. This present course content is twofold. Basic scientific paper writing, including its language, format, techniques, and style will be introduced.\r\n Developing essential core content vocabulary and strategies for reading comprehension and content discussion is implemented through reading scientific and technical papers, reports and articles.\tCourse Objective:\tAt the successful conclusion of this course, students are expected to \r\n1)\tdevelop a substantial English vocabulary repertoire for the “pan-technology” disciplines in English\r\n2)\tbuild solid skills of English writing in the context of science and technology for field reports as well as academic publications\r\n3)\tstrengthen English oral language fluency for technical presentations\r\n4)\tconsolidate content knowledge, field expertise, research capability, and English proficiency for career advancement", "schedule": "Readings and presentations as assigned and scheduled.\r\n", "scorePolicy": "Course Requirements:\tStudents enrolled in this course will be required to:\r\n1)\tcomplete all readings assigned by the instructor and selected by students themselves \r\n2)\tselect one technical report to present in class \r\n3)\tparticipate in all in-class activities, including reading, writing, and speaking \r\n4)\tcomplete assigned exercise tasks \r\nAttendance:  Students are required to attend the class as scheduled and to arrive on time. Full attendance and punctuality are prioritized. \r\n \t\t\t\t\t 1) Any AWOL will result in the penalty of 10% semester grade deduction.\r\n2) Penalty-waiver can be granted for any absence w/ official document at the instructor’s sole discretion. Should there be any major incidents and issues under extreme circumstances, special considerations will be given after thorough discussion with the student(s), and the class advisor(s), if necessary.\r\nEvaluation Procedures & Grading System:\r\n\tFinal grades will be determined by a point system (X out of 100 total points). Students will be evaluated by their attendance, presentations, assignments and quizzes / exams.\r\n(1)\tAttendance 30 %\r\n(2)\tQuizzes/Assignment / Presentation 40% \r\n(3)\tFinal Exam 30%\r\n", "materials": "Supplementary handouts compiled by course instructor", "foreignLanguageTextbooks": false}]