[{"name": "陳雅玫", "email": "ymchen@ntut.edu.tw", "latestUpdate": "2010-02-22 12:35:02", "objective": "This course intends to build up confidence and competence of students who are interested in reading news articles on a variety of topics. It will help students enrich their vocabulary by introducing key expressions in realms like politics, arts, entertainment, science & technology, sports, business and health. Additionally, diverse forms of activities are arranged to enable students to develop effective reading skills. This course is also designed to enhance students’ listening abilities through the use of video-audio materials from on-line news channels like ICRT, CNN, BBC and VOA.", "schedule": "Week 1   Introduction \r\nWeek 2   Characteristics of Journalistic News (I)\r\nWeek 3   Characteristics of Journalistic News (II)\r\nWeek 4   Political News \r\nWeek 5   Political News\r\nWeek 6   Arts & Entertainment News \r\nWeek 7   Arts & Entertainment News\r\nWeek 8   Science & Technology News \r\nWeek 9   Mid-term \r\nWeek 10  Science & Technology News\r\nWeek 11  Sports News \r\nWeek 12  Business & Finance News\r\nWeek 13  Business & Finance News\r\nWeek 14  Health & Environment News\r\nWeek 15  Oral Presentation (I) \r\nWeek 16  Oral Presentation (II)\r\nWeek 17  Wrap-up\r\nWeek 18  Final Exam\r\n", "scorePolicy": "1. attendance & participation: 15%\r\n2. in class exercises & quizzes: 40%\r\n3. oral presentation: 15%\r\n4. final exam: 30%\r\n", "materials": "Teaching Materials: \r\n\r\n1.Instructor’s handouts\r\n2.news articles from on-line newspapers (e.g. the New York Times, the Washington Post, the Times, the Guardian, the Taipei Times and the China Post) or magazines (e.g. Newsweek, Time, The Economist, Scientific American and Businessweek).\r\n3.video/audio clips from news channels like ICRT, CNN, BBC, VOA and CBS. \r\n\r\nRequirements & Rules:\r\n1. Please turn off your cell phone during the two-hour class period.\r\n\r\n2. Absence: Students are expected to attend the class ON TIME. \r\n(1) Being late for more than TWENTY minutes equals one hour unexcused absence. One hour UNEXCUSED absence results in 4 points deduction. \r\n(2) For an absence to be excused, students need to submit compelling evidence of the gravity or unforseeability of the event causing the absence within ONE WEEK. \r\n(3) Students missing more than 6 hours unexcused will have a fail.\r\n(4) Absence from a class is no excuse for not knowing the assignment and what has been discussed in that class. There will be NO MAKE-UP EXAM unless you have valid and official reasons for absence BEFOREHAND.\r\n\r\n3. Each student must complete all readings assigned prior to the class session. All assigned readings will be included in the in-class quizzes, mid-term exam and final exam. \r\n\r\n4. Pre-readings: each student must complete all readings assigned prior to the class session. All assigned readings will be included in the in-class quizzes and final exam. \r\n\r\n5. Oral Presentation: students will be divided into several groups, and each group (around 3-4 persons) is required to make a PowerPoint presentation (about 15 minutes) in Week 15 or Week 16. Guidelines for the oral presentations are given below: \r\n(1) Find a topic that interests you and that you can make interesting to your fellow classmates.\r\n(2) Collect and read relevant news articles on your chosen topic. \r\n(3) PowerPoint presentations must be made in ENGLISH.\r\n(4) E-mail your PPT slides to the instructor 2 days prior to the presentation. \r\n\r\n", "foreignLanguageTextbooks": false}]