[{"name": "蔡昕皓", "email": "hsinhao@gmail.com", "latestUpdate": "2010-02-17 13:54:16", "objective": "What is technology to you? A trendy ipad? A swipe and go payment system? Or a cure-all prescription that saves life?\r\nHow has technology changed your life so far? Hassle-free travel arrangements? Trouble-free online banking? No more dictionaries, no more phonebooks, no more notebooks, and no longer lost in the middle of nowhere, because Google has it all?\r\nModern technology has seemingly presented us all the convenience, simplicity, efficiency and an ever possible brighter future. But, is that all it has brought to us? What’s more that it could offer and what’s the catch? Do remember, it’s just the beginning.\r\n", "schedule": "Week 1 Introduction\r\nWeek 2 A Bird Eye’s View on the History of Technology\r\nWeek 3 The Science behind Technology (1)\r\nWeek 4 The Science behind Technology (2)\r\nWeek 5 From Encyclopedia Britannica to Wikipedia\r\nWeek 6 Mobile Devices: Are Smartphones Really Smarter?\r\nWeek 7 Behind All the Flashy Chips: Impacts on Our Environment\r\nWeek 8 Sun, Air and Water: Alternative Energy\r\nWeek 9 Mid-term exam\r\nWeek 10 Spotting Nanotechnology in Our Daily Life\r\nWeek 11 A Photonic World: Laser and OLED\r\nWeek 12 Biopharma: When Biologics Meet Chemical Drugs\r\nWeek 13 Regenerative Technology: Can My Cord Blood Really Save Me One Day?\r\nWeek 14 Genetic Therapy: Being My Sister’s Keeper\r\nWeek 15 Vaccines: Should I Stay or Should I Go?\r\nWeek 16 What could Go beyond the Reach of Technology (1)\r\nWeek 17 What could Go beyond the Reach of Technology (2)\r\n", "scorePolicy": "Class Presentation 40%\r\n“Technodrama” Play 30%\r\nClass Performance 30%\r\n", "materials": "科技發明史: 從石器時代到電腦時代 威廉士 (Williams, Trevor I.) 著 出版者:\t風雲時代；電腦史話 林傑斌 等譯 出版者:銀禾；圖解奈米科技 川合知二 出版者:工研院奈米中心；分子世界大未來 穆赫爾 (Mulhall, Douglas)出版者:商周出版；Saved by the SUN WGBH Video (Firm) 出版者:WGBH Boston Video；光電漫談 黃忠偉 著 出版者:臺灣書店；能源停看聽 米歇爾 (Michel, Francois) 出版者:鄉宇文化；DNA的14堂課 德利卡 (Drlica, Karl A.) 著 出版者:天下遠見出版；現代生物科技與應用 國立臺灣科學教育館；\r\n", "foreignLanguageTextbooks": false}]