[{"name": "勞維俊", "email": "lolouis@graduate.hku.hk", "latestUpdate": "2018-08-07 22:16:07", "objective": "本課程旨在藉由各種文化媒體（如文學作品，書報雜誌，期刊論文，電影等影音文字）引導學生選擇性地認識英國、愛爾蘭、美國、加拿大、非洲、澳洲、紐西蘭、印度、巴基斯坦、新加坡、香港、菲律賓、加勒比海等國家或地區的文學與文化。藉由認識上述這些國家或地區的英語文學與文化，擴展學生英語文應用的宏觀視野，並使之具備促進異國情感及文化交流的能力。", "schedule": "Aims:\r\n\r\nThis course focuses on a chosen theme in world literatures and cultures, aiming to train students’ ability to investigate, both textually and theoretically, a theme within cultural production. Integrating the knowledge and insights students have acquired in other courses, this course approaches literature comparatively. In the process of examining what a particular theme means in different cultural contexts, students should acquire further techniques which will be important throughout their studies.\r\n\r\nOutlines: Revenge in world literature and cinema\r\n\r\nVirtually all works of literature (great or minor, classic or popular, literary or non-literary) are fascinated by revenge. It seems that the logic of human interactions has been dominated by the logic of vengeance. This course analyses how revenge is represented in cultural production including literature, film and various art works from Greek tragedies to contemporary films, including the European tradition and the modern Asian. \r\n\r\nThis course investigates to what extent revenge is ‘natural,’ instead of being culturally produced. Related issues including the concept of justice, the sense of guilt, law, time, gender, identity, anger, and violence will be examined by referring to different theoretical frameworks.\r\n\r\nCourse Outline: \r\n\r\n1. Introduction: Revenge as an universal idea\r\n\r\nWild Tales (2014, dir. Damin Szifron) \r\n\r\n2. Revenge as “a dish best served cold”: \r\n\r\nBlake’s “A Poison Tree” (poem) \r\nBorges’s “Emma Zunz” (short story) \r\n\r\nGentileschi’s Judith Slaying Holofernes and Judith and her Maidservant (paintings) (Italian)\r\n\r\n3. Holiday (no class)\r\n\r\n4. Revenge and justice: \r\n\r\nA Short Film about Killing (1988, dir. Kieslowski)\r\n(Nietzsche’s “On Redemption” in Thus Spoke Zarathustra) \r\n\r\n5-6. Revenge and Ressentiment\r\n\r\nDostoyevsky’s Notes from Underground  (novella)\r\n(Nietzsche’s On the Genealogy of Morals  - on ressentiment)\r\n(Nietzsche’s ‘On the Tarantulas’ in Thus Spoke Zarathustra)\r\n\r\n7-8. Revenge and national guilt \r\n\r\nDogville (2005, dir. Lars von Trier)\r\n\r\nHidden (2015, dir. Michael Haneke)\r\n\r\n9. Mid-term paper due\r\n\r\n10-12. Thomas Kyd’s The Spanish Tragedy\r\n\r\n13-14. Shakespeare’s Hamlet\r\n\r\n15-16. Revenge and Incest: \r\n\r\nOldboy (2003) (dir. Park Chan-wook) \r\nPieta (2012) (dir. Kim Ki-duk)\r\n\r\n17. Holiday (no class)\r\n\r\n18. Final essay due", "scorePolicy": "Assessment: \r\n\r\n\tTutorial \t\t\t\t10%\r\n\tPresentation \t\t        30%\r\n\tMid-term essay\t\t30%\r\n        Final essay\t\t        30%", "materials": "Bibliography:\r\n\r\nPrimary Texts:\r\n\r\nBorges, Jorge Luis. ‘Emma Zunz’ in Collected Fictions. Trans. Andrew Hurley. Harmondsworth: Penguin, 1998\r\n_______________. ‘Death and the Compass’ in Collected Fictions. Trans. Andrew Hurley. Harmondsworth: Penguin, 1998\r\nDickens, Charles. Great Expectations. Ed. Angus Calder. Harmondsworth: Penguin, 1985\r\nEuripides. Bacchae in The Bacchae and other Plays. Trans. Philip Vellacott. Harmondsworth: Penguin, 1973\r\nFreud, Sigmund. ‘Criminals from the Sense of Guilt’ in Penguin Freud 14: Art and Literature. Trans. James Strachey et al. Harmondsworth: Penguin, 1985\r\nLawrence, D.H. ‘Tickets, Please’ in England, My England. Harmondsworth: Penguin, 1966\r\nMiddleton, Thomas. The Revenger’s Tragedy. Ed. Brian Gibbons. New York: W.W. Norton, 1967\r\nNietzsche, Friedrich. The Birth of Tragedy. Trans. Walter Kaufmann. New York: Vintage, 1967\r\n________________. ‘Thus Spoke Zarathustra’ in The Portable Nietzsche. Ed. & trans. Walter Kaufmann. Harmondsworth: Penguin, 1976\r\nPoe, Edgar Allan. ‘The Purloined Letter’ in The Purloined Poe. Ed. John P. Muller and William J. Richardson. Baltimore: The Johns Hopkins University Press, 1988.\r\nShakespeare, William. Hamlet (Arden Shakespeare: Second Series). Ed. Harold Jenkins. London: Arden, 1982\r\nVon Kleist, Heinrich. ‘Michael Kohlhaas’ in The Marquise of O and Other Stories. Trans. David Luke et al. Harmondsworth: Penguin, 1978\r\n\r\nFilms:\r\nJSA: Joint Security Area (2000). Dir. Park Chan-wook\r\nOldboy (2003). Dir. Park Chan-wook\r\nHidden (2005). Dir. Michael Haneke\r\n\r\nPaintings:\r\nGentileschi, Artemesia. Judith Slaying Holofernes. Oil on canvas 199 x 162 cm. Florence: Galleria degli Uffizi, 1614-20\r\n __________________. Judith and her Maidservant. Oil on canvas 114cm x 93.5cm Florence: Palazzo Pitti, 1613-14\r\n\r\nReference: (to be expanded)\r\nKerrigan, John. Revenge Tragedy: Aeschylus to Armageddon. Oxford: Clarendon Press, 1996\r\n\r\nSuggested Texts for Presentation:\r\nDogville (dir. Von Trier)\r\nRope (1929) or Vertigo (1958) (dir. Hitchcock)\r\nA City of Sadness (悲情城市) (1989) (dir. Hou Hsiao-hsien)\r\nA Brighter Summer Day (牯嶺街少年殺人事件) (1991) (dir. Edward Yang)\r\nLa Tourneuse de Pages (Page Turner) (2006) (dir. Denis Dercourt)\r\nIncendies (2010) (dir. Denis Villeneuve)", "foreignLanguageTextbooks": true}]