[{"name": "張素薰", "email": "shchang@ntut.edu.tw", "latestUpdate": "2018-09-08 22:51:48", "objective": "本課程利用新聞教材加強英語字彙能力及聽力技巧, \t內容採用電台、報紙、電視的時事、深度報導和全球議題以增強學生英語知識。同時, 學生亦可獲得各種有用的聽力技巧以加強英語聽力。", "schedule": "Journalistic English & Listening Training\r\nIntroduction:\r\nThis course is designed to fortify English listening and speaking abilities by exploring different aspects of the contemporary themes in which vocabulary build-up and its application to relevant topics are emphasized. Current events, in-depth reports as well as global issues from radio, newspapers and T.V are provided. \r\nBasic Doctrines:\r\n1.\tExpose students to cosmopolitan themes that are up-to-date, sophisticated and varied in tone, with a view to stimulating students more profoundly and to accelerating their retaining and using in the target language.\r\n2.\tThe films of contextually rich—cultural background and competent knowledge-related to the corresponding themes are provided to integrate the skills of the target language.\r\n3.\tLanguage capability and performance are equally stressed and developed.\r\n4.\tStudents’ active participation is essentially required.\r\n5.\tIndividual reflection is perceived by pair and group works, out-of-class assignments for review and research, oral reports and specific presentations.\r\n\r\n\r\n\r\nAssessment:\r\n1.\tWeekly tests and Attendance (20 points maximum deduction). 80%\r\n2.\tOral reports and presentations. 20%\r\n3.\tTeacher’s website: http://www.cc.ntut.edu.tw/~shchang/2018/\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nSyllabus for 4E1 Multimedia English Listening and Speaking, \r\n2018(1)一零七學年度第一學期\r\nWeek\tClassification \tEnglish News\tFriends (S1)\r\n1\tIntroduction\r\n2\tHealth\t1.\tPeople with high blood pressure\r\n at higher risk for vascular dementia: study (2018/07/13)\t1\r\n3\t\t2. Major hospitals ordered to reduce numbers at outpatient clinics (2018/07/02)\t2\r\n4\tTechnology\t3.Government is encouraging companies to capture a larger slice of the global medical devices market (2018/06/10)\t3\r\n5\t\t4. Computex opens tomorrow with a focus on gaming, AI and IoT (2018/06/04)\tStage Play\r\n6\tBusiness\t5. Banks shutter branches as customers turn to online banking (2018/07/24)\t4\r\n7\t\t6. Entrepreneurs hoping to cash in on unmanned shops (2018/07/06)\t5\r\n8\tLife\t7.Entrepreneurs creating\r\n eco-friendly substitutes ahead of plastic straw ban (2018/07/09)\t6\r\n9\t\tMid-term\r\n10\t\t8. Poultry operator cuts bird flu risk with high-tech chicken coop (2018/07/23)\t7\r\n11\tSociety\t9. Amid soaring rents, Taipei laborers pay nearly 60% of wages on housing: survey (2018/07/26)\t8\r\n12\t\t10. High school students take the Advanced Subjects Test, a university entrance exam, in soaring heat (2018/07/01)\t9\r\n13\tEnvironment\t11. Industrial pollution offset scheme launched in overhaul of Air Pollution Control Act (2018/06/26)\tDemonstration\r\n14\t\t12. Downpours fail to dispel water shortage, but tropical storm expected on Sunday (2018/06/07)\t10\r\n15\tTraffic\t13. EasyCard co-branded credit cards get new features (2018/07/05)\t11\r\n16\t\t14. ITRI to roll out self-driving vehicle by year’s end (2018/07/02)\t12\r\n17\t\tPowerpoint Presentation\r\n18\tFinal Report", "scorePolicy": "Evaluation:\r\n1.\tWeekly Tests and appearance, one absence being reduced two points. 80%\r\n2.\tPresentations and Reports. 20%\r\n\r\nThe way to get into contact with the teacher:\r\n1.\tTeacher’s website: http://www.cc.ntut.edu.tw/~shchang/2018/\r\n2.\tTeacher’s e-mail: shchang@ntut.edu.tw", "materials": "　", "foreignLanguageTextbooks": false}]