[{"name": "黃如瑩", "email": "vinia@ntut.edu.tw", "latestUpdate": "2018-06-12 01:18:08", "objective": "本課程旨在培養學生成為兼具豐富社會文化\"識力\"與英美文學\"學力\"的專業英語人才。引導學生探索文學作品與其社會背景，認識各種不同類型文學作品與其背後的文化發展歷程，也會從人類歷史每個重要發展階段來看指標作家與作品與其寫作理念。課程中將探討英美詩詞、散文、小說、戲劇等文學類型的特點，透過分析作品，解讀作品，了解文化脈絡與社會議題，奠立學生英語世界的宏觀與遨遊英語文化的基礎。", "schedule": "1.課程大綱\r\n本課程在英語世界的文化發展歷史中,依照主要斷代的先後順序來引介最能表現該斷代文化特色與思想潮流的文學作品.目的是幫助學生做文化脈絡與文學表現的統整聯結,期待學生能融會貫通,對比東西方文明的特色.\r\n2.課程進度\r\nUnit 1~~Introduction 課程簡介\r\nTHEME ONE: The earliest piece of English literature英國文學的濫觴\r\nUnit 2~~Beowulf (selections)貝爾武夫(節選)\r\nThe hero from the northern sea: Beowulf and his heroic deeds 北海的英雄: 貝爾武夫與他史詩般的英勇事蹟\r\nTHEME TWO: The Middle Ages 中古世紀\r\nUnit 3~~Sir Gawain and the Green Knight (selections) 蓋文爵士和綠騎士\r\nThe legends of the Middle Ages: King Arthur and his knights中古世紀的傳奇: 亞瑟王和他忠誠的騎士伙伴\r\nUnit 4~~The Canterbury Tales (selections) by Chaucer坎特伯利故事集 節選\r\nAll walks of medieval secular life: Chaucer and a diversity of pilgrims中古世紀的世俗文學: 喬叟和他筆下栩栩如生的朝聖民眾\r\nTHEME THREE: The Renaissance 英國文藝復興時期\r\nUnit 5~~Hamlet, Prince of Denmark (selections) by Shakespeare 哈姆雷特\r\nThe splendors of the Renaissance in Britain: Drama, poetry, and prose文藝復興在英國發出榮光:戲劇,詩,與散文的蓬勃表現\r\nUnit 6~~Dr. Faustus (selections) by Christopher Marlowe 浮士德 節選\r\nExploring the limits of human capabilities and the final destination of one’s soul due to its deliberate choice人類智能的局限和靈魂最終歸屬\r\nUnit 7~~Paradise Lost (selections) by John Milton失樂園 節選\r\nReviewing the relationship between human beings and God and justifying God’s salvation of human souls再次審視人類與上帝的關連,闡明上帝對人類靈魂的救贖之道\r\nTHEME FOUR: The Enlightenment and Neo-classicism 啟蒙運動和新古典主義\r\nUnit 8~~Gulliver’s Travels (selections) by Jonathan Swift 格列佛遊記 節選Interrogating shared fundamental values in human societies and disclosing human moral defects by the contrast with other species以諷喻的手法和理性的角度,詰問人類普遍抱持的基本價值觀,並透過別的物種來剝檢人性一層層的可憎\r\nTHEME FIVE: The English Romanticism 英國浪漫主義時期\r\nUnit 9~~\r\n(1) “The Tyger,” “The Lamb,” “The Little Black Boy,” and “The Chimney Sweeper” by William Blake 布萊克”天真之歌”與”經驗之歌”的兩相映照;\r\n(2) “I wandered Lonely as a Cloud,” and “Lines Composed a Few Miles above Tintern Abby” (selections) by William Wordsworth 沃茲沃斯對大自然虔誠信賴,視之為孕育良善,以及滌塵返清之所在\r\nUnit 10~~\r\n(1) “Kubla Khan” and “The Rime of the Ancient Mariner” (selections) by Samuel Taylor Coleridge古舟子吟 節選  柯立芝超現實夢境所窺見的魔幻大自然與人內在心魔的角力;\r\n(2) “When We Two Parted” by George Gordon, Lord Byron 拜倫的澎湃熾愛\r\n(3)”Ode to the West Wind” by Percy Bysshe Shelley 雪萊的西風是毀滅還是新生的力量?\r\n(4)”Ode on a Grecian Urn” by John Keats 濟慈在古希臘甕上看到的永恆藝術與活力生命之間的拉力\r\nTHEME SIX: American Renaissance美國文藝復興\r\nUnit 11~~\r\n(1) Song of Myself  by Walt Whitman: 惠特曼的自我之歌是否也包含了美國人的國家認同?\r\n(2) Poem by Emily Dickinson 艾蜜莉.狄克遜在她那些字面上看起來簡單卻寓意深湛的短詩裡,靜悄悄地在敘述什麼樣的(女性)自我?\r\nUnit 12~~ Moby Dick (Selections) by Herman Melville白鯨記節選: 梅爾維爾所描繪的白鯨是從主角深遂潛意識冒衝上來的暗影嗎?\r\nUnit 13~~\r\n(1)”Young Goodman Brown” by Nathaniel Hawthrone 霍桑筆下新英格蘭地區的一位清教徒如何從虔誠敬畏逐步喪失他的信仰?\r\n(2) “The Black Cat” and “The Masque of the Red Death” by Edgar Alan Poe:艾倫坡的心理(病理)恐怖小說令人不寒而慄\r\nTHEME SEVEN: The 19th -and 20th –Century modernity and modernism: 現代主義各家: Realism, Symbolism, Naturalism, Existentialism, Magic Realism\r\nUnit 14~~Reflections on Britain’s colonization of foreign lands英國對其它地域的殖民統治與影響\r\n(1) Heart of Darkness (selections) by Joseph Conrad黑暗之心 節選\r\n(2) A Passage to India (selections) by E.M. Forster 印度之旅 節選\r\nUnit 15~~Reflections on modern civilization and modernity現代文明的走向與現代人的道德價值崩解\r\n(1)”Sailing to Byzantium” by W. B. Yeats\r\n(2)”The Love Song of J. Alfred Prufrock” by T.S. Eliot\r\nTHEME EIGHT: Global environmental issues and racial/class conflicts\r\nUnits 16~18", "scorePolicy": "Percentile distribution of final grade:\r\n1.Presence and participation in classroom discussions出席與課堂討論: 40%\r\nFour absences will automatically lead to \"failure\" for this course.\r\n2.Homework and oral reports 作業與口頭報告:30%\r\n3.Final project presentation （written paper and oral presentation) 期末報告呈現: 30%", "materials": "Reference參考書籍:\r\n(1)一生必讀的英文小說:經典與大眾小說導讀賞析. 陳超明 著. 台北: 聯經 出版, 2011年.\r\n(2)一本讀通世界文學名著. 王淑絹 譯.台北: 商周出版社, 2010年.\r\n(3)小說的五十堂課. 大衛.洛吉 著.  李維拉 譯. 台北: 木馬, 2006年", "foreignLanguageTextbooks": true}]