[{"name": "陳映竹", "email": "ycchen@ntut.edu.tw", "latestUpdate": "2018-07-26 22:25:14", "objective": "Course Description \r\nEnvironmental pollution can be classified into water, air, soil, waste, and other pollutions. These issues are well known by researchers and general public; however, pollutions from construction sites are seldom studied and discussed. Thousand cases of constructions are working monthly, and their potential pollutions can be great impact the environment. The course introduced potential pollution from construction sites and suggested methods to minimize it efficiently.\r\n\r\nCourse Goals \r\nConstruction sites, such as roads and freeways, are important to economic development. During construction, however, such projects pose a significant risk to the environment, which must be addressed out. Compliance with these should minimise the effect of the work on the environment. By the end of the semester, students who complete all necessary assignments will be able to: \r\n1.\tUnderstand major concepts and terminology in the field of construction. \r\n2.\tEvaluate pollution from construction sites and control them.", "schedule": "1\t09/11-13      Class syllabus, grading system, text book and references\r\n2      09/18-20      Pollution & disaster\r\n3\t09/25-27      Pollution prevention planning\r\n4      10/02-04\t    Noise & vibration\r\n5\t10/09-11      Air pollution (1/2)\r\n6\t10/16-18      Air pollution (2/2) \r\n7\t10/23-25      Water pollution\r\n8\t10/30\t     Stormwater pollution prevention plan (SWPPP) (1/2)\r\n9\t11/06  \t     Mid-term exam\r\n10\t11/13-15       Soil pollution & land subsidence\r\n11\t11/20-22       Waste & contaminated materials\r\n12\t11/27-29       Landscape destruction\r\n13\t12/04-06       Inspections, monitoring & audits\r\n14\t12/11-13       Stormwater pollution prevention plan (SWPPP) (2/2)\r\n15\t12/18-20       Construction automation\r\n16\t12/25-27       Sustainable construction\r\n17\t01/03-10       Students’ group reports\r\n18    01/08\t     Final exam", "scorePolicy": "1. Mid-Term (30%)\r\n2. Final Exam (30%)\r\n4. Group report (30%): SWPPP\r\n5. Participation (10%)", "materials": "1.\tEnvironmental Guidelines for Major Construction Sites, EPA Victoria Publication, 1996.\r\n2.\tDeveloping Your Stormwater Pollution Prevention Plan, A Guide for Construction Sites, US EPA, 2015. \r\n3.\tWorking at construction and demolition sites: PPG6, Pollution Prevention Guidelines, Environment Agency Horizon House, 2012. \r\n4.\tControl of Pollution & Noise from Demolition & Construction Sites, Code of Practice, 2008.\r\n5.\tPollution Control Guide, BRE Environment.\r\n6.\tPollution Control Construction Site, Regulatory & Supporting Services Environment, Cardiff, 2013.\r\n7.\t營建自動化-營建自動化之發展與概況，劉俊杰副教授，2000。\r\n8.\t公共工程施工災害預防與案例探討，行政院勞工委員會北區勞動檢查所 李文進副所長，2011。\r\n9.\t營建工程污染防治，行政院環保署永續發展室 技監兼執行秘書 劉宗勇。", "foreignLanguageTextbooks": true}]