[{"name": "施議訓", "email": "ys8034@yahoo.com.tw", "latestUpdate": "2011-09-22 19:23:45", "objective": "本課程講述瞭解品質管理之理論。本課程之目的在使學生能建立品質管理基本知識，可進一步將研究中所觀察之品質管理行為與理論機制加以結合。\nThis course introduces the Quality Management Principle. The objective of this course is to establish the fundamental knowledge of Quality Management for the students and to further connect the observed Quality Management behavior to the theoretical mechanisms in researches. \n本標準所規定的要求是通用的，以期適用於各種類型、不同規模和提供不同產品的所有組織。\nAll requirements of this International Standard are generic and are intended to be applicable to all organizations, regardless of type, size and product provided.\n當本標準的任何要求由於其組織及產品的特點而不適用時，可對此要求考慮進行排除。\nWere any requirement(s) of this international Standard cannot be applied due to the nature of an organization and its product, this can be considered for exclusion.\n排除限于第七章中那些不影響組織提供滿足顧客和適用法規要求的產品的能力或責任的要求，否則不能聲稱符合本標準。\nWhere exclusions are made, claims of conformity to this International Standard are not acceptable  unless these exclusions are limited to requirements within clause 7, and such exclusions do not affect the organization’s ability, or responsibility, to provide product that meets customer and applicable regulatory requirements.", "schedule": "1\t Introduction\t                  1 week\n2\tQuality Management Principle\t2 weeks\n3\tIntroduction of ISO 9001:2008\t2 weeks\n4\tQuality Management System.\t         3 weeks\n\t期中考\t                           1 week\n5\tManagement responsibility.\t         3 weeks\n6\tResource management  \t         2 weeks\n7\tProduct realization.\t         2 weeks\n8\tMeasurement, analysis, and improvement.  \t1 week\n\t期末考\t                               1 week", "scorePolicy": "學習評量方式(Evaluation) (期中考：30%, 期末考：40%, 報告：20%, 其他：10% )\n1.期中考試（Midterm Examination）(30%)：\n期中考試之目的主要在於評量學生對課堂講授資料的了解程度，培養同學課後複習的習慣以及思考問題的能力，並且作為課程內容調整之依據。\n2.期末考試（Final Examination）(40%)：\n期末考試之目的主要在於評量學生對課堂講授資料的了解程度，培養同學課後複習的習慣以及思考問題的能力，並且作為課程內容調整之依據。\n3.報告(Report)(20%)：訓練學生撰寫與整理的能力。", "materials": "教科書（書名、作者、書局、代理商、說明）(Textbook)\n1. “國際品質管理系統(ISO 13485)”, 全華科技圖書公司. 2005.\n2. “品質管理”, 全華科技圖書公司. 2006.\n3. “品質管制”, 全華科技圖書公司. 2006\n4.其他", "foreignLanguageTextbooks": false}]