[{"name": "廖昭文", "email": "cwnliaw@ntut.edu.tw", "latestUpdate": "2011-08-26 09:47:28", "objective": "課程重點：(1)藉由適合其程度的教材加強學生必備的基礎文法觀念和句型結構；(2)使學生確切把握閱讀要領以及充分瞭解寫作的各種技巧，重心在生字、片語、句法的解釋和基本寫作技巧的分析；(3)熟悉英語人士日常生活情境及與學生將來就業環境相關之會話及適當之應對方式；(4)透過練習加強聽、說、讀、寫的知能及表達。", "schedule": "Week 1: Course introduction; Relationshops: I didn't recognize you.  Week 2: The home of the olive; Relationshops: I didn't recognize you.  Week 3: The home of the olive; Identity: I've got to be myself.  Week 4: Sofrito sensation;  Identity: I've got to be myself.   Week 5: Song of the Humpback; Advice: If you don't mind my saying so.   Week 6: Dogs in human world; Advice: If you don't mind my saying so.  Week 7: Was King Tut murdered?  Family: I'm sure you'll get along with them.  Week 8: Who Killed the Iceman? Family: I'm sure you'll get along with them.     Week 9: Midterm exam    Week 10: Pompeii and Herculaneum, Italy; Decisions: I can't make up my mind.   Week 11: Grand Central Terminal; Decisions: I can't make up my mind.   Week 12: Mumbai: city of dreams; Review Unit 1  Week 13: The flooding of New Orleans; Language: It's hard to understand him sometimes.  Week 14: Tropical Cyclones ;Language: It's hard to understand him sometimes.   Week 15: Tropical Cyclones; Personality: She' s not my type. Week 16: Cities beneath the sea; Personality: She' s not my type.    Week 17: Cities beneath the sea  Week 18:Final Exam", "scorePolicy": "Attendance, quizzes, assignments       30%\nMidterm exam                30%\nFinal exam               40%", "materials": "Reading Explorer 2, MacIntyre, P, Heinle, Cengage Learning, 2009\nImpact Listening 3, Harsch, Kenton & Wolfe-Quintero, Kate, pearson Longman Asia ELT", "foreignLanguageTextbooks": false}]