[{"name": "楊韻華", "email": "yhyang@ntut.edu.tw", "latestUpdate": "2011-09-09 09:07:36", "objective": "本課程重點為（一）為簡淺明確的商用英文、（二）與時並進的國際經濟貿易實務，內容涵蓋法律、外匯與銀行、倉儲運輸，國際金融、國際行銷學、廣告學、包裝學、海上保險及度量衡。\nCourse Title:\t\tEnglish for Economics and International Business (經貿英文)\nCredit Hours:\t\t3\nTerm Offered:\t\tFall, 2011\nInstructor’s Name:\tDr. Yun-Hua Yang\nContact E-Mail:\tyhyang@ntut.edu.tw \nOffice \t\t\tGeneral Education Building Rm#805\nOffice Hours:\t\tBy Appointment \nCourse Description: The course is designed for English-major students who wish to increase their knowledge in business-related issues and expertise in future business practice.  All students enrolled in this course are expected to be equipped with an advanced level of English proficiency as well as basic knowledge of effective business communication as it continues where Business English Writing left off. This course covers fundamental business concepts, important current business events, essential business terms, and comprehensive language used in business practice. Business content vocabulary incorporating several main business categories / disciplines will be introduced. Also, students are required to read the current issues of several prestigious business publications, including but not limited to, Fortune, The Economist, BusinessWeek, Wall Street Journal and the New York Times. \nCourse Objectives:  This course centers its focus on understanding business context in English, and it aims to help the students:\n(1)\tlearn about business through the medium of English \n(2)\tpromote high level of awareness of the business climate \n(3)\timprove reading comprehension of articles relating to business\n(4)\tdevelop functional business language in English \t\nCourse requirements:\nEach student must complete the following requirements:  \n1)\tattendance* noted for grading details\n2)\treading all materials assigned \n3)\ttaking lecture notes for presentation  \n4)\tin-class quizzes based on the reading materials", "schedule": "Grading Policy:\t1) Final Exams 30%\n\t\t\t\t2) In-class quizzes 30%\n\t\t\t\t3) Presentation  10%\n\t\t\t\t4) Attendance  30%\t\nLeaves and Absences: \t1) Any AWOL will result in the penalty of 10% semester grade deduction.\n\t\t\t\t  \t2) Penalty-waiver can be granted for any absence w/ official document at the \n\t\t\t\t\t   \t instructor’s discretion. It is only limited for one time in the entire semester. \nShould there be any major incidents and issues, special considerations will be given after thorough discussion with the student(s) and the class advisor(s). \n3) Each lateness, after the instructor finishes the second-round roll call, will result in the penalty of 5% semester grade deduction. \n\nLecture Notes Guideline(s): 1) All students are required to take notes on the lectures. Students will be required to present content lectured and discussed in class every other week. Presentation will have to incorporate class content and additional research. \n\t2) Individual and pair format presentation are both allowed for 5 and 7 minutes respectively. No more than 3 presentations will be introduced in one class session. \n2) All notes taken need to be compiled for submission a week before the midterm and final exam.", "scorePolicy": "Weekly Syllabus\nWeek \tContent Reading & Discussion (Q&A included)\tBusiness Content /Vocab.\nWk 1 \tOrientation / The Joy of Economics \tInternational trade \nWk 2\tEconomics: The Case for Globalization \tExchange rates \nWk 3\tEconomics: The Case for Globalization \tFinancing and international trade/ Incoterms \nWk 4\tEconomics: The Case for Globalization \tThe business cycle / Taxation \nWk 5\tBrands and Branding: What is a brand? \tBusiness Plans \nWK 6\tBrands and Branding: The financial value of brands / The social value of brands \tMoney and Income\nBusiness Finance\nWK 7\tBrands and Branding: What makes brands great? \tCompany Laws 1/2\nWK 8\tEconomics: The lopsided world economy--The phony recovery\tThe Balance Sheet 1/2/3\nWK 9\tEconomics: The lopsided world economy--The phony recovery\nEconomics: The lopsided world economy—China’s rise\tOther Financial Statements\nWK 10\tEconomics: The lopsided world economy—China’s rise \tPersonal /commercial and retail banking \nWK 11\tBrands and Branding: Best practice in Branding---Brand positioning and brand creation \tFinancial Institutions\nInvestment Banking\nWK 12\tBrands and Branding: Best practice in Branding---Brand positioning and brand creation\tCentral Banking / Interest Rates\nWK 13\tBrands and Branding: Best practice in Branding---Brand experience \tMoney markets/\nMoney Supply and Controls \nWK 14\tBrands and Branding: Best practice in Branding--- Brand experience\tStocks and shares 1/2\nWK 15\tBrands and Branding: Best practice in Branding---The public relations perspective on branding \tShareholders/ Bonds/ Futures\nWK 16\tBrands and Branding: Best practice in Branding--- The public relations perspective on branding\tDerivatives / Hedge funds and structured products \nWK 17\tReview \tMergers and takeovers/ Leveraged buyouts \nWK 18\tFinal Exam \t\n(The weekly syllabus is subject to change.)", "materials": "Required Text:    (1) Professional English in Use by Ian Mackenzie  \n                (2) The Economist Series as assigned", "foreignLanguageTextbooks": false}]