[{"name": "周素鳳", "email": "sfchou@ntut.edu.tw", "latestUpdate": "2011-09-08 21:54:51", "objective": "Course Description\nThis is a two-semester course focusing on written translation.  Written translation involves not only the transferring of words between two languages but also the construction of a text, a culture and an identity, the result of which exerts significant influences on the target society.  In this semester, we will discuss the technical issues specific to lexical, syntactical and semantic differences in translating English into Chinese, and examine various cultural issues involved in the act of translation.  Students will be asked to undertake 3 translation projects, and in pair work, comments on each other’s translated texts.", "schedule": "week\tDate\tTopic\n1\t9/14\tIntroduction\n2\t9/21\t英漢詞彙與句法的對比\n3\t9/28\t辭意的選擇,引申和褒貶\n4\t10/5\t詞類轉譯\n5\t10/12\t增詞法 \n6\t10/19\t重複法\n7\t10/26\t省略法\n8\t11/2\t正反表達法\n9\t11/9\t分句、合句法\n10\t11/16\t被動語態的譯法\n11\t11/23\t名詞子句的譯法\n12\t11/30\t形容詞子句的譯法\n13\t12/7\t副詞子句的譯法\n14\t12/14\t長句的譯法\n15\t12/21\t習慣語的譯法\n16\t12/28\t外來語的譯法\n17\t1/4\t誤譯分析\n18\t1/11\tReview and Discussion", "scorePolicy": "Grading:\n1. Review Tests: 20%\n2. Translation Practice: 40%\n3. Translation Projects: 40% (Project 1:10%;  Project 2=10%;  Project 3: 20%)", "materials": "Required texts: 張培基等，《英漢翻譯教程》，書林。\n\nRequirements:\n1.\tPlease submit your translation projects on time. Delayed submission will NOT be accepted on any account.\n2.\tThere will be in-class translation practices and review tests to help you better grasp the essentials of each unit.  You have to submit your written practices or tests before the end of the class.  There is no way to make up for the translation practice or review test you miss.  No exceptions!  However, your lowest score will be dropped—so, save this for the unexpected occasion when you might be sick or miss class for other reason.\n3.  Any errors in your work resulting from an unwillingness to look something up in a dictionary or grammar reference will have a negative impact on your translation grade. \n3.\tYour regular attendance is required to pass this class.  3 unexcused absences from class will result in failing this course.  Excused absences require that I be notified on or before the class date, or with official documentation shortly after the absence.  One unexcused absence will result in an automatic final score reduction of 3 points.  If you are more than 15 minutes late to the class, it will be counted as an absence.  One late attendance means a 1 point reduction from your final score.", "foreignLanguageTextbooks": false}]