[{"name": "王致悅", "email": "cw5b@msn.com", "latestUpdate": "2011-09-16 11:37:59", "objective": "本校之普通物理課程專為工程科系背景之同學設計，主要的目的是鼓勵同學參與大自然運行奧秘、法則之探索，並供給爾後修習專業課程之堅實基礎。本課程之內容包含力學、熱力學、聲學、電磁學、光學及近代物理。本課程不但著重建立廣泛的物理基礎、理解我們這個物理宇宙，也強調物理在技術上的應用、培養思考與解決問題的的能力，增益人生發展。\n教學方法 :\n課程講授以講演、討論、習題演練與學生報告等不同方式進行，加強師生互動以及學生對學習之參與。內容闡釋物理學各領域的發展與概要、介紹物理學對人類科技與應用科學發展之重要性、並利用物理基本原理觀念以及微積分等數學方法分析、推導、演算和解釋實際物理問題。為加強學生對原理和觀念的了解，課後作業和習題的計算非常重要。\nFundamentals of physics are the basis of all scientific and engineering disciplines. This course offers students an opportunity to study the basic principles of physics and their applications, and to acquire problem solving ability in various realistic situations. Interesting topics in the engineering fields will also be presented.\nContents of the lectures include (1) classical mechanics, such as kinematics, Newton's laws of motion, the laws of conservation of energy, momentum, and angular momentum; the translational motion of particles, rigid bodies, and fluids; the rotational motion of rigid bodies; static equilibrium, oscillations, simple harmonic motions; as well as (2) thermodynamics, (3) optics, (4) electromagnetism, and (5) modern physics such as relativity. The ultimate goal of this course is to provide students a full understanding of the physical universe, benefiting the development of both their professional career and personal lives.", "schedule": "第1週 09/13 - Ch 1, Units, Dimensional analysis\n第2週 09/20 - Ch 2-4, Motion along a straight line, Vectors, Motion in two and three dimensions\n第3週 09/27 - Ch 4-5, Centripetal force, Newton's Laws\n第4週 10/04 - Ch 5-6, Drag force and terminal speed, Uniform circular motion,\n第5週 10/11 - Ch 7-8, Kinetic energy, Work, Potential energy, Conservation of energy\n第6週 10/18 - Ch 8-9, Conservation of energy, Center of mass, Linear momentum\n第7週 10/25 - Ch 10, Rotation\n第8週 11/01 – 校慶停課\n第9週 11/08 - Ch 11-12, Rolling, Torque, Angular Momentum, Equilibrium and Elasticity\n第10週 11/15 - Ch 13, Gravitation\n第11週 11/22 - Ch 14, Fluid\n第12週 11/29 - Ch 15, Oscillations\n第13週 12/06 - Ch 16, Waves-I\n第14週 12/13 - Ch 17, Waves-II\n第15週 12/20 - Ch 18, Temperature, Heat and 1st law of thermodynamics\n第16週 12/27 - Ch 19, Kinetic theory of gases\n第17週 01/03 - Ch 20, Entropy and 2nd law of thermodynamics\n第18週 01/10 - Final Exam", "scorePolicy": "10% attendance\n10% oral report, discussion, participation\n40% final exam\n20% quiz (biweekly)\n20% homework\n* 老師期望學生出席準時全勤並主動參與報告討論。", "materials": "Halliday, Resnick & Walker, Principles of Physics, 9th Ed.\nWiley Plus (online tutorial system)", "foreignLanguageTextbooks": false}]