[{"name": "徐健達", "email": "atatsu@seed.net.tw", "latestUpdate": "2011-09-28 10:51:55", "objective": "本課主旨在設計課程，提供練習，俾使學生嫻熟各式的英語測驗，如全民英檢、托福測驗、TOEIC 測驗或類似性質的測驗，希冀能夠藉由本課程的修習，提升學生不斷的學習外國語的興致，並且，藉由通過考試取得證照，增加未來職場的競爭力。\n\n\nThe primary goal of GEPT Preparation Course is to better prepare students for taking the Intermediate GEPT by familiarizing them with the test format and training their proficiency in English reading and listening through regular drills and exercises. Close attention will also be directed to the productive use of online English-learning resources and the development of an active learning attitude so as to help students keep improving their English ability beyond the classroom. \n\nThe course adopts an interactive approach to language learning by offering students ample opportunities to explore written texts, practice simulation tests, and challenge reading and listening tasks in class. GEPT Preparation Course will begin with a four-week preliminary session that includes an introduction to online resources for learning English in general. The formal lesson that follows will focus on weekly in-class practice and test review. \n\nPlease be noted that the course, instead of using a designated textbook, will rely exclusively on the NTUT GEPT Test Bank supplemented by simulation tests prepared by the instructor. Moreover, there will be neither mid-term nor final examination. However, students are required to tackle several in-class and take-home assignments plus a Course Project.", "schedule": "September 13\tCourse Introduction\nSeptember 19\tLearning English Anytime and Everywhere\nSeptember 26\tUse of English-English Dictionaries – Why and How\nOctober 3\t\tIntroduction to Online English Learning Resources\nOctober 10\tNational Day \nOctober 17\tApplication of Online English-Learning Resources\nOctober 24\tIn-Class Activity–Bingo Game for Independent Study\nOctober 31\tGEPT Preparation Test 1\nNovember 7\tGEPT Preparation Test 2\nNovember 14\tGEPT Preparation Test 3\nNovember 21\tGEPT Preparation Test 4\nNovember 28\tGEPT Preparation Test 5\nDecember 5\tGEPT Preparation Test 6\nDecember 12\tGEPT Preparation Test 7\nDecember 19\tGEPT Preparation Test 8\nDecember 26\tGEPT Preparation Test 9 \nJanuary 2\t\tEPT Preparation Test 10\nJanuary 9\t\tCourse Review and Self-Evaluation", "scorePolicy": "Attendance and Class Participation: 30%\nPreparation Tests and Assignments: 70%", "materials": "　", "foreignLanguageTextbooks": false}]